Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/binderhub.*.po
Languages: es

source: ## Prerequisites / recommended skill level
es: ## Pre-requisitos / nivel de conocimiento recomendado

source: | Prerequisite | Importance | Notes |
es: | Pre-requisitos | Importancia | Notas |

source: | [Version Control](/version_control/version_control) | Very Important | |
es: 5 | [Control de versión](/version_control/version_control) | Muy importante | |

source: | [Reproducible Environments](/reproducible_environments/reproducible_environments) | Very Important | Particularly read the section on [Binder](https://the-turing-way.netlify.com/reproducible_environments/reproducible_environments.html#Binder_section). |
es: | [Ambientes reproducibles](/reproducible_environments/reproducible_environments) | Muy importante | Recomendamos especialmente leer la sección sobre [Binder](https://the-turing-way.netlify.com/reproducible_environments/reproducible_environments.html#Binder_section). |

source: ## Table of Contents
es: ## Tabla de contenidos

source: - [Summary](#summary)
es: - [Resumen](#summary)

source: - [How this will help you/ why this is useful](#how-this-will-help-you-why-this-is-useful)
es: - [Cómo esto puede ayudarte/ porqué esto es útil](#how-this-will-help-you-why-this-is-useful)

source: - [What is BinderHub and why is it good for Reproducibility?](#what-is-binderhub-and-why-is-it-good-for-reproducibility)
es: - [¿Qué es BinderHub y porqué es bueno para la reproducibilidad?](#what-is-binderhub-and-why-is-it-good-for-reproducibility)

source: - [How does a BinderHub work?](#how-does-a-binderhub-work)
es: - [¿Cómo funciona BinderHub ?](#how-does-a-binderhub-work)

source: - [Compute Resources](#compute-resources)
es: - [Recursos computacionales](#compute-resources)

source: - [repo2docker](#repo2docker)
es: - [JupyterHub](#jupyterhub)

source: - [What happens when a Binder link is clicked?](#what-happens-when-a-binder-link-is-clicked)
es: - [¿Qué sucede cuando haces clic en link Binder?](#what-happens-when-a-binder-link-is-clicked)

source: - [Why would you build your own BinderHub?](#why-would-you-build-your-own-binderhub)
es: - [¿Por qué deberías crear tu propio BinderHub?](#why-would-you-build-your-own-binderhub)

source: - [Issues you may face when deploying a BinderHub](#issues-you-may-face-when-deploying-a-binderhub)
es: - [Problemas con los cuales probablemente te enfrentes al utilizar un BinderHub](#issues-you-may-face-when-deploying-a-binderhub)

source: - [Further reading](#further-reading)
es: - [Otras lecturas](#otras-lecturas)

source: - [Definitions/glossary](#definitionsglossary)
es: - [Definiciones/glosario](#definitionsglossary)

source: - [Bibliography](#bibliography)
es: - [Bibliografía](#bibliography)

source: ## Summary
es: ## Resumen

source: This chapter will discuss [BinderHub](https://binderhub.readthedocs.io/en/latest/index.html), which is the cloud technology powering [Binder](https://mybinder.readthedocs.io/en/latest/).
es: En este capítulo se discutirá [BinderHub](https://binderhub.readthedocs.io/en/latest/index.html), que es la tecnología en la nube impulsada por [Binder](https://mybinder.readthedocs.io/en/latest/).

source: We will cover the technologies and tools that BinderHub utilises and the resources you will need to setup your own BinderHub.
es: Abarcaremos las tecnologías y herramientas que utiliza BinderHub y los recursos que necesitarás para configurar tu propio BinderHub.

source: This chapter is primarily aimed at Research Software Engineers and IT Services who wish to provide a BinderHub as a service to a group of researchers.
es: Este capítulo está dirigido principalmente a especialistas en ingeniería de sistemas y servicios de TI que deseen proporcionar un BinderHub como servicio a un grupo de investigadores.

source: Though anyone can build a BinderHub.
es: Aunque cualquiera puede construir un BinderHub

source: ## How this will help you/ why this is useful
es: ## Cómo te ayudará esto/ por qué esto es útil

source: Reading this chapter will give you a clearer picture of how Binder services (such as [mybinder.org](https://mybinder.org)) operate, the technologies powering BinderHub and how they interact with one another.
es: La lectura de este capítulo te dará una idea más clara de cómo funcionan los servicios de Binder ([mybinder.org](https://mybinder.org)), las tecnologías que impulsan BinderHub y cómo interactúan entre sí.

source: This chapter also covers reasons why you might build your own BinderHub, rather than using the public service at mybinder.org.
es: Este capítulo también cubre las razones por las que podrías construir tu propio BinderHub, en lugar de utilizar el servicio público en mybinder.org.

source: ## What is BinderHub and why is it good for Reproducibility?
es: ## ¿Qué es BinderHub y porqué es bueno para la reproducibilidad?

source: [BinderHub](https://binderhub.readthedocs.io/en/latest/index.html) is a cloud-based technology that can launch a repository of code (from GitHub, GitLab, and others) in a browser window such that the code can be executed and interacted with.
es: [BinderHub](https://binderhub.readthedocs.io/en/latest/index.html) es una tecnología basada en la nube que permite el lanzamiento de un repositorio de código (desde GitHub, GitLab, entre otros) en una ventana del navegador de forma que se pueda ejecutar el código e interactuar con él.

source: A unique URL is generated allowing the interactive code to be easily shared.
es: Se genera una URL única que permite compartir fácilmente el código interactivo.

source: The purpose of these Binder instances is to promote reproducibility in research projects by encouraging researchers to document their software dependencies and produce fun, interactive environments!
es: El objetivo de las instancias de Binder es promover la reproducibilidad en los proyectos de investigación animando a los investigadores a documentar sus dependencias de software y a producir entornos divertidos e interactivos.

source: Binder, as a user interface, is useful for reproducibility because the code needs to be version controlled and the computational environment needs to be documented in order to benefit from the functionality of Binder.
es: Binder, como interfaz de usuario, es útil para la reproducibilidad porque el código necesita ser controlado por versiones y el entorno computacional necesita ser documentado para poder beneficiarse de la funcionalidad de Binder.

source: Each change to the code repository also forces a new build of the Binder instance.
es: Cada cambio en el repositorio de código también fuerza una nueva construcción de la instancia de Binder.

source: This acts as a proxy for continuous integration of the computational environment as the Binder instance will break if the configuration file is not updated.
es: Esto actúa como un proxy para la integración continua del entorno computacional, ya que la instancia de Binder se romperá si el archivo de configuración no se actualiza.

source: Learn more about Continuous Integration in [this chapter](/continuous_integration/continuous_integration).
es: Aprenda más sobre la integración continua en [este capítulo](/continuous_integration/continuous_integration).

source: ## How does a BinderHub work?
es: ## ¿Cómo funciona un BinderHub?

source: BinderHub relies on different tools and resources in order to create and launch the Binder instances.
es: BinderHub se apoya en diferentes herramientas y recursos para crear y lanzar las instancias de Binder.

source: For more information, see this [high-level explanation of the BinderHub architecture](https://binderhub.readthedocs.io/en/latest/overview.html).
es: Para más información, consulte esta [explicación de alto nivel de la arquitectura de BinderHub](https://binderhub.readthedocs.io/en/latest/overview.html).

source: | A representation of the BinderHub architecture. This image was created by [Scriberia](http://www.scriberia.co.uk/) for The Turing Way community and is used under a CC-BY licence. |
es: | Una representación de la arquitectura de BinderHub. Esta imagen fue creada por [Scriberia](http://www.scriberia.co.uk/) para la comunidad The Turing Way y es usada bajo una licencia CC-BY. |

source: ### Compute Resources
es: ### Recursos computacionales

source: BinderHub is cloud-neutral which means it can be deployed on any cloud platform.
es: BinderHub es neutral de la nube, lo que significa que puede desplegarse en cualquier plataforma de nube.

source: Therefore, the minimum requirement is a subscription to a cloud platform of your choosing.
es: Por lo tanto, el requisito mínimo es una suscripción a una plataforma en la nube de tu elección.

source: In fact, BinderHub is not dependent on cloud-hosting at all and can be deployed onto an on-premise computing system.
es: De hecho, BinderHub no depende en absoluto del alojamiento en la nube y puede desplegarse en un sistema informático local.

source: [Kubernetes](https://kubernetes.io/) is a system for automating deployment, scaling (making more or fewer copies), and management of containers across a compute cluster (it doesn't have to be cloud-based).
es: [Kubernetes](https://kubernetes.io/) es un sistema para automatizar el “deployment” (despliegue), el escalado (hacer más o menos copias) y la gestión de contenedores en un clúster computacional (no tiene por qué estar basado en la nube).

source: BinderHub uses Kubernetes to manage the resources requested by the users of the Binder service, and to support the tools that build the environments.
es: BinderHub utiliza Kubernetes para gestionar los recursos solicitados por los usuarios del servicio Binder, y para dar soporte a las herramientas que construyen los entornos.

source: [Helm](https://helm.sh/) is a package manager for Kubernetes.
es: [Helm](https://helm.sh/) es un gestor de paquetes para Kubernetes.

source: Packages come in the form of *Charts* which are a set of instructions to deploy, upgrade and manage applications running on a Kubernetes cluster.
es: Los paquetes vienen en forma de *Charts* que son un conjunto de instrucciones para desplegar, actualizar y gestionar las aplicaciones que se ejecutan en un clúster Kubernetes.

source: They can make installing and managing Kubernetes applications much easier and specific Charts for projects can be published online.
es: Pueden hacer que la instalación y la gestión de las aplicaciones Kubernetes sea mucho más fácil y Charts específicos de los proyectos pueden ser publicados.

source: For example, the Helm Chart for BinderHub is available [here](https://jupyterhub.github.io/helm-chart/#development-releases-binderhub).
es: Por ejemplo, un Helm Chart para BinderHub está disponible [aquí](https://jupyterhub.github.io/helm-chart/#development-releases-binderhub).

source: [JupyterHub](https://jupyter.org/hub) is a multi-user server for Jupyter Notebooks and containers alike.
es: [JupyterHub](https://jupyter.org/hub) es un servidor multiusuario para Jupyter Notebooks y contenedores.

source: In the context of Binder, the JupyterHub's main role is to connect the user's browser to the BinderHub instance running on the Kubernetes cluster.
es: En el contexto de Binder, la función principal de JupyterHub es conectar el navegador del usuario con la instancia de BinderHub que se ejecuta en el clúster de Kubernetes.

source: However, the JupyterHub can be further customised to provide greater control over the operation of the BinderHub.
es: Sin embargo, el JupyterHub puede personalizarse aún más para proporcionar un mayor control sobre el funcionamiento del BinderHub.

source: [repo2docker](https://repo2docker.readthedocs.io/en/latest/?badge=latest) is a tool that automatically builds a Docker image from a code repository given a configuration file.
es: [repo2docker](https://repo2docker.readthedocs.io/en/latest/?badge=latest) es una herramienta que construye de forma automática una imagen Docker a partir de un repositorio de código de acuerdo a un archivo de configuración.

source: This Docker image will contain all of the code, data and resources that are listed in the repository.
es: Esta imagen Docker contendrá todo el código, los datos y los recursos que estan listados en el repositorio.

source: All the software required to run the code will also be preinstalled from the configuration file.
es: Todo el software necesario para ejecutar el código también estará preinstalado desde el archivo de configuración.

source: BinderHub can be thought of as thin layer that sits on top of repo2docker and JupyterHub, orchestrating their interactions and resolving URLs.
es: BinderHub puede considerarse como una fina capa que se asienta sobre repo2docker y JupyterHub, orquestando sus interacciones y resolviendo las URL.

source: ### What happens when a Binder link is clicked?
es: ### ¿Qué sucede cuando se hace clic en un enlace de Binder?

source: 1. The link to the repository is resolved by BinderHub.
es: 1. El enlace al repositorio está resuelto por BinderHub.

source: 2. BinderHub searches for a Docker image relating to the provided reference (for example, git commit hash, branch or tag).
es: 2. BinderHub busca una imagen Docker relacionada con la referencia proporcionada (por ejemplo, el hash del commit de git, la rama o la etiqueta).

source: 3. **If a Docker image is not found**, BinderHub requests resources from the Kubernetes cluster to run repo2docker to do the following:
es: 3. **Si no se encuentra una imagen Docker**, BinderHub solicita recursos del clúster Kubernetes para ejecutar repo2docker para hacer lo siguiente:

source: - Fetch the repository,
es: - Recoger el repositorio,

source: - Build a Docker image containing the software requested in the configuration file,
es: - Construir una imagen Docker que contenga el software solicitado en el archivo de configuración,

source: - Push that image to the Docker registry.
es: - Empujar esa imagen al registro de Docker.

source: 4. BinderHub sends the Docker image to JupyterHub.
es: 4. BinderHub envía la imagen Docker a JupyterHub.

source: 5. JupyterHub requests resources from the Kubernetes cluster to serve the Docker image.
es: 5. JupyterHub solicita recursos del clúster Kubernetes para servir la imagen Docker.

source: 6. JupyterHub connects the user's browser to the running Docker environment.
es: 6. JupyterHub conecta el navegador del usuario con el entorno Docker en ejecución.

source: 7. JupyterHub monitors the container for activity and destroys it after a period of inactivity.
es: 7. JupyterHub controla la actividad del contenedor y lo destruye después de un período de inactividad.

source: ## Why would you build your own BinderHub?
es: ## ¿Por qué construir tu propio BinderHub?

source: [mybinder.org](https://mybinder.org/) is the free, public BinderHub that hosts almost 100k Binder launches per week.
es: [mybinder.org](https://mybinder.org/) es un BinderHub público y gratuito que alberga casi 100.000 lanzamientos de Binder a la semana.

source: Why might you want to build your own?
es: ¿Por qué querrías construir el tuyo?

source: Binder is an open source project maintained by volunteers and as such they ask that users stay within certain computational limitations in order to keep running costs as low as possible whilst still providing a usable service.
es: Binder es un proyecto de código abierto mantenido por voluntarios y, como tal, piden a los usuarios que se mantengan dentro de ciertas limitaciones computacionales con el fin de mantener los costes de funcionamiento lo más bajos posible sin dejar de ofrecer un servicio utilizable.

source: By hosting your own BinderHub, you can offer your users much more flexible and tailored resources.
es: Al alojar su propio BinderHub, puede ofrecer a sus usuarios recursos mucho más flexibles y personalizados.

source: These customisations could include:
es: Estas personalizaciones podrían incluir:

source: - authentication,
es: - la autentificación,

source: - greater computational resources per user,
es: - mayores recursos computacionales por usuario,

source: - bespoke library stacks and packages,
es: - conjuntos y paquetes de la biblioteca a la medida,

source: - allowing access to private repos,
es: - permitiendo el acceso a los repositorios privados,

source: - persistent storage for users,
es: - almacenamiento persistente para los usuarios,

source: - restrict sharing within a certain institution or team.
es: - restringir el intercambio dentro de una determinada institución o equipo.

source: ### Issues you may face when deploying a BinderHub
es: ### Problemas que puede encontrar al implementar un BinderHub

source: BinderHubs are becoming increasingly popular amongst universities and research institutes.
es: Los BinderHubs son cada vez más populares entre las universidades e institutos de investigación.

source: This is because they can facilitate multiple instances of the same set of notebooks for use in a tutorial or workshop setting.
es: Esto se debe a su capacidad de facilitar múltiples instancias del mismo conjunto de cuadernos para su uso en un entorno de tutoría o taller.

source: If you are deploying a cloud-hosted BinderHub on behalf of your organisation, you may need specific permissions on your organisation's cloud platform subscription.
es: Si estás desplegando un BinderHub alojado en la nube en nombre de tu organización, es posible que necesites permisos específicos en la suscripción a la plataforma en la nube de tu organización.

source: Which permissions you require will vary based on the cloud platform you have access to and your IT Services policies.
es: Los permisos que necesite variarán en función de la plataforma en la nube a la que tengas acceso y de sus políticas de servicios de informática.

source: At minimum, you'll need to be able to assign [Role Based Access Control (RBAC)](https://docs.microsoft.com/en-us/azure/role-based-access-control/overview) to your resources so they can act autonomously in order to manage user traffic.
es: Como mínimo, necesitará poder asignar [Role Based Access Control (RBAC)](https://docs.microsoft.com/en-us/azure/role-based-access-control/overview) a tus recursos para que puedan actuar de forma autónoma para gestionar el tráfico de usuarios.

source: ## Further reading
es: ## Lecturas complementarias

source: - [Binder documentation](https://mybinder.readthedocs.io/en/latest/)
es: - [Documentación de Binder](https://mybinder.readthedocs.io/en/latest/)

source: - [BinderHub documentation](https://binderhub.readthedocs.io/en/latest/index.html)
es: - [Documentación de Binder](https://binderhub.readthedocs.io/en/latest/index.html)

source: - [Zero-to-JupyterHub with Kubernetes documentation](https://zero-to-jupyterhub.readthedocs.io/en/latest/index.html)
es: - [Documentación iniciando de cero a JupyterHub con Kubernetes](https://zero-to-jupyterhub.readthedocs.io/en/latest/index.html)

source: - [JupyterHub documentation](https://jupyterhub.readthedocs.io/en/stable/)
es: - [Documentación de JupyterHub](https://jupyterhub.readthedocs.io/en/stable/)

source: - [_The Turing Way_ Build a BinderHub Workshop](http://bit.ly/zero-to-binderhub-workshop)
es: - [Una guía _The Turing Way_ para construir un BinderHub](http://bit.ly/zero-to-binderhub-workshop)

source: ## Definitions/glossary
es: ## Definiciones/glosario

source: | Docker image | A machine-readable set of instructions to create a specified computational environment.|
es: | Una imagen Docker | Un conjunto de instrucciones legibles por la máquina para crear un entorno computacional específico.|

source: | Docker container | An active computational environment executed from a Docker image. |
es: | Contenedor Docker | Un entorno computacional activo ejecutado desde una imagen Docker. |

source: | Docker registry | A storage and distribution system for named Docker images. The registry allows Docker users to pull images locally, as well as push new images to the registry (given adequate access permissions when applicable). Such systems are often hosted in the cloud for ease of access. |
es: | Un registro Docker | Un sistema de almacenamiento y distribución de imágenes Docker. El registro permite a los usuarios de Docker extraer imágenes localmente, así como introducir nuevas imágenes en el registro (con los permisos de acceso adecuados, si es el caso). Estos sistemas suelen estar alojados en la nube para facilitar el acceso. |

source: | BinderHub | Technology for hosting reproducible computational environments. |
es: | BinderHub | Tecnología para alojar entornos computacionales reproducibles. |

source: | Binder | The user-facing service of a BinderHub. |
es: | Binder | El servicio de acceso al usuario de un BinderHub. |

source: | Kubernetes | Autonomous computational cluster manager. |
es: | Kubernetes | Gestor de clústeres computacionales autónomos. |

source: | Helm | A package manager for Kubernetes applications. |
es: | Helm | Paquete gestor para aplicaciones Kubernetes. |

source: | JupyterHub | A multi-user server for Jupyter Notebook instances. |
es: | JupyterHub | Un servidor multiusuario para instancias de Jupyter Notebook. |

source: | repo2docker | A tool to build Docker images from code repositories. |
es: | repo2docker | Herramienta para construir imágenes Docker a partir de repositorios de código. |

source: ## Bibliography
es: ## Bibliografía

source: - **Kubernetes documentation**: [https://kubernetes.io/](https://kubernetes.io/)
es: - **Documentación de Kubernetes**: [https://kubernetes.io/](https://kubernetes.io/)

source: - **Helm documentation**: [https://helm.sh/](https://helm.sh/)
es: - **Documentación de Helm**: [https://helm.sh/](https://helm.sh/)

source: - **Microsoft Azure documentation on Role Based Access Control**: [https://docs.microsoft.com/en-us/azure/role-based-access-control/overview](https://docs.microsoft.com/en-us/azure/role-based-access-control/overview)
es: - **Documentación de Microsoft Azure sobre el control de acceso basado en roles**: [https://docs.microsoft.com/en-us/azure/role-based-access-control/overview](https://docs.microsoft.com/en-us/azure/role-based-access-control/overview)
