Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/Ethical_Decisions.*.po
Languages: es

source: # Research Planning for Preclinical Scientists
es: # Planificación de la investigación para científicos preclínicos

source: ## Prerequisites / recommended skill level
es: ## Pre-requisitos / nivel de conocimiento recomendado

source: For preclinical scientists – no previous knowledge needed
es: Para científicos preclínicos - no se necesitan conocimientos previos

source: ## Summary
es: ## Resumen

source: Society continually debate the use of animals in scientific research.
es: La sociedad continuamente cuestiona el uso de animales en la investigación científica.

source: The fundamental questions are whether experiments using animals are morally justifiable and whether the potential benefits outweigh the suffering of those animals?
es: Las preguntas fundamentales son si los experimentos con animales son moralmente justificables y si los posibles beneficios superan el sufrimiento de esos animales.

source: These questions have been coupled with increasing concern about the poor reproducibility of findings from animal research, due to the impact this has on translation, scientific progress and the use of resources.
es: Estas preguntas se han ligado a una preocupación creciente por la escasa reproducibilidad de los resultados de la investigación con animales, debido al impacto que esto conlleva en el progreso científico y el uso de recursos.

source: A question that is not often addressed is how those justified experiments are designed, conducted and analysed.
es: Una cuestión que no suele abordarse es cómo se diseñan, cómo se llevan a cabo y cómo se analizan aquellos experimentos debidamente justificados.

source: Flawed experimental design, inappropriate statistical analysis and inadequate reporting have been flagged as areas for major concern (Kilkenny et al., 2009 (https://doi.org/10.1371/journal.pone.0007824), Begley et al., 2015 (https://doi.org/10.1161/CIRCRESAHA.114.303819)).
es: El diseño experimental defectuoso, el análisis estadístico inapropiado y los informes inadecuados se han identifcado como las áreas de mayor preocupación (Kilkenny et al., 2009 (https://doi.org/10.1371/journal.pone.0007824), Begley et al., 2015 ( https://doi.org/10.1161/CIRCRESAHA.114.303819)).

source: It is morally incumbent upon us to ensure that animal experiments are appropriately designed, conducted and analysed otherwise the results are at risk of being unreliable.
es: Nos incumbe moralmente asegurarnos de que los experimentos con animales se diseñen, se realicen y se analicen de manera adecuada; de lo contrario, los resultados corren el riesgo de no ser fiables.

source: If the results are unreliable then the animals used have in effect have been wasted (Ioannidis et al., 2014 (https://doi.org/10.1016/S0140-6736(13)62227-8), de Vries et al., 2014 (https://doi.org/10.1093/ilar/ilu043)).
es: Si los resultados no son fiables, entonces los animales utilizados se han utilizado inutilmente (Ioannidis et al., 2014 (https://doi.org/10.1016/S0140-6736(13)62227-8), de Vries et al., 2014 (https://doi.org/10.1093/ilar/ilu043)).

source: ## How this will help you/ why this is useful
es: ## Cómo te ayudará esto/ por qué esto es útil

source: Many preclinical researchers do not think of themselves as data scientists.
es: Muchos investigadores preclínicos no se consideran científicos de datos.

source: This may be primarily because they work with small datasets.
es: Esto puede deberse principalmente a que trabajan con conjuntos de datos pequeños.

source: However, there are many common open research themes and this chapter aims to assist preclinical scientists in understanding the why, where, when, and how they can employ open research initiatives, some designed specifically for the use by preclinical scientists.
es: Sin embargo, hay muchos temas de investigación abierta comunes y este capítulo tiene como objetivo ayudar a los científicos preclínicos a comprender por qué, dónde, cuándo y cómo pueden utilizar estas iniciativas de investigación abierta, algunas de las cuales están diseñadas específicamente para científicos preclínicos.

source: > The above sentance may not fit with the structure of the book or flow within these chapters - Nadia
es: > La frase anterior puede no encajar con la estructura del libro o el flujo dentro de estos capítulos - Nadia

source: ## The Experimental Design Assistant
es: ## Asistente para el diseño experimental

source: The National Centre for the Replacement, Refinement and Reduction of Animals in Research (NC3Rs) have a freely accessible web-based tool – The Experimental Design Assistant (EDA; https://eda.nc3rs.org.uk) which aims to help researchers improve the design, conduct, analysis and reporting of animal experiments.
es: El Centro Nacional para la Sustitución, el Perfeccionamiento y la Reducción de los Animales en la Investigación (NC3Rs, por sus siglas en inglés) dispone de una herramienta web de libre acceso: el Asistente de Diseño Experimental (EDA por sus siglas en inglés; https://eda.nc3rs.org.uk), cuyo objetivo es ayudar a quienes investigan a mejorar el diseño, la realización, el análisis y la presentación de informes de los experimentos con animales.

source: Designing experiments with the EDA encourages researchers to consider the sources of bias at the design stages of the experiment before the data are collected, ensuring a rigorous design that is more likely to yield robust findings that can be reproduced.
es: El diseño de experimentos con el EDA anima a quienes investigan a tener en cuenta las fuentes de sesgo en las fases de diseño del experimento antes de recoger los datos, lo que garantiza un diseño riguroso que tiene más probabilidades de producir resultados sólidos que puedan reproducirse.

source: The tool ensures that you have a transparent, clear protocol and plan for statistical analysis which can be scrutinised before collecting data.
es: La herramienta garantiza un protocolo transparente y claro, y un plan para el análisis estadístico que puede ser examinado antes de recopilar los datos.

source: **Features of the EDA:**
es: **Características del EDA:**

source: * A computer-aided design tool to develop a diagram representing the experimental plan
es: * Una herramienta de diseño asistido por ordenador para elaborar un diagrama que represente el plan experimental

source: * feedback from an expert system on the experimental plan
es: * feedback de un sistema experto sobre el plan experimental

source: * analysis suggestion
es: * sugerencia de análisis

source: * sample size calculation (power analysis)
es: * cálculo del tamaño de la muestra (análisis de potencia o *power analysis*)

source: * randomisation sequence generation
es: * generación de secuencias aleatorias

source: * support for allocation concealment and blinding
es: * apoyo para estudios ciegos y ocultamiento de la asignación

source: * web-based resources to improve knowledge of experimental design and analysis
es: * recursos en la web para mejorar el conocimiento sobre diseño y el análisis experimental

source: ## Checklist
es: ## Lista de verificación

source: > this can be done at the end or maybe as a separate checklist exercise, but please do note things down here as you go
es: Comprenda su software y para qué se utiliza. Saber esto te ayuda a decidir qué conceptos de sostenibilidad son apropiados para tus necesidades. Hay muchas herramientas y ecosistemas que se utilizan habitualmente para ayudarte a practicar estos conceptos: github, Docker y muchos más. Sigue leyendo para conocer estos conceptos y herramientas...

source: ## What to learn next
es: ## ¿Qué aprender a continuación?

source: > recommended next chapters that are a good next step up
es: > capítulos recomendados que son un buen siguiente paso

source: ## Further reading
es: ## Lecturas complementarias

source: > top 3/5 resources to read on this topic (if they weren't licensed so we could include them above already) at the top, maybe in their own box/in bold.
es: > los 3/5 mejores recursos para leer sobre este tema (si no tuvieran licencia para poder incluirlos ya arriba) en la parte superior, quizás en su propio recuadro/en negrita.

source: > less relevant/favourite resources in case someone wants to dig into this in detail
es: > recursos menos relevantes/favoritos en caso de que alguien quiera profundizar en esto

source: ## Definitions/glossary
es: ## Definiciones/glosario

source: > Link to the glossary here or copy in key concepts/definitions that readers should be aware of to get the most out of this chapter
es: > Enlaza aquí con el glosario o copia los conceptos/definiciones clave que los lectores deben conocer para sacar el máximo provecho de este capítulo

source: ## Bibliography
es: ## Bibliografía

source: > Credit/urls for any materials that form part of the chapter's text.
es: > Créditos/urls para cualquier material que forme parte del texto del capítulo.
