Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/open_research.*.po
Languages: es

source: Much like open source licences, there are also emerging standards for codes of conduct, so you don't have to write your own. The [Contributor Covenant](https://contributor-covenant.org/) is a drop-in code of conduct that is used by [over 40,000 open source projects](https://www.contributor-covenant.org/adopters). No matter which text you use, you should be prepared to enforce your code of conduct when necessary.
es: Al igual que las licencias de código abierto, también hay estándares emergentes para códigos de conducta, por lo que no tienes que escribir los tuyos propios. El [pacto de colaboración](https://contributor-covenant.org/) es un código de conducta directo que utilizan [más de 40.000 proyectos de código abierto](https://www.contributor-covenant.org/adopters). Independientemente del texto que utilices, debes de estar en disposición para hacer cumplir tu código de conducta cuando sea necesario.

source: Keep the file in your project's root directory so it's easy to find, and link to it from your readme.
es: Mantén el archivo en el directorio raíz de tu proyecto para que sea fácil de encontrar y vincularlo desde tu archivo README.

source: ### How to contribute to other's open source software projects
es: ### Cómo contribuir a otros proyectos de software de código abierto

source: #### Anatomy of an open source software project
es: #### Anatomía de un proyecto de software de código abierto

source: Every open source community is different. That said, many open source software projects follow a similar organizational structure. Understanding the different community roles and overall process will help you get quickly oriented to any new project.
es: Cada comunidad de código abierto es diferente. Dicho esto, muchos proyectos de software de código abierto siguen una estructura organizativa similar. Comprender los diferentes roles de la comunidad y el proceso general te ayudará a orientarte rápidamente en cualquier proyecto nuevo.

source: A typical open source software project has the following types of people:
es: Un proyecto de software de código abierto típico tiene los siguientes roles:

source: - Author: The person/s or organization that created the project
es: - Autoría: la persona u organización que creó el proyecto.

source: - Owner: The person/s who has administrative ownership over the organization or repository (not always the same as the original author)
es: - Propiedad: la persona que tiene la propiedad administrativa sobre la organización o el repositorio (no siempre es el mismo que la persona autora original)

source: - Maintainers: Contributors who are responsible for driving the vision and managing the organizational aspects of the project. They may also be authors and/or owners of the project.
es: - Mantenimiento: personas colaboradoras que son responsables de impulsar la visión y gestionar los aspectos organizativos del proyecto. También pueden ser parte de la autoría y/o ser propietarios del proyecto.

source: - Contributors: Everyone who has contributed something back to the project.
es: - Colaboración: todas las personas que han contribuido con algo al proyecto.

source: - Community members: People who use the project. They might be active in conversations or express their opinion on the project's direction.
es: - Comunidad: personas que utilizan el proyecto. Pueden participar activamente en conversaciones o expresar su opinión sobre la dirección del proyecto.

source: Bigger projects may also have subcommittees or working groups focused on different tasks, such as tooling, triage, community moderation, and event organizing. Look on a project’s website for a “team” page, or in the repository for governance documentation, to find this information.
es: Los proyectos más grandes también pueden tener subcomités o grupos de trabajo enfocados en diferentes tareas, como herramientas, triaje, moderación comunitaria y organización de eventos. Busca en el sitio web de un proyecto una página de "equipo", o en el repositorio de documentación de gobierno, para encontrar esta información.

source: A great many open source projects are hosted on GitHub (see the chapter on version control for more detail), which has facilities such as:
es: Una gran cantidad de proyectos de código abierto están alojados en GitHub (consulta el capítulo sobre control de versiones para obtener más detalles), que tiene funcionalidades como:

source: - Issue tracker: Where people discuss issues related to the project.
es: - Seguimiento de problemas: donde las personas debaten temas relacionados con el proyecto.

source: - Pull requests: Where people discuss and review changes that are in progress.
es: - Solicitudes de extracción: donde las personas debaten y revisan los cambios que están en progreso.

source: - Discussion forums or mailing lists: Some projects may use these channels for conversational topics (for example, "How do I..." or "What do you think about..." instead of bug reports or feature requests). Others use the issue tracker for all conversations.
es: - Foros de discusión o listas de correo: algunos proyectos pueden usar estos canales para temas de conversación (por ejemplo, "¿Cómo ...?" O "¿Qué piensas sobre ...?" en lugar de informes de errores o solicitudes de funciones). Otros usan el rastreador de problemas para todas las conversaciones.

source: - Synchronous chat channel: Some projects use chat channels (such as Slack or IRC) for casual conversation, collaboration, and quick exchanges.
es: - Canal de chat sincronizado: algunos proyectos utilizan canales de chat (como Slack o IRC) para conversaciones informales, colaboración e intercambios rápidos.

source: #### Contribute your changes
es: #### Contribuye con tus cambios

source: Say you have added a feature or fixed a bug and want to contribute this work to the main project.
es: Supongamos que has agregado una función o solucionado un error y deseas contribuir con este trabajo al proyecto principal.

source: 1. Read the documentation: The main project may have contributing guidelines or information in a readme instructing prospective contributors on how to supply their changes.
es: 1. Lee la documentación: el proyecto principal puede tener pautas de contribución o información en un archivo README que instruya a las posibles personas contribuyentes sobre cómo proporcionar sus cambios.

source: 2. Make sure your conventions match those of the main project, both in style and structure: For example if all the variables in a project are named in some particular way yours should be too!
es: 2. Asegúrate de que tus convenciones coincidan con las del proyecto principal, tanto en estilo como en estructura: por ejemplo, si todas las variables de un proyecto se nombran de alguna manera en particular, las tuyas también deberían hacerlo.

source: Consistent conventions make it much easier for someone who has not seen your piece of the project before to understand it rather than having to figure out your particular set of conventions *and* what the code is doing. The project's conventions may be outlined in its documentation, or may just be evident from inspection of the code itself.
es: Las convenciones consistentes hacen que sea mucho más fácil para alguien que no ha visto tu parte del proyecto antes, entenderlo en lugar de tener que averiguar su conjunto particular de convenciones *y* lo que está haciendo el código. Las convenciones del proyecto pueden estar descritas en su documentación, o pueden ser evidentes a partir de la inspección del código mismo.

source: 3. Break your changes up into manageable, well-defined chunks: For example, if you have added two separate features don't submit them together. Keeping things "clean" in this way makes your work simpler to understand and review.
es: 3. Divide tus cambios en partes manejables y bien definidas: por ejemplo, si agregaste dos funciones separadas, no las envíes juntas. Mantener las cosas "limpias" de esta manera hace que tu trabajo sea más fácil de entender y revisar.

source: 4. Test your changes: If the project comes with tests run them, and make sure you're testing against an up to date version of the project as it may have evolved considerably over time. Write specific tests for your changes and submit those too.
es: 4. Prueba tus cambios: si el proyecto viene con tests, ejecútalos y asegúrate de que los estás probando con una versión actualizada del proyecto, ya que puede haber evolucionado considerablemente con el tiempo. Escribe tests específicos para tus cambios y envíalos también.

source: 5. Do not just submit code, update relevant documentation too: If your changes are incorporated it will have to be updated, if you don not do it someone else will have to.
es: 5. No envíes sólo el código, actualiza también la documentación relevante: si tus cambios están incorporados, tendrá que actualizarse, si no lo haces, otra persona tendrá que hacerlo.

source: 6. Ask questions: If there are things you are unsure about there's no harm in asking. Many larger projects have dedicated forums or other venues for questions and discussion.
es: 6. Haz preguntas: si hay cosas de las que dudas, no está de más preguntar. Muchos proyectos grandes tienen foros específicos u otros lugares para preguntas y discusiones.

source: 7. Be clear: When you submit your changes clearly describe the changes you have made, why you have made them, and how they have been implemented. This makes it as easier for someone looking at your work and deciding whether to incorporate it into the main project to do so. In the likely case the main project is hosted on GitHub you should put this in the pull request (see the version control chapter for more details).
es: 7. Promueve la claridad: cuando envíes tus cambios describe claramente los cambios que has realizado, por qué los has hecho y cómo se han implementado. Esto hace que sea más fácil para alguien que mire tu trabajo y decida si lo incorpora al proyecto principal para hacerlo. En el caso probable de que el proyecto principal esté alojado en GitHub, debes poner esto en la solicitud de extracción (consulta el capítulo de control de versiones para obtener más detalles).

source: #### Looking for projects to contribute to and how to contribute to them
es: #### Buscando proyectos a los que contribuir y cómo contribuir a ellos

source: You do not need to overthink what exactly your first contribution will be, or how it will look.
es: No es necesario que pienses demasiado en cuál será exactamente tu primera contribución o cómo se verá.

source: Instead, start by thinking about the projects you already use, or want to use.
es: En su lugar, comienza por pensar en los proyectos que ya usas o deseas usar.

source: The projects you will actively contribute to are the ones you find yourself coming back to.
es: Los proyectos a los que contribuirás activamente son aquellos a los que volverás.

source: Within those projects, whenever you catch yourself thinking that something could be better or different, act on your instinct. You might scan a readme and find a broken link or a typo.
es: Dentro de esos proyectos, siempre que te encuentres pensando que algo podría ser mejor o diferente, actúa según tu instinto. Puedes echar un vistazo a un archivo README y encontrar un enlace roto o un error tipográfico.

source: Or you are a new user and you noticed something is broken, or an issue that you think should really be in the documentation.
es: O usas el proyecto por primera vez y notaste que algo no funciona, o un problema que crees que debería estar en la documentación.

source: Instead of ignoring it and moving on, or asking someone else to fix it, see whether you can help out by pitching in. That is what open source is all about!
es: En lugar de ignorarlo y seguir adelante, o pedirle a otra persona que lo arregle, mira si puedes ayudar con esto. ¡De eso se trata el código abierto!

source: You can also use one of the following resources to help you discover and contribute to new projects:
es: También puedes utilizar uno de los siguientes recursos como ayuda para descubrir nuevos proyectos y contribuir a ellos:

source: If you are not sure how to start here is a few other ways you can go about it such as finding an open issue to tackle or asking if you can help write a new feature.
es: Si no estás seguro de cómo comenzar, aquí hay otras formas en que puedes hacerlo, como encontrar un problema abierto para abordar o preguntar si puedes ayudar a escribir una nueva funcionalidad.

source: A common misconception about contributing to open source is that you need to contribute code. In fact, it is often the other parts of a project that are most neglected or overlooked. You will do the project a huge favour by offering to pitch in with these types of contributions! You could:
es: Un error común sobre la contribución al código abierto es que es necesario contribuir con código. De hecho, a menudo son las otras partes de un proyecto las que más se descuidan o pasan por alto. ¡Le harás un gran favor al proyecto si te ofreces a colaborar con este tipo de contribuciones! Tú podrías:

source: - Review code on other people's submissions.
es: - Revisar el código de los envíos de otras personas.

source: - Write and improve the project's documentation.
es: - Redactar y mejorar la documentación del proyecto.

source: - Curate a folder of examples showing how the project is used.
es: - Crear una carpeta de ejemplos que muestre cómo se usa el proyecto.

source: - Answer questions about the project on, for example, Stack Overflow,
es: - Responder preguntas sobre el proyecto en, por ejemplo, Stack Overflow.

source: - Keep things organized, for example, on GitHub by:
es: - Mantener las cosas organizadas, por ejemplo, en GitHub mediante:

source: - Linking to duplicate issues.
es: - Vinculación a "issues" (problemas) duplicados.

source: - Suggesting new issue labels.
es: - Sugerir nuevas etiquetas de issues.

source: - Going through open issues and suggesting closing old ones.
es: - Repasando issues abiertos y sugiriendo cerrar los antiguos.

source: - Ask clarifying questions on recently opened issues to move the discussion forward.
es: - Hacer preguntas aclaratorias sobre issues abiertos recientemente para hacer avanzar la discusión.

source: ### Closed software
es: ### Software cerrado

source: What if you are working with people that do not use the open source model for their software?
es: ¿Qué sucede si trabajas con personas que no utilizan el modelo de código abierto para su software?

source: This may initially seem an affront to all the principles discussed so far, but there are usually very good reasons for why things are the way they are (for example legal, commercial, or security).
es: Esto puede parecer inicialmente una afrenta a todos los principios discutidos hasta ahora, pero generalmente hay muy buenas razones por las que las cosas son como son (por ejemplo, razones legales, comerciales o de seguridad).

source: Often, it will still be possible to use and contribute but the details of how might be different.
es: A menudo, aún será posible utilizar dicho software y contribuir, pero los detalles de cómo hacerlo pueden ser diferentes.

source: The kinds of practices used in 'closed' software are generally the same and the concepts and tools you can learn about in the Turing Way still apply.
es: Los tipos de prácticas que se utilizan en el software 'cerrado', también conocido como privativo o propietario, son generalmente los mismos y los conceptos y herramientas que puedes aprender en el Turing Way todavía se aplican y son útiles.

source: Sometimes, however, there might not be good reasons for the closed source approach.
es: A veces, sin embargo, puede que no haya buenas razones para usar un enfoque de código cerrado.

source: Different areas of research have different cultures which run against the grain of open principles and feel very frustrating.
es: Diferentes áreas de investigación tienen diferentes culturas que van en contra de los principios de apertura y pueden ser muy frustrantes.

source: Tackling this barrier can be very tricky as cultures can take years or decades to change.
es: Penetrar esta barrera puede ser muy complicado, ya que las culturas pueden tardar años o décadas en cambiar.

source: Working with closed software can offer both opportunities and threats to your research.
es: Trabajar con software cerrado puede ofrecer tanto oportunidades como amenazas para tu investigación.

source: In all cases, understanding and respecting other's perspectives offers the greatest chances of success.
es: En todos los casos, comprender y respetar las perspectivas de los demás ofrece las mayores posibilidades de éxito.

source: ## Open hardware
es: ## Hardware abierto

source: "Open hardware", or "open source hardware", refers to the design specifications of a physical object that are licenced in such a way that said object can be studied, modified, created, and distributed by anyone.
es: "Hardware abierto", o "hardware de código abierto", se refiere a las especificaciones de diseño de un objeto físico que tienen licencia de tal manera que dicho objeto puede ser estudiado, modificado, creado y distribuido por cualquier persona.

source: Like open source software, the "source code" for open hardware - schematics, blueprints, logic designs, Computer Aided Design (CAD) drawings or files, and the like, is available for modification or enhancement by anyone.
es: Al igual que el software de código abierto, el "código fuente" para hardware abierto - esquemas, planos, diseños lógicos, dibujos o archivos de diseño asistido por computadora (CAD), y similares - está disponible para que cualquiera lo modifique o mejore.

source: Users with access to the tools that can read and manipulate these source files can update and improve the physical device and the code that underlies it, and, if they wish, proceed to share such modifications.
es: Las personas con acceso a las herramientas que pueden leer y manipular estos archivos fuente pueden actualizar y mejorar el dispositivo físico y el código subyacente y, si lo desean, proceder a compartir dichas modificaciones.

source: Open hardware's source code should be readily accessible, and its components are preferably easy for anyone to obtain.
es: El código fuente del hardware abierto debe ser de fácil acceso y sus componentes son preferiblemente fáciles de obtener para cualquiera.

source: Essentially, open hardware eliminates common roadblocks to the design and manufacture of physical goods; it provides as many people as possible the ability to construct, remix, and share their knowledge of hardware design and function.
es: Esencialmente, el hardware abierto elimina los obstáculos comunes al diseño y fabricación de bienes físicos; proporciona al mayor número posible de personas la capacidad de construir, modificar y compartir sus conocimientos sobre el diseño y la función del hardware.

source: It is worth noting that open hardware does not necessary mean free. Units may still be sold (by the original designer or by others), but users *could* build them from scratch. Whether or not they choose to buy the unit, users can still get a full understanding of how the hardware works from open documentation, designs, and similar.
es: Es importante señalar que el hardware abierto no necesariamente significa gratuito. Las unidades aún pueden venderse (por la persona diseñadora o por otros), pero las personas usuarias *pueden* construirlas desde cero. Ya sea que elijan comprar la unidad o no, las personas usuarias pueden comprender con detalle cómo funciona el hardware a partir de documentación y diseños abiertos, etc.

source: ### Why open hardware?
es: ¿Por qué es importante el hardware abierto?

source: Open hardware allows researchers to understand exactly what their equipment is doing, how it is doing it, and to verify that it is doing it correctly, rather than having to extend a degree of trust.
es: El hardware abierto permite a los investigadores e investigadoras comprender exactamente qué está haciendo el hardware/equipo, cómo lo está haciendo y verificar que lo está haciendo correctamente, en lugar de tener que basarse en relaciones de confianza.

source: Being aware of how the equipment that generates a result works puts researchers on a firmer footing in assessing those results.
es: Ser consciente de cómo funciona el hardware/equipo que genera un resultado le permite a los investigadores e investigadoras evaluar los resultados con un fundamento más sólido.

source: Open hardware also makes research more reproducible as researchers looking to verify results can do the same thing.
es: El hardware abierto también hace que la investigación sea más reproducible, ya que las personas que buscan verificar los resultados pueden hacer usar el mismo hardware abierto.

source: Other benefits of open hardware include protection against lock-in.
es: Otros beneficios del hardware abierto incluyen la protección contra la dependencia de los proveedores.

source: Proprietary software for core infrastructure increases the risk of becoming locked in by the vendor or technology.
es: El software propietario para infraestructura básica aumenta el riesgo de quedar bloqueado por un único proveedor o tipo de tecnología.

source: If this happens, researchers can be at the mercy of vendors' price increases and experience a lack of flexibility they can not easily and readily escape.
es: Si esto sucede, se puede estar a merced de los aumentos de precios de los proveedores y experimentar una falta de flexibilidad de la que no pueden escapar ni fácil ni rápidamente.

source: Further, if researchers want to modify their equipment to better suit their needs it is much easier to do so (and may only be legal) in the case of open source hardware.
es: Además, si se desea modificar el hardware/equipo para adaptarlo mejor a nuestras necesidades, es mucho más fácil hacerlo (y puede que solo sea legal) en el caso del hardware de código abierto.

source: ### Elements of an open source hardware project
es: ### Elementos de un proyecto de hardware abierto

source: Here are some files that you should consider sharing when publishing your open source hardware project.
es: Aquí hay algunos archivos que deberías considerar compartir al publicar tu proyecto de hardware de código abierto.

source: You are not required to post them all, but the more you share the more the community benefits.
es: No es necesario que los compartas todos, pero cuanto más compartas será más beneficioso para la comunidad.

source: There is a lot of crossover here with files to include in open source software projects.
es: Hay un solapamiento importante con archivos a incluir en proyectos de software de código abierto.

source: - Overview / Introduction: Your open source hardware project should include a general description of the hardware's identity and purpose, written as much as possible for a general audience.
es: - Descripción general / Introducción: tu proyecto de hardware de código abierto debería incluir una descripción general de la identidad y la finalidad del hardware, escrita tanto como sea posible para un público general.

source: That is, explain what the project is and what it is for before you get into the technical details.
es: Es decir, explica qué es el proyecto y cuáles son sus objetivos antes de entrar en los detalles técnicos.

source: A good photo or rendering can help a lot here.
es: Una buena foto o representación gráfica puede ser de mucha utilidad.
