Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/open_research.*.po
Languages: es

source: This version is the final text once the peer review process has ended but it has not the final layout of the publication.
es: Esta versión es el texto final una vez finalizado el proceso de revisión por pares, pero no tiene el diseño final de la publicación.

source: Finally some journals do allow researchers to deposit the final published version, also known as the version of record.
es: Finalmente, algunas revistas científicas permiten a los investigadores e investigadoras depositar la versión final publicada, también conocida como versión de registro.

source: In relation to the moment to make the paper publicly available, many journals establish a period of time from its original publication - the embargo period, which can range from zero to 60 months - when making the paper publicly available is not permitted.
es: En relación al momento de hace el artículo público, muchas revistas establecen un período de tiempo desde su publicación original - el período de embargo, que puede oscilar entre cero y 60 meses - en el que no se permite la puesta a disposición del público.

source: Some journals include or exclude embargoes depending on the versions.
es: Algunas revistas incluyen o excluyen embargos según las versiones.

source: For instance the accepted version could be made publicly available after publication but the published version must wait 12 months.
es: Por ejemplo, la versión aceptada podría estar disponible públicamente después de la publicación, pero la versión publicada debe esperar 12 meses.

source: #### Open access publishing
es: #### Publicación en acceso abierto

source: Open access publishing attempts to ensure permanent open access to all the articles published in journals, and as a result we have seen the creation of the open access journals.
es: La publicación de acceso abierto intenta asegurar el acceso abierto permanente a todos los artículos publicados en revistas, y como resultado hemos visto la creación de las revistas científicas de acceso abierto.

source: The number of open access journals has increased during the last years, according to the Directory of Open access Journals \([DOAJ](http://www.doaj.org)\), currently there are more than 12,000.
es: El número de revistas de acceso abierto ha aumentado durante los últimos años, según el Directorio de Revistas de Acceso Abierto \([DOAJ](http://www.doaj.org)\), actualmente hay más de 12.000.

source: Open access journal must provide free access to its contents but it also must licence them to allow reusability.
es: La revista científica de acceso abierto debe proporcionar acceso gratuito a sus contenidos, pero también debe licenciarlos para permitir su reutilización.

source: Currently many paywalled journals offer individual open access options to researchers once the paper is accepted after peer review.
es: Actualmente, muchas revistas de pago ofrecen opciones individuales de acceso abierto a los investigadores e investigadoras una vez que el artículo es aceptado después de la revisión por pares.

source: Those options include the publication under a free content licence and free accessibility to anyone since its first publication.
es: Esas opciones incluyen la publicación bajo una licencia de contenido libre y accesibilidad gratuita para cualquier persona desde su primera publicación.

source: This model is commonly known as the hybrid model because in the same issue of a journal, readers can find open access and paywalled contributions.
es: Este modelo se conoce comúnmente como modelo híbrido porque en el mismo número de una revista, los lectores pueden encontrar contribuciones de acceso abierto y de pago.

source: Usually publishers ask for a fee to open individual contributions.
es: Por lo general, los editores solicitan una tarifa para dar acceso abierto a contribuciones individuales.

source: Open access publishing has two primary versions — gratis and libre.
es: La publicación de acceso abierto tiene dos versiones principales: gratis y libre.

source: Gratis open access is simply making research available for others to read without having to pay for it.
es: El acceso abierto gratuito es simplemente hacer que los resultados de la investigación estén disponibles para que otras personas los lean sin tener que pagar por ellos.

source: However, it does not grant the user the right to make copies, distribute, or modify the work in any way beyond fair use.
es: Sin embargo, esto no otorga a la persona usuaria el derecho de hacer copias, distribuir o modificar el trabajo de ninguna manera más allá del uso justo.

source: Libre open access is gratis, meaning the research is available free of charge, but it goes further by granting users additional rights, usually via a Creative Commons licence, so that people are free to reuse and remix the research.
es: El acceso abierto libre es gratuito, lo que significa que la investigación está disponible de forma gratuita, pero va más allá al otorgar a las personas usuariass derechos adicionales, generalmente a través de una licencia Creative Commons, para que las personas sean libres de reutilizar y modificar los resultados de la investigación.

source: There are varying degrees of what may be considered libre open access.
es: Existen diversos grados de lo que puede considerarse libre acceso abierto.

source: For example, some scholarly articles may permit all uses except commercial use, some may permit all uses except derivative works, and some may permit all uses and simply require attribution.
es: Por ejemplo, algunos artículos académicos pueden permitir todos los usos excepto el comercial, algunos pueden permitir todos los usos excepto los trabajos derivados, y algunos pueden permitir todos los usos y simplemente requieren atribución y reconocimiento.

source: While some would argue that libre open access should be free of any copyright restrictions (except attribution), other scholars consider a work that removes at least some permission barriers to be libre.
es: Si bien algunas personas argumentarían que el acceso abierto libre debería estar libre de restricciones de derechos de autor (excepto la atribución), otras consideran que un trabajo que elimina al menos algunas barreras de permiso es libre.

source: ### Why does open access matter?
es: ### ¿Por qué es importante el acceso abierto?

source: Research is useless if it’s not shared; even the best research is ineffectual if others aren’t able to read and build on it.
es: La investigación es inútil si no se comparte; incluso la mejor investigación es ineficaz si otros no pueden leerla y usarla como base para sus propias investigaciones

source: When price barriers keep articles locked away, research cannot achieve its full potential.
es: Cuando las barreras de precios mantienen los artículos bajo llave, la investigación no puede alcanzar su máximo potencial.

source: Open access benefits researchers who can work more effectively with a better understanding of the literature.
es: El acceso abierto beneficia a todas las personas que investigan ya que pueden trabajar de manera más eficaz con una mejor comprensión de la literatura.

source: It also helps avoid duplication of effort.
es: También ayuda a evitar la duplicación de esfuerzos.

source: No researcher (or funder) wants to waste time and money conducting a study if they know it has been attempted elsewhere.
es: Ninguna persona que investiga (o que financia la investigación) quiere perder su tiempo y dinero realizando un estudio si sabe que se ha intentado en otra parte.

source: But, duplication of effort is all-too-possible when researchers can’t effectively communicate with one another and make results known to others in their field and beyond.
es: Sin embargo, la duplicación de esfuerzos es siempre posible cuando las personas que investigan no pueden comunicarse de manera efectiva entre sí y dar a conocer los resultados a otras personas en su campo y más allá.

source: It also benefits researchers by providing better visibility and therefore higher impact/citation rate for their scholarship.
es: También beneficia a aquellas personas que investigan al proporcionar una mayor visibilidad y, por lo tanto, una mayor tasa de impacto/citación.

source: Numerous publishers, both non-profit and for-profit, voluntarily make their articles openly available at the time of publication or within 6-12 months.
es: Varias editoriales, tanto sin fines de lucro como con fines de lucro, voluntariamente ponen sus artículos a disposición abierta en el momento de la publicación o en un plazo de 6-12 meses luego de la publicación.

source: Many have switched from a closed, subscription model to an open one as a strategic business decision to increase their journal's exposure and impact.
es: Muchos han cambiado de un modelo de suscripción de acceso cerrado a uno de acceso abierto como una decisión comercial estratégica para aumentar la exposición y el impacto de sus revistas.

source: Further it can be argued that taxpayers who pay for much of the research published in journals have a right to access the information resulting from that investment without charge.
es: Además, se puede argumentar que las personas contribuyentes que pagan gran parte de la investigación pública publicada en revistas tienen derecho a acceder a la información resultante de esa inversión sin cargos/pagos adicionales.

source: Finally, if research is available to the widest possible pool of readers then it is more likely/easy for it to be checked and reproduced.
es: Finalmente, si la investigación está disponible para la mayor cantidad posible de lectores, es más probable/fácil que sea verificada y reproducida.

source: ### Best practice for open access
es: ### Buenas prácticas para el acceso abierto

source: #### Self-archiving
es: #### Autoarchivo

source: Self-archive a publication in a suitable repository, institutional or subject-based, following the possible restrictions posed by the publisher, for example an embargo period, or limits on the allowed version to be deposited in such archives.
es: Guarda tu publicación en un repositorio adecuado, institucional o temático, siguiendo las posibles restricciones impuestas por el editor, por ejemplo, un período de embargo, o límites a la versión permitida para ser depositada en dichos reporsitorios.

source: In doing this it is important to make sure you are aware of the copyright implications of any documents/agreements you make when submitting your manuscript to a journal.
es: Al hacerlo, es importante asegurarse de conocer las implicaciones de derechos de autor de cualquier documento o acuerdo que realices al enviar tu manuscrito a una revista.

source: If your institution does not have an institutional repository, advocate for the creation of one.
es: Si tu institución no tiene un repositorio institucional, ¡sugiere la creación de uno!

source: #### Publication
es: #### Publicación

source: Consider submitting your work to a journal that is open access.
es: Considera enviar tu trabajo a una revista de acceso abierto.

source: When doing this be aware that there may be funds or discounts available to cover any associated costs.
es: Al hacerlo, ten en cuenta que puede haber fondos o descuentos disponibles para cubrir los costos asociados.

source: ## Open notebooks
es: ## Cuadernos de laboratorio de acceso abierto

source: Electronic Lab Notebooks (ELNs) enable researchers to organize and store experimental procedures, protocols, plans, notes, data, and even unfiltered interpretations using their computer or mobile device.
es: Los cuadernos de laboratorio electrónicos (ELN, por sus siglas en inglés) permiten a las personas que investigan organizar y almacenar procedimientos experimentales, protocolos, planes, notas, datos e incluso interpretaciones no filtradas utilizando su computadora o dispositivo móvil.

source: They are a digital analogue to the paper notebook most researchers keep.
es: Son el análogo digital al cuaderno de papel que la mayoría de las personas que investigan tienen en sus laboratorios.

source: ELNs can offer several advantages over the traditional paper notebook in documenting research during the active phase of a project, including searchability within and across notebooks, secure storage with multiple redundancies, remote access to notebooks, and the ability to easily share notebooks among team members and collaborators.
es: Los ELN ofrecen varias ventajas sobre el cuaderno de papel tradicional a fin de documentar la investigación durante la fase activa de un proyecto, incluida la capacidad de búsqueda dentro y entre los cuadernos, almacenamiento seguro con múltiples redundancias, acceso remoto a los cuadernos y la capacidad de compartir fácilmente cuadernos entre los miembros del equipo y colaboradores.

source: Open notebook research is simply the practice of making such notebooks openly available, usually online.
es: Cuando hablamos de cuadernos de laboratorios de acceso abiertos nos referimos a la práctica de hacer que dichos cuadernos estén disponibles con acceso abierto, generalmente en línea.

source: Some researchers choose to keep their notebooks open from the very beginning of their projects.
es: Algunos investigadores e investigadoras optan por tener cuadernos de acceso abierto desde el principio de sus proyectos.

source: Rather than wait months, even years, to share their research through journal publication as is the current practice, this allows researchers to post their experimental data and protocols online and in real-time.
es: En lugar de esperar meses, incluso años, para compartir su investigación a través de la publicación en revistas científicas como es la práctica actual, esto permite a los investigadores publicar sus datos y protocolos experimentales en línea y en tiempo real.

source: Sharing research in this open and timely manner helps to reduce duplication of work, helps foster new collaborations, and cultivates a more open dialogue with others.
es: Compartir la investigación de esta manera abierta y en el tiempo oportuna ayuda a reducir la duplicación de trabajo, a fomentar nuevas colaboraciones y cultiva un diálogo más abierto con tus colegas.

source: It also helps researchers avoid making exploring dead ends and making mistakes that have already been covered by their colleague, but went unpublished because of lack of scientific interest.
es: También ayuda a las personas que investigan a evitar explorar callejones sin salida y cometer errores que ya han sido cometidos por otros colegas, pero que no se publicaron debido a la falta de interés científico.

source: Open notebooks have the further benefit of increasing the quality of scientific outputs by forcing researchers to be careful, thorough, and explicit.
es: Los cuadernos de acceso abiertos tienen el beneficio adicional de aumentar la calidad de los resultados científicos al obligar a las personas que investigan a ser cuidadosas, minuciosas y explícitas.

source: Making research open has the added benefit of increasing the likelihood that any errors made in an investigation will be spotted quickly, instead of down the line.
es: La investigación de acceso abierto tiene el beneficio adicional de aumentar la probabilidad de que los errores cometidos en una investigación se detecten rápidamente, en lugar de mucho tiempo después.

source: Immediate fixes will have much less impact on a research project, which will save a research time, the lab money, and pride.
es: Las soluciones rápidas e inmediatas tendrán un impacto mucho menor en un proyecto de investigación, lo que ahorrará tiempo de investigación, dinero de laboratorio y orgullo.

source: Ideally, every scientist would maintain an open notebook in real-time which would encompass all aspects of their research.
es: Idealmente, cada persona en el laboratorio mantendría un cuaderno de acceso abierto en tiempo real que abarcaría todos los aspectos de su investigación.

source: But many fears about dealing with complete open access, conflicts with intellectual property and publications, and online data overload hamper this movement.
es: Pero muchos temores sobre lidiar con el acceso abierto, los conflictos con la propiedad intelectual de las publicaciones y la sobrecarga de datos en línea obstaculizan este movimiento.

source: To combat this, practitioners encourage any form of open notebook research, "make open what you can", even if that means uploading some information for a project from many years ago that never saw the light of day.
es: Para combatir esto, los profesionales fomentan cualquier forma de cuadernos de laboratorio de acceso abierto, "abra lo que pueda", incluso si eso significa publicar información de un proyecto de hace muchos años que nunca vio la luz del día.

source: ## Open scholarship
es: ## Academia de acceso abierto

source: Open research and its subcomponents fit under the umbrella of a broader concept - open scholarship.
es: La investigación de acceso abierto y sus subcomponentes encajan bajo el paraguas de un concepto más amplio: la academis de acceso abierto.

source: ### Open educational resources
es: ### Recursos educativos de acceso abierto

source: Open educational resources (OERs) are teaching and learning materials that can be freely used and reused for learning and/or teaching at no cost, and without needing to ask permission. Examples are courses, including Massive Online Open Courses (MOOCs), lectures, teaching materials, assignments, and various other resources. OERs are available in many different formats compatible with online usage, most obviously text, images, audio, and video. Anyone with internet access can access and use OERs; access is not dependent on location or membership of a particular institution.
es: Los recursos educativos de acceso abiertos (REA) son materiales de enseñanza y aprendizaje que se pueden usar y reutilizar libremente para aprender y/o enseñar sin costo y sin necesidad de pedir permiso. Algunos ejemplos son los cursos, incluidos los cursos abiertos masivos en línea (MOOC), conferencias, materiales de enseñanza, tareas. y varios otros recursos. Los REA están disponibles en muchos formatos diferentes compatibles con el uso en línea, incluyendo obviamente texto, imágenes, audio y video. Cualquiera con acceso a Internet puede acceder y utilizar los REA; el acceso no depende de la ubicación o la membresía a una institución en particular.

source: Unlike copyrighted resources, OERs have been authored or created by an individual or organization that chooses to retain few, if any, ownership rights. In some cases, that means anyone can download a resource and share it with colleagues and students. In other cases, this may go further and enable people to edit resources and then re-post them as a remixed work. How do you know your options? OERs often have a Creative Commons licence or other permission to let you know how the material may be used, reused, adapted, and shared.
es: A diferencia de los recursos con derechos de autor, los REA han sido creados por una persona u organización que elige conservar pocos derechos de propiedad, si es que los tiene. En algunos casos, eso significa que cualquiera puede descargar un recurso y compartirlo con colegas y estudiantes. En otros casos, esto puede ir más allá y permitir a las personas editar recursos y luego volver a publicarlos como un trabajo modificado. ¿Cómo conoces tus opciones? Los REA suelen tener una licencia Creative Commons u otro permiso para informarle cómo se puede usar, reutilizar, adaptar y compartir el material.

source: Fully open OERs comply with the 5 Rs:
es: Los REAs de acceso abierto completo cumplen con las siguientes características:

source: - Retain: the right to make, own, and control copies of the content.
es: - Conservación: el derecho a hacer, poseer y controlar copias del contenido.

source: - Reuse: the right to use the content in a wide range of ways (for example, in a class, in a study group, on a website, in a video).
es: - Reutilización: el derecho a utilizar el contenido de diversas formas (por ejemplo, en una clase, en un grupo de estudio, en un sitio web, en un video).

source: - Revise: the right to adapt, adjust, modify, or alter the content itself (for example, translate the content into another language).
es: - Revisitar: el derecho a adaptar, ajustar, modificar o alterar el contenido propio (por ejemplo, traducir el contenido a otro idioma).

source: - Remix: the right to combine the original or revised content with other open content to create something new (for example, incorporate the content into a mashup).
es: - Remix: el derecho a combinar el contenido original o revisado con otro contenido abierto para crear algo nuevo (por ejemplo, incorporar el contenido en un "mashup").

source: - Redistribute: the right to share copies of the original content, your revisions, or your remixes with others (for example, give a copy of the content to a friend).
es: - Redistribuir: el derecho a compartir copias del contenido original, tus revisiones o tus remix con otros (por ejemplo, dar una copia del contenido a otra persona).

source: Researchers generate a great deal of educational resources in the course of teaching students and each other (at workshops, for example).
es: Las personas que investigan generan una gran cantidad de recursos educativos para sus clases y para eventos con pares (para talleres y conferencias por ejemplo).

source: By making these openly available, for example in the [open educational resource commons](https://www.oercommons.org/), the wider community can benefit from them in three main ways:
es: Al ponerlos a disposición del público, por ejemplo en el [fondo común de recursos educativos abiertos] (https://www.oercommons.org/), la comunidad en general puede beneficiarse de ellos de tres maneras principales:

source: 1. Most obviously, the community can use the materials to learn about the material they cover.
es: 1. Lo más obvio es que la comunidad puede usar los materiales para aprender sobre los temas que tratan.

source: 2. Sharing resources reduces duplication of effort.
es: 2. Compartir recursos reduce la duplicación de esfuerzos.

source: If an educator needs materials for teaching and such materials already exist openly then they need not make their own from scratch, saving time.
es: Si un educador o educadora necesita materiales para sus clases y tales materiales ya existen de manera abierta, entonces no necesita hacer los suyos desde cero, ahorrando de esta manera tiempo.

source: 3. Making materials openly available helps a community build better resources by improving resources that already exist and combining OERs to take advantage of their different strengths, such as a great diagram or explanation.
es: 3. El hecho de que los materiales estén disponibles abiertamente ayuda a una comunidad a crear mejores recursos mejorando los ya existentes y combinando los REAs, por ejemplo, a través de la creación de un diagrama o una explicación mejorada y/o actualizada.

source: Beyond the raw practical benefits the worldwide OER movement is rooted in the human right to access high-quality education.
es: Más allá de los beneficios prácticos, el movimiento mundial de REA tiene sus raíces en el derecho humano a acceder a una educación de alta calidad.

source: This shift in educational practice is about participation and co-creation.
es: Este cambio en la práctica educativa tiene que ver con la participación y la co-creación.
