Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/open_research.*.po
Languages: es

source: Importantly, such contributions not only result in new functionality from which the broader community can benefit, but also regularly provide their respective authors with greater community recognition, and lead to new project and employment opportunities.
es: Es importante destacar que tales contribuciones no sólo resultan en una nueva funcionalidad de la cual la comunidad en general puede beneficiarse, sino que su autoría también proporciona regularmente un mayor reconocimiento de la comunidad y conduce a nuevos proyectos y oportunidades de empleo.

source: Researchers that make use of open source software often make changes to them such as adding features they need for their own research, or fixing bugs.
es: El personal investigador que utiliza software de código abierto a menudo hace cambios en ellos, como agregar funciones que necesita para su propia investigación o corregir errores.

source: They can then contribute these improvements back to the main project so the wider community can take advantage of them.
es: De esta manera, pueden contribuir con estas mejoras al proyecto principal para que la comunidad en general pueda aprovecharlas.

source: ### How running and contributing to open source software projects benefits you
es: ### Cómo te beneficia la ejecución y la contribución a proyectos de software de código abierto

source: - Improve existing skills: Whether it is coding, user interface design, graphic design, writing, or organizing, if you are looking for practice, there is a task for you on an open source software project.
es: - Mejora las habilidades existentes: ya sea programación, diseño de interfaz de usuario, diseño gráfico, escritura u organización, si estás buscando práctica, hay una tarea para ti en un proyecto de software de código abierto.

source: Further, open source necessitates cleaner, more maintainable code to enable collaboration between potentially thousands of people who may never meet.
es: Además, el código abierto necesita un código más limpio y fácil de mantener para permitir la colaboración entre miles de personas que posiblemente nunca se encuentren.

source: This helps to build and maintain good coding habits.
es: Esto ayuda a construir y mantener buenos hábitos de programación.

source: Not to be underestimated are the people skills you can develop on open source software projects.
es: No deben subestimarse las habilidades sociales que puedes desarrollar en proyectos de software de código abierto.

source: Open source offers opportunities to practice leadership and management skills, such as resolving conflicts, organising teams of people, and prioritising work.
es: El código abierto ofrece oportunidades para practicar habilidades de liderazgo y gestión, como resolver conflictos, organizar equipos de personas y priorizar el trabajo.

source: - Advance your career: By definition, all of your open source work is public and this presents opportunities:
es: - Avanza en tu carrera: por definición, todo tu trabajo de código abierto es público y esto presenta oportunidades:

source: - Demonstrate technical ability: Technical interviews traditionally involve working on a simulated problem that can be tackled in a set amount of time with little additional context.
es: - Demostrar capacidad técnica: las entrevistas técnicas tradicionalmente implican trabajar en un problema simulado que puede abordarse en un periodo de tiempo establecido con poco contexto adicional.

source: Such simulations, by definition, are not real world use cases, nor do they show what working with an applicant would be like.
es: Tales simulaciones, por definición, no son casos de uso del mundo real, ni muestran cómo sería trabajar con la persona candidata.

source: Open source provides visibility into both how a candidate solves problems, and how they work with others.
es: El código abierto proporciona visibilidad tanto de cómo una persona resuelve problemas como de cómo trabaja con otras.

source: You make a much more appealing employee if an employer can see the quality of your work and see you working with others over a long period of time rather than taking a chance on a single short, high-stress case which may not play to your strengths.
es: Tu candidatura se vuelve mucho más atractiva si un empleador puede ver la calidad de tu trabajo y verte trabajando con otras personas durante un largo periodo de tiempo en lugar de arriesgarse con una única muestra breve y de alto estrés que puede no demostrar tus fortalezas .

source: - Reputation: Becoming an active member of the open source community can gain you a positive reputation which may bolster future job prospects.
es: - Reputación: contribuir de forma activa a la comunidad de código abierto puede hacerte ganar una reputación positiva que puede impulsar las perspectivas de trabajo en el futuro.

source: - Meet people with similar interests: Open source software projects with warm, welcoming communities keep people coming back for years and many people form lifelong friendships through their participation in open source.
es: - Conoce a personas con intereses similares: los proyectos de software de código abierto con comunidades cálidas y acogedoras hacen que la gente regrese durante años y muchas personas forman amistades para toda la vida a través de su participación en el código abierto.

source: - Find mentors and teach others: Working with others on a shared project means you will have to explain how you do things, as well as ask other people for help. The acts of learning and teaching can be a fulfilling activity for everyone involved.
es: - Encuentra a alguien que te guíe y comparte tu conocimiento: trabajar en un proyecto compartido significa que tendrás que explicar cómo haces las cosas, así como pedir ayuda a otras personas. Los actos de aprendizaje y enseñanza pueden ser una actividad satisfactoria para todas las personas involucradas.

source: #### Making your own work open source
es: #### Convierte tu propio trabajo a código abierto

source: - Re-usability: Making your work openly available for re-use makes it easier for others to incorporate into their own research. If you make your software citeable, for example via a [DOI](doi_system) this can increase your citations.
es: - Reutilización: hacer que tu trabajo esté abiertamente disponible para su reutilización hace que sea más fácil para otras personas incorporarlo a su propia investigación. Hacer que tu software sea citable, por ejemplo, a través de un [DOI] (doi_system), puede aumentar tus citas.

source: - When you write closed source software, the only developers that can potentially detect, diagnose, triage, and resolve software bugs are those that have a copy of the code.
es: - Cuando escribes software de código cerrado, las únicas personas que pueden detectar, diagnosticar, clasificar y resolver errores de software son aquellas que tienen una copia del código.

source: If your project is open the number of potentially contributing developers and thus the potential knowledge pool is orders of magnitude larger.
es: Si tu proyecto es de código abierto, la cantidad de personas potencialmente contribuyentes y, por lo tanto, el conjunto de conocimientos potenciales es mucho mayor.

source: - Feedback: Making your work open enables you to get feedback and improve your project in way you may never have thought of alone.
es: - Comentarios: hacer que tu trabajo sea de código abierto te permite obtener comentarios y mejorar tu proyecto de una manera en la que nunca hubieras pensado trabajando en solitario.

source: - Accountability: There is an argument that any software developed using government money should be open source by default; if the public has paid for its development they have a right to make use of it.
es: - Responsabilidad: existe el argumento de que cualquier software desarrollado con dinero del gobierno debería ser de código abierto por defecto; si el público ha pagado por su desarrollo, tiene derecho a hacer uso de él.

source: If your work is government funded making it open is a step you can take towards government openness and accountability.
es: Si tu trabajo es financiado por el gobierno, hacerlo abierto es un paso que puede contribuir hacia la apertura y la rendición de cuentas del gobierno.

source: #### Contributing to others' open source software projects
es: #### Contribuir a otros proyectos de software de código abierto

source: - It is empowering to be able to make changes, even small ones: You do not have to become a lifelong contributor to enjoy participating in open source.
es: - Es enriquecedor poder realizar cambios, incluso pequeños: no es necesario que establezcas una colaboración de por vida para disfrutar de la participación en proyectos de código abierto.

source: Have you ever seen a typo on a website, and wished someone would fix it?
es: ¿Alguna vez has visto un error tipográfico en un sitio web y deseaste que lo corrigieran?

source: On an open source software project, you can do just that.
es: En un proyecto de software de código abierto, puedes hacer precisamente eso.

source: Open source helps people feel agency over their lives and how they experience the world, and that in itself is gratifying.
es: El código abierto ayuda a las personas a sentirse aliadas sobre sus vidas y en relación a cómo experimentan el mundo, y esto en sí mismo es gratificante.

source: - It is fun:
es: - Es divertido:

source: Open source provides an endless, ever-changing set of Rubix cubes for you to solve on weekends. Just like puzzles, both crossword and jigsaw, open source provides bite-sized intellectual escapes.
es: El código abierto proporciona un conjunto infinito y en constante cambio de cubos Rubik para que los resuelvas los fines de semana. Al igual que los puzzles, tanto crucigramas como rompecabezas, el código abierto proporciona escapes intelectuales del tamaño de un bocado.

source: ### How open source software benefits research
es: ### Cómo el software de código abierto beneficia a la investigación

source: Open source software projects primarily benefit research by allowing researchers to take advantage of each others' work. This enables researchers to apply their efforts to high-value work.
es: Los proyectos de software de código abierto benefician principalmente a la investigación al permitir que el personal investigador aproveche el trabajo de otras personas. Esto permite al personal investigador aplicar sus esfuerzos a trabajos de alto valor.

source: It is sometimes said that "all the easy problems have already been solved".
es: A veces se dice que "ya se han resuelto todos los problemas fáciles".

source: Blogging, content management, and operating systems are all problems with established (and mainstream) open source solutions, to name a few.
es: Los blogs, la administración de contenido, y los sistemas operativos son problemas con las soluciones de código abierto establecidas (y convencionales), por nombrar algunas.

source: While developers could spend their time reinventing wheels that the open source community have already perfected, it is highly preferable to use the world's best wheel, especially when that wheel comes at no cost to you.
es: Si bien quienes desarrollan podrían dedicar su tiempo a reinventar ruedas que la comunidad de código abierto ya ha perfeccionado, es preferible utilizar la mejor rueda del mundo, especialmente cuando esa rueda no tiene ningún costo para ti.

source: This frees researchers up to work on yet-unsolved challenges.
es: Esto libera al personal investigador para trabajar en desafíos aún sin resolver.

source: This reduces duplication of effort and allows researchers to focus on the work they're actually interested in.
es: Esto reduce la duplicación de esfuerzos y permite al personal investigador centrarse en el trabajo que realmente les interesa.

source: Working openly also allows any number of researchers to collaborate on projects that could not possibly be developed by single researchers/research groups.
es: Trabajar abiertamente también permite que cualquier número de personas investigadoras colabore en proyectos que posiblemente no podrían ser desarrollados por grupos de investigación individuales.

source: Examples include [Linux](https://www.linux.org/) operating systems, Python packages such as [scipy](https://www.scipy.org/) and [numpy](http://www.numpy.org/), and the machine learning library [TensorFlow](https://www.tensorflow.org/).
es: Los ejemplos incluyen el sistema operativo [Linux] (https://www.linux.org/), paquetes de Python como [scipy] (https://www.scipy.org/) y [numpy](http://www.numpy.org/) y la biblioteca de aprendizaje automático [TensorFlow] (https://www.tensorflow.org/).

source: ### How to run your own open source software project
es: ### Cómo ejecutar tu propio proyecto de software de código abierto

source: You can open source an idea, a work in progress, or after years of being closed source.
es: Puedes hacer pública una idea, un trabajo en progreso o después de años de ser código cerrado.

source: At the most basic level all you need to do is put your code online somewhere that is likely to last a long time.
es: En el nivel más básico, todo lo que necesitas hacer es poner tu código en línea en algún lugar que probablemente dure mucho tiempo.

source: You can make your code citeable by assigning it a DOI (as discussed in the section on [making data citeable](#citing_data)).
es: Puedes hacer que tu código sea citable asignándole un DOI (como se explica en la sección sobre [hacer que los datos sean citables](#citing_data)).

source: This helps ensure that you get proper credit if people use or build upon your work.
es: Esto ayuda a garantizar que obtienes el crédito adecuado si otras personas usan o desarrollan tu trabajo.

source: A popular place to make your code available is GitHub (see the chapter on [version control](/version_control/version_control)). You must include a licence file stating that anyone has permission to use, copy, and modify your work. Without this no one can legally use your work and so it isn't open source. [This](https://choosealicense.com/) website offers a very simple mechanism to help you pick the best licence for your project. There are also a few other files you should include with your code, as described below.
es: Un lugar popular para hacer que tu código esté disponible es GitHub (consulta el capítulo sobre [control de versiones] (/version_control/version_control)). Debes incluir un archivo de licencia que indique que cualquier persona tiene permiso para usar, copiar y modificar tu trabajo. Sin esto, nadie puede usar legalmente tu trabajo y, por lo tanto, no es de código abierto. [Este](https://choosealicense.com/) sitio web ofrece un mecanismo muy simple para ayudarte a elegir la mejor licencia para tu proyecto. También hay otros archivos que debes incluir en tu código, como se describe a continuación.

source: #### Welcome users by adding information to your README
es: #### Da la bienvenida a la comunidad agregando información a tu archivo README

source: You should include a readme file where you include useful information about what the project is, how to use it, and how to contribute to it. Here's a list of the main things a readme should include:
es: Debes incluir un archivo README en el que incluyas información útil sobre qué es el proyecto, cómo usarlo y cómo contribuir a él. Aquí hay una lista de las cosas principales que debes incluir en un archivo README:

source: - The project name and what it is: This will greatly help someone that comes across it to get an idea of the project. Include a few key points that describe the main features of the project and what are the main features you're implementing.
es: - El nombre del proyecto y lo que es: esto ayudará mucho a quien lo encuentre a hacerse una idea del proyecto. Incluye algunos puntos clave que describan las características principales del proyecto y cuáles son las características principales que estás implementando.

source: This helps to quickly compare other projects with yours and to give an idea that why the project exists in the first place.
es: Esto ayuda a comparar rápidamente otros proyectos con el tuyo y a dar una idea de por qué existe el proyecto en primer lugar.

source: - Instructions on how to install the project: The installer might be a collaborator, someone that comes across and is interested in the project, or even you if you get a new machine and need to re-install your project.
es: - Instrucciones sobre cómo instalar el proyecto: quien lo instale puede ser una persona colaboradora, alguien que se cruza y a quien le interesa el proyecto, o incluso tú si obtienes una nueva máquina y necesitas reinstalar tu proyecto.

source: Nevertheless, it is a total waste of both of your resources to start figuring out how to just get started with the project. This should also include any prerequisites that will be needed to run the project.
es: Sin embargo, es un desperdicio total comenzar a descubrir cómo comenzar a colaborar en el proyecto. Esto también debe incluir los requisitos previos necesarios para ejecutar el proyecto.

source: The best thing you can do is to just write up the installation instructions when you first do them yourself, and you'll quickly save hours of work in the future.
es: Lo mejor que puedes hacer es escribir las instrucciones de instalación la primera vez que las ejecutes, y te ahorrarás rápidamente horas de trabajo en el futuro.

source: - Instructions for how to run the code and any associated tests: If you've been working on your project it may seem obvious how to run it, but this will likely not be the case for someone coming across it for the first time.
es: - Instrucciones sobre cómo ejecutar el código y las pruebas asociadas: si has estado trabajando en tu proyecto, puede parecerte obvio cómo ejecutarlo, pero es probable que este no sea el caso para alguien que lo encuentre por primera vez.

source: - Links to related material.
es: - Enlaces a material relacionado.

source: - List of authors/contributors to the project, possibly with contact information.
es: - Lista de las personas autoras/colaboradoras del proyecto, posiblemente con información de contacto.

source: - Acknowledgements.
es: - Agradecimientos.

source: If you intend for other people to collaborate on your project (as opposed to just making your code available and considering it complete) then you should include contributing guidelines and most likely a code of conduct.
es: Si tienes la intención de que otras personas colaboren en tu proyecto (en lugar de simplemente hacer que tu código esté disponible y considerarlo completo), entonces debes incluir pautas de contribución y, muy probablemente, un código de conducta.

source: #### Contributing guidelines
es: #### Pautas de contribución

source: Contributing guidelines tell your audience how to participate in your project. For example, you might include information on:
es: Las pautas de contribución le dicen a tu audiencia cómo participar en tu proyecto. Por ejemplo, puedes incluir información sobre:

source: - How to file a bug report.
es: - Cómo presentar un informe de error.

source: - How to suggest a new feature.
es: - Cómo sugerir una nueva funcionalidad.

source: - Your roadmap or vision for the project.
es: - Tu hoja de ruta o visión del proyecto.

source: - How contributors should (or should not) get in touch with you.
es: - Cómo las personas que contribuyan deben (o no deben) ponerse en contacto contigo.

source: Using a warm, friendly tone and offering specific suggestions for contributions (such as writing documentation, or making a website) can go a long way in making newcomers feel welcomed and excited to participate.
es: Usar un tono cálido y amigable y ofrecer sugerencias específicas para las contribuciones (como escribir documentación o hacer un sitio web) puede ser de gran ayuda para darle la bienvenida a quien recién llegue a tu proyecto y despertarle ganas de participar.

source: For example, [Active Admin](https://activeadmin.info/index.html) starts its [contributing guide](https://github.com/activeadmin/activeadmin/blob/master/CONTRIBUTING.md) with: "First off, thank you for considering contributing to Active Admin. It’s people like you that make Active Admin such a great tool."
es: Por ejemplo, [Active Admin](https://activeadmin.info/index.html) comienza su [guía de contribución](https://github.com/activeadmin/activeadmin/blob/master/CONTRIBUTING.md) con: "En primer lugar, gracias por considerar contribuir a Active Admin. Son personas como tú las que hacen de Active Admin una herramienta tan excelente".

source: In the earliest stages of your project, your contributing guidelines file can be simple.
es: En las primeras etapas de tu proyecto, tu archivo de pautas de contribución puede ser simple.

source: You should always explain how to report bugs or file issues, and any technical requirements (like tests) to make a contribution.
es: Siempre debes explicar cómo reportar errores o problemas de archivos, y cualquier requisito técnico (como pruebas) para hacer una contribución.

source: Over time, you might add other frequently asked questions here or in your readme file.
es: Con el tiempo, puedes agregar otras preguntas frecuentes aquí o en tu archivo README.

source: Writing down this information means fewer people will ask you the same questions over and over again.
es: Escribir esta información significa que menos personas te harán las mismas preguntas una y otra vez.

source: It's also a good idea to link to your contributing guidelines file from your readme, so more people see it.
es: También es una buena idea vincular tu archivo de pautas de contribución desde tu archivo README, para que más personas lo vean.

source: #### Code of conduct
es: #### Código de conducta

source: A code of conduct helps set ground rules for behaviour for your project's participants.
es: Un código de conducta ayuda a establecer reglas básicas de comportamiento para quien participe en tu proyecto.

source: This is especially valuable if you are launching an open source project for a community or company.
es: Esto es especialmente valioso si estás lanzando un proyecto de código abierto para una comunidad o empresa.

source: A code of conduct empowers you to facilitate healthy, constructive community behaviour, which will reduce your stress as a maintainer.
es: Un código de conducta te permite facilitar un comportamiento comunitario saludable y constructivo, lo que reducirá tu estrés como responsable del mantenimiento.

source: In addition to communicating how you expect participants to behave, a code of conduct also tends to describe who these expectations apply to, when they apply, and what to do if a violation occurs.
es: Además de comunicar cómo esperas que se comporte la comunidad, un código de conducta también tiende a describir a quién se aplican estas expectativas, cuándo se aplican y qué hacer si ocurre una infracción.
