Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/open_research.*.po
Languages: es

source: - A licence: This grants legal permission to anyone to re-use, modify, and distribute your designs and hardware according to the terms stated (for example, they must acknowledge your contribution).
es: - Una licencia: la misma otorga permiso legal a cualquier persona para reutilizar, modificar y distribuir tus diseños y hardware de acuerdo con los términos establecidos (por ejemplo, ella debe reconocer tu contribución).

source: - Original design files: These are the original source files that you would use to make modifications to the hardware's design.
es: - Archivos de diseño originales: estos son los archivos fuente originales que tu utilizarías para modificar en el diseño del hardware.

source: The act of sharing these files is the core practice of open source hardware.
es: El acto de compartir estos archivos es la base del hardware de código abierto.

source: - Ideally, your open source hardware project would be designed using a free and open source software application, to maximize the ability of others to view and edit it.
es: - Idealmente, tu proyecto de hardware de código abierto se diseñaría utilizando una aplicación gratuita y de software de código abierto, para maximizar la capacidad de otras personas para verlo y editarlo.

source: For better or worse however, hardware design files are often created in proprietary programs and stored in proprietary formats.
es: Sin embargo, para bien o para mal, los archivos de diseño de hardware a menudo se crean en programas privativos o de marca registrada y se almacenan en formatos privativos.

source: It is still essential to share these original design files; they constitute the original "source code" for the hardware.
es: Sigue siendo fundamental compartir estos archivos de diseño originales; ellos constituyen el "código fuente" original del hardware.

source: They are the very files that someone will need in order to contribute changes to a given design.
es: Son los mismos archivos que alguien necesitará para contribuir a modificar un diseño dado.

source: - Try to make your design files easy for someone else to understand. In particular, organize them in a logical way, comment complex aspects, and note any unusual manufacturing procedures.
es: - Intenta que tus archivos de diseño sean fáciles de entender para otra persona. En particular, organízalos de forma lógica, comenta aspectos complejos y documenta los procedimientos de fabricación inusuales.

source: - Examples of Original Design Files include 2D drawings and computer-aided design (CAD) files.
es: - Ejemplos de archivos de diseño original incluyen dibujos en 2D y archivos de diseño asistido por computadora (CAD, por sus siglas en inglés).

source: - Auxiliary Design Files: Beyond the original design files, it is often helpful to share your design in additional, more accessible formats.
es: - Archivos de diseño auxiliares: más allá de los archivos de diseño originales, a menudo resulta útil compartir tu diseño en otros formatos más accesibles.

source: For example, best practice open sourcing a CAD design is to share the design not just in its native file format, but also in a range of interchange and export formats that can be opened or imported by other CAD programs.
es: Por ejemplo, una buena práctica para diseños CAD es compartir el diseño no solo en su formato de archivo nativo, sino también en una variedad de formatos que puedan ser abiertos o importados por otros programas CAD.

source: - It is also helpful to provide ready-to-view outputs that can easily be viewed by end users who wish to understand (but not necessarily modify) the design.
es: - También es útil proporcionar resultados en un formato que permita que aquellas personales que deseen comprender (pero no modificar necesariamente) el diseño puedan verlos fácilmente.

source: For example, a PDF of a circuit board schematic.
es: Por ejemplo, un PDF de un esquema de una placa de circuito.

source: These auxiliary design files allow people to study the design of the hardware, and sometimes even fabricate it, even without access to particular proprietary software packages.
es: Estos archivos de diseño auxiliares permiten a las personas estudiar el diseño del hardware y, a veces, hasta fabricarlo, incluso sin acceso a paquetes de software privativos particulares.

source: However, note that auxiliary design files are never recommended as substitutes for original design files.
es: Sin embargo, ten en cuenta que los archivos de diseño auxiliares nunca se recomiendan como sustitutos de los archivos de diseño originales.

source: - Additional technical drawings: In their original formats, if required for fabrication of the device, in a commonly-readable format such as PDF.
es: - Dibujos técnicos adicionales: en sus formatos originales, si son necesarios para la fabricación del dispositivo, en un formato de lectura común tal como PDF.

source: - Bill Of Materials: While it might be possible to infer from the design files which parts make up a piece of hardware, it is important to provide a separate bill of materials.
es: - Lista de materiales: si bien es posible inferir de los archivos de diseño qué partes componen una pieza de hardware, es importante proporcionar también una lista de materiales.

source: This can be a spreadsheet (for example, CSV, XLS, Google Doc) or simply a text file with one part per line.
es: Puede ser una hoja de cálculo (por ejemplo, CSV, XLS, Google Doc) o simplemente un archivo de texto.

source: - Useful things to include in the bill of materials are part numbers, suppliers, costs, and a short description of each part.
es: - Las cosas útiles para incluir en la lista de materiales son los números de piezas, los proveedores, los costos y una breve descripción de cada pieza.

source: Make it easy to tell which item in the bill of materials corresponds to which component in your design files: use matching reference designators in both places, provide a diagram indicating which part goes where, or otherwise explain the correspondence.
es: Facilita saber qué elemento de la lista de materiales corresponde a qué componente en tus archivos de diseño: usa indicadores y/o referencias coincidentes en ambos lugares, proporciona un diagrama que indique qué parte va a dónde, o explica la correspondencia.

source: - Software and Firmware: You should share any code or firmware required to operate your hardware.
es: - Software y firmware: debes compartir cualquier código o firmware necesario para operar tu hardware.

source: This will allow others to use it with their hardware or modify it along with their modifications to your hardware.
es: Esto permitirá que otras personas lo utilicen con su hardware o lo modifiquen junto con sus modificaciones en tu hardware.

source: Document the process required to build your software, including links to any dependencies (for example, third-party libraries or tools). In addition, it is helpful to provide an overview of the state of the software (for example, "stable" or "beta" or "barely-working hack").
es: Documenta el proceso necesario para construir tu software, incluidos los enlaces a cualquier dependencia (por ejemplo, bibliotecas o herramientas de terceros). Además, es útil proporcionar una descripción general del estado del software (por ejemplo, "estable" o "beta" o "hack que apenas funciona").

source: - Photos: Photos help people understand what your project is and how to put it together.
es: - Fotos: las fotos ayudan a las personas a comprender cuál es tu proyecto y cómo armarlo/construirlo.

source: It is good to publish photographs from multiple viewpoints and at various stages of assembly. If you do not have photos, posting 3D renderings of your design is a good alternative. Either way, it is good to provide captions or text that explain what is shown in each image and why it is useful.
es: Es bueno publicar fotografías desde perspectivas diferentes y en distintas etapas de montaje. Si no tienes fotos, publicar representaciones 3D de tu diseño es una buena alternativa. De cualquier manera, es bueno proporcionar subtítulos o texto que expliquen lo que se muestra en cada imagen y por qué es útil.

source: - Instructions and Other Explanations: In addition to the design files themselves, there are a variety of explanations that are invaluable in helping others to make or modify your hardware:
es: - Instrucciones y otras explicaciones: además de los archivos de diseño en sí, hay una variedad de explicaciones que son invaluables para ayudar a otros a crear o modificar tu hardware:

source: - Making the hardware: To help others make and modify your hardware design, you should provide instructions for going from your design files to the working physical hardware.
es: - Fabricación del hardware: para ayudar a otros a crear y modificar el diseño de tu hardware, deberías proporcionar instrucciones para pasar de los archivos de diseño al hardware.

source: As part of the instructions, it is helpful to link to datasheets for the components / parts of your hardware and to list the tools required to assemble it.
es: Como parte de las instrucciones, es útil vincular las hojas de datos de los componentes / piezas de tu hardware y enumerar las herramientas necesarias para ensamblarlo.

source: If the design requires specialized tools, tell people where to get them.
es: Si el diseño requiere herramientas especializadas, díle a la gente dónde conseguirlas.

source: - Using the hardware: Once someone has made the hardware, they need to know how to use it.
es: - Uso del hardware: una vez que alguien ha creado el hardware, necesita saber cómo usarlo.

source: Provide instructions that explain what it does, how to set it up, and how to interact with it.
es: Proporciona instrucciones que expliquen lo que tu hardware hace, cómo configurarlo y cómo interactuar con él.

source: - Design rationale: If someone wants to modify your design, they will want to know why it is the way it is.
es: - Justificación del diseño: si alguien quiere modificar tu diseño, querrá saber por qué está hecho de la manera en que está diseñado.

source: Explain the overall plan of the hardware's design and why you made the specific choices you did.
es: Explica el plan general del diseño del hardware y por qué tomaste las decisiones específicas que tomaste en el diseño.

source: - Limit jargon: Keep in mind that these instructions may be read by someone whose expertise or training is different from yours.
es: - Limita la jerga: ten en cuenta que estas instrucciones podrían ser leídas por alguien cuya experiencia o formación sea diferente a la tuya.

source: As much as possible, try to write to a general audience, check your instructions for industry jargon, and be explicit about what you assume the user knows.
es: En la medida de lo posible, intenta escribir a un público general, evita el uso de jerga industrial en las instrucciones y especifica lo que supones que la persona usuaria sabe de antemano.

source: - Format: The instructions could be in a variety of formats, such as a wiki, text file, Google Doc, or PDF.
es: - Formato: las instrucciones pueden estar en una variedad de formatos, tales como wiki, archivo de texto, Google Doc o PDF.

source: Remember, though, that others might want to modify your instructions as they modify your hardware design, so it is good to provide the original editable files for your documentation, not just output formats like PDF.
es: Sin embargo, recuerda que es posible que otras personas quieran modificar tus instrucciones a medida que modifican el diseño de tu hardware, por lo que es bueno proporcionar los archivos editables originales de tu documentación, no solo formatos de salida como PDF.

source: ### Open source hardware processes and practices
es: ### Prácticas y procesos de hardware de código abierto

source: #### Designing your hardware
es: #### Diseñando tu hardware

source: If you are planning to open source a particular piece of hardware, following certain best practices in its design will make it easier for others to make and modify the hardware:
es: Si planeas abrir el código fuente de una pieza de hardware en particular, seguir ciertas mejores prácticas en tu diseño facilitará a otras personas la construcción y modificación del hardware:

source: - Use free and open source software design (CAD) tools where possible: If that is not feasible, try to use low-cost and/or widely-used software packages.
es: - Usa herramientas de diseño de software (CAD) gratuitas y de código abierto siempre que sea posible: si eso no es factible, intenta utilizar paquetes de software de bajo costo y / o ampliamente utilizados.

source: - Use standard and widely-available components, materials, and production processes: Try to avoid parts that are not available to individual customers or processes that require expensive setup costs.
es: - Utiliza componentes, materiales y procesos de producción estándar y ampliamente disponibles: trata de evitar piezas que no estén disponibles para clientes individuales o procesos que requieran costos de instalación elevados.

source: #### Hosting your design files
es: #### ¿Dónde alojar tus archivos de diseño?

source: A basic way of sharing your files is with a zip file on your website.
es: Una forma sencilla de compartir tus archivos es con un archivo zip en tu sitio web.

source: While this is a great start, it makes it difficult for others to follow your progress or to contribute improvements.
es: Si bien este es un gran comienzo, dificulta que otros sigan tu progreso o contribuyan con mejoras.

source: Using an online source-code repository (like GitHub, GitLab, or NotaBug) may be a better place to store your open source hardware projects.
es: Usar un repositorio de código fuente en línea (como GitHub, GitLab o NotaBug) puede ser un mejor lugar para almacenar tus proyectos de hardware de código abierto.

source: #### Distributing open source hardware
es: #### Distribución de hardware de código abierto

source: - Provide links to the source (original design files) for your hardware on the product itself, its packaging, or its documentation.
es: - Proporciona enlaces a la fuente (archivos de diseño originales) de tu hardware en el producto en sí, su empaque o su documentación.

source: - Make it easy to find the source (original design files) from the website for a product.
es: - Facilita la búsqueda de la fuente (archivos de diseño originales) desde el sitio web del producto.

source: - Label the hardware with a version number or release date so that people can match the physical object with the corresponding version of its design files.
es: - Etiqueta el hardware con un número de versión o fecha de lanzamiento para que las personas puedan hacer coincidir el objeto físico con la versión correspondiente de sus archivos de diseño.

source: - In general, clearly indicate which parts of a product are open source (and which are not).
es: - En general, indica claramente qué partes de un producto son de código abierto (y cuáles no).

source: ## Open access
es: ## Acceso abierto

source: ### What is open access?
es: ### ¿Qué es el acceso abierto?

source: One of the most common ways to disseminate research results is by writing a manuscript and publishing it in a journal, conference proceedings or book. For many years those publications were available to the public if purchased by means of a subscription fee or individually.
es: Una de las formas más comunes de difundir los resultados de una investigación es escribiendo un manuscrito y publicándolo en una revista científica, acta de congresos o un libro. Durante muchos años, esas publicaciones estuvieron a disposición del público si se compraban mediante suscripción o individualmente.

source: However, new knowledge is built by synthesizing current scholarship and then building upon it.
es: Sin embargo, el conocimiento nuevo se construye sintetizando lo que se conoce actualmente y luego basándose en eso para desarrollar más conocimiento.

source: At the turn of the 21st century a new movement appeared with a clear objective: make all the research results available to anyone interested in reading it, free of charge by any user, with no technical obstacles such as mandatory registration or login to specific platforms.
es: A principios del siglo XXI apareció un nuevo movimiento con un objetivo claro: poner a disposición de todas las personas interesadas todos los resultados de la investigación científica, de forma gratuita, sin obstáculos técnicos tal como el registro obligatorio o el inicio de sesión en plataformas específicas.

source: This movement took the name of Open access and established two initial strategies to achieve its final goal: self-archiving and open access publishing.
es: Este movimiento tomó el nombre de acceso abierto y estableció dos estrategias iniciales para lograr su objetivo final: el autoarchivo y la publicación de acceso abierto.

source: #### Repositories and self-archiving
es: #### Repositorios y el autoarchivo

source: The aim of the self-archiving movement is to provide tools and assistance to scholars to deposit their refereed journal articles in open electronic repositories.
es: El objetivo del movimiento de autoarchivo es proporcionar herramientas y asistencia a las personas dentro de la academia para depositar sus artículos en revistas científicas arbitradas en repositorios electrónicos abiertos.

source: As a result of the first strategy we see self-archiving practices: researchers depositing and disseminating papers in institutional or subject based repositories.
es: Como resultado de la primera estrategia, se han desarrollado varias prácticas de autoarchivo: los investigadores depositan y difunden sus artículos en repositorios institucionales o temáticos.

source: There has also been a growth in the publication of preprints through institutional repositories and preprint servers.
es: También ha habido un crecimiento en la publicación de "preprints" a través de repositorios institucionales y servidores de "preprints".

source: Preprints are widely used in physical sciences and now emerging in life sciences and other fields.
es: Los preprints se utilizan ampliamente en las ciencias físicas y ahora están surgiendo en las ciencias de la vida y otros campos.

source: Preprints are documents that have not been peer reviewed but are considered as a complete publication in a first stage.
es: Los preprints son documentos que no han pasado por una revisión por pares, pero que se consideran como una publicación completa en una primera etapa.

source: Some of the preprint servers include open peer review services and the availability to post new versions of the initial paper once reviewed by peers.
es: Algunos de los servidores de preprints incluyen servicios abiertos de revisión por pares y la posibilidad de publicar nuevas versiones del documento una vez revisado por pares.

source: At the beginning of 2019 more than 4000 repositories are available for researchers to self-archive their publications according to the [registry of open access repositories](http://roar.eprints.org/).
es: A principios del 2019 hay más de 4000 repositorios disponibles para que los investigadores e investigadoras autoarchiven sus publicaciones según el [registro de repositorios de acceso abierto] (http://roar.eprints.org/).

source: In this list there are institutional repositories, subject based or thematic repositories, and harvesters.
es: En esta lista hay repositorios institucionales, repositorios temáticos y repositorios recolectores.

source: Institutional repositories are generally managed by research performing institutions to provide to their community a place to archive and share openly papers and other research outputs.
es: Los repositorios institucionales generalmente son administrados por instituciones que realizan investigaciones para brindar a su comunidad un lugar para archivar y compartir abiertamente artículos y otros resultados de la investigación.

source: Subject based repositories are usually managed by research communities and most of the contents are related to a certain discipline.
es: Los repositorios temáticos suelen ser gestionados por comunidades de investigación y la mayoría de los contenidos están relacionados con una determinada disciplina.

source: Finally, harvesters aggregate content from different repositories becoming sites to perform general searches and build other value-added services.
es: Finalmente, los repositorios recolectores agregan contenido de diferentes repositorios y se convierten en sitios para realizar búsquedas generales y construir otros servicios de valor agregado.

source: When choosing a journal to publish research results, researchers should take a moment to read the journal policy regarding the transfer of copyright.
es: Al elegir una revista para publicar los resultados de la investigación, los investigadores e investigadoras deben tomarse un momento para leer la política de la revista con respecto a la transferencia de derechos de autor.

source: Many journals still require for publication that authors transfer full copyright.
es: Muchas revistas aún requieren para su publicación que los autores transfieran todos los derechos de autor.

source: This transfer of rights implies that authors must ask for permission to reuse their own work beyond what is allowed by the applicable law, unless there are some uses already granted.
es: Esta cesión de derechos implica que los autores deben solicitar permiso para reutilizar su propia obra más allá de lo permitido por la ley aplicable, salvo que existan algunos usos ya concedidos.

source: Such granted uses may include teaching purposes, sharing with colleagues, and self-archiving by researchers of their papers in repositories.
es: Dichos usos otorgados pueden incluir propósitos de enseñanza, compartir con colegas y autoarchivar artículos en repositorios.

source: Sometimes there a common policy among all the journals published by the same publishers but in general journals have their own policy, especially when they are published on behalf of a scientific society.
es: A veces existe una política común entre todas las revistas científicas publicadas por las mismas editoriales, pero en general las revistas científicas tienen su propia política, especialmente cuando se publican en nombre de una sociedad científica.

source: When looking at the self-archiving conditions we must identify two key issues: the version of the paper that can be deposited and when it can be made publicly available.
es: Al mirar las condiciones de autoarchivo, debemos identificar dos cuestiones clave: la versión del documento/artículo que se puede depositar y cuándo se puede poner a disposición del público.

source: Regarding the version, some journals allow the dissemination of the submitted version, also known as a preprint, and they allow its replacement for a reviewed version once the final paper has been published.
es: En cuanto a la versión, algunas revistas científicas permiten la difusión de la versión enviada, también conocida como preprint, y permiten su sustitución por una versión revisada una vez publicado el artículo final.

source: Due to the increase of policies requiring access to research results, most of the journals allow self-archiving of the accepted version of the paper, also known as the author manuscript or postprint.
es: Debido al aumento de políticas de acceso abierto a los resultados de las investigaciones, la mayoría de las revistas permiten el autoarchivo de la versión aceptada del artículo, también conocido como manuscrito del autor o postprint.
