Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/open_research.*.po
Languages: es

source: ## Open data
es: ## Datos de libre acceso

source: The world is witnessing a significant global transformation, facilitated by technology and digital media, and fuelled by data and information. This transformation has enormous potential to foster more transparent, accountable, efficient, responsive, and effective research.
es: El mundo está siendo testigo de una transformación global, facilitada por la tecnología y los medios digitales, y alimentada por los datos y la información. Esta transformación tiene un gran potencial para promover una investigación más transparente, responsable, eficiente, receptiva, y efectiva.

source: Only a very small proportion of the original data is published in conventional journals. Existing policies on data archiving notwithstanding, in today’s practice data are primarily stored in private files, not in secure institutional repositories, and effectively are lost to the public. This lack of data sharing is an obstacle to international research (be it academic, governmental, or commercial) for two main reasons:
es: Sólo una proporción muy pequeña de los datos originales se publica en revistas convencionales. A pesar de las políticas existentes sobre el almacenamiento de datos, en la práctica actual los datos se guardan principalmente en archivos privados en vez de en repositorios institucionales seguros, y, obviamente, son inaccesibles para el público. Esta falta de intercambio de datos es un obstáculo para la investigación internacional (ya sea académica, gubernamental o comercial) por dos razones principales:

source: 1. It is generally difficult or impossible to fully reproduce a study without the original data.
es: 1. Generalmente es difícil o imposible reproducir completamente un estudio sin los datos originales.

source: 2. The data cannot be reused or incorporated into new work by other researchers if they cannot obtain access to it.
es: 2. Los datos no pueden ser reutilizados o incorporados en nuevos estudios por otros investigadores si no pueden tener acceso a ellos.

source: Accordingly, there is an ongoing global data revolution that seeks to advance collaboration and the creation and expansion of effective, efficient research programs. Open data is crucial to meeting these objectives.
es: En consecuencia, hay una revolución mundial sobre los datos que busca avanzar en la colaboración, creación, y expansión de programas de investigación eficaces y eficientes. Los datos de libre acceso son cruciales para cumplir con estos objetivos.

source: Open data is freely available on the internet and any user is permitted to download, copy, analyse, re-process, and re-use it for any other purpose with minimal financial, legal, and technical barriers.
es: Los datos abiertos están disponibles de forma gratuita en Internet y cualquier usuario puede descargarlos, copiarlos, analizarlos, reprocesarlos, y reutilizarlos para cualquier otro propósito lidiando con una resistencia financiera, legal, y técnica mínima.

source: This represents a real shift in how research works. At the moment anyone who wishes to use data from a researcher often has to contact that researcher and make a request. "Open by default" turns this on its head and says that there should be a presumption of publication for all. If access to data is restricted, for instance due to security reasons, the justification for this should be made clear.
es: Esto representa un cambio real en cómo funciona la investigación. Por el momento, cualquier persona que desee utilizar los datos de un estudio de investigación concreto a menudo tiene que contactar con la persona responsable del estudio y hacer una solicitud. El término "de libre acceso por defecto" pone esto en relieve y sugiere que debería haber una presunción de publicación para todos. Si el acceso a los datos está restringido, por ejemplo por razones de seguridad, la justificación debe quedar clara.

source: Free access to, and subsequent use of, data is of significant value to society and the economy, and that data should, therefore, be open by default. So, how do you go about making your data open?
es: El libre acceso y el uso posterior de los datos tiene un valor significativo para la sociedad y la economía, y esos datos deberían, por lo tanto, ser de libre acceso por defecto. Entonces, ¿cómo haces para dar acceso a tus datos?

source: ### Steps to make your data open
es: ### Pasos para dar acceso libre a tus datos

source: #### Step 1: Make your data available
es: #### Paso 1: Haz que tus datos estén disponibles

source: Put your data online. It should be easily discoverable and accessible, and made available without bureaucratic or administrative barriers, which can deter people from accessing the data. Choose a location to store the data which will ensure historical copies of datasets are preserved, archived, and kept accessible as long as they retain value. Whenever possible, researchers should provide data in its original, unmodified form.
es: Pon tus datos en línea. Deben de ser fácilmente localizables y accesibles, y estar disponibles sin barreras burocráticas o administrativas, lo que podría disuadir a las personas de acceder a los datos. Elige una ubicación para almacenar los datos que garantice que las copias históricas de los conjuntos de datos se conserven, archiven y mantengan accesibles siempre que conserven su valor. Siempre que sea posible, el personal investigador debe de proporcionar los datos en su forma original y sin modificar.

source: Data should be free of charge, under [an open licence](https://fossbytes.com/open-sources-license-type/), (for example, those developed by Creative Commons) so it can be reused and remixed by other researchers. The data should be available as a whole and at no more than a reasonable reproduction cost. That is, no expensive piece of software should be required to read the file as this may obstruct researchers who wish to work with the dataset.
es: Los datos deben ser gratuitos, bajo [una licencia abierta] (https://fossbytes.com/open-sources-license-type/), (por ejemplo, aquellos desarrollados por Creative Commons) para que puedan ser reutilizados y modificados por otros investigadores. Los datos deben estar disponibles como un todo y a un coste de reproducción razonable. Es decir, no se debería necesitar un software costoso para leer el archivo, ya que esto puede ser un impedimento para el personal investigador que desea trabajar con el conjunto de datos.

source: #### Step 2: Make your data easy to understand
es: #### Paso 2: Haz que tus datos sean fáciles de entender

source: Having data available is of no use if it cannot be understood. For example, a table of numbers is useless if there are no headings which describe the contents of the rows and columns. Therefore you should ensure that open datasets include consistent core metadata, and that the data is fully described. This requires that all documentation accompanying data is written in clear, plain language, and that data users have sufficient information to understand the source, strengths, weaknesses, and analytical limitations of the data so that they can make informed decisions when using it.
es: Tener datos disponibles no sirve de nada si no se pueden entender. Por ejemplo, una tabla de números es inútil si no hay encabezados que describan el contenido de las filas y columnas. Por lo tanto, debes asegurarte de que los conjuntos de datos de libre acceso incluyan metadatos coherentes y que los datos estén completamente descritos. Esto requiere que toda la documentación que acompaña a los datos esté escrita en un lenguaje claro y sencillo, y que quienes usen los datos tengan suficiente información para comprender la fuente, las fortalezas, las debilidades y las limitaciones analíticas de los datos para que puedan tomar decisiones informadas al usarlos.

source: #### Step 3: Make your data easy to use
es: #### Paso 3: Haz que tus datos sean fáciles de usar

source: The data should be made available in a modifiable, machine-readable format so that it can be effectively used and manipulated.
es: Los datos deben estar disponibles en un formato editable y legible por una máquina para que puedan usarse y manipularse de manera efectiva.

source: It is also important to think about the file formats that information is provided in. Data should be presented in structured and standardized formats to support interoperability, traceability, and effective reuse. In many cases, this will include providing data in multiple, standardized formats, so that it can be processed by computers and used by people.
es: También es importante pensar en los formatos en los que se proporciona la información. Los datos deben presentarse en formatos estructurados y estandarizados para permitir la interoperabilidad, la trazabilidad y la reutilización efectiva. En muchos casos, esto incluirá proporcionar los datos en múltiples formatos estandarizados, para que puedan ser procesados por ordenadores y utilizados por personas.

source: #### Step 4: Make your data citeable
es: #### Paso 4: Haz tus datos citables

source: Data should be considered a legitimate, citable product of research. Making data citeable (and citing data yourself) facilitates the giving of scholarly credit; in scholarly literature, whenever and wherever a claim relies upon data, the corresponding data should be cited. Data citations facilitate identification of, access to, and verification of the specific data that support a claim, making it possible to reproduce the underlying analysis. You should ensure that anyone who wishes to cite a dataset that you host has access to a persistent identifier in order to do so.
es: Los datos deben considerarse un producto de investigación legítimo y citable. Hacer que los datos se puedan citar (y citar tú mismo datos) facilita darle crédito académico; en la literatura académica, cuando una afirmación se basa en datos, los datos correspondientes deben ser citados. Las citas de datos facilitan la identificación, el acceso y la verificación de los datos específicos que respaldan una afirmación, lo que permite reproducir el análisis. Debes asegurarte de que cualquier persona que desee citar un conjunto de datos que tú provees tenga acceso a un identificador persistente para hacerlo.

source: A data citation should include a persistent method for identification that is unique, and widely understandable by a community. There are several types of persistent identifier that could be used to identify datasets: examples include Handles, Archival Resource Keys (ARKs) and Persistent URLs (PURLs), all of which can be resolved to an Internet location. The scheme that is gaining most traction is the Digital Object Identifier (DOI).
es: Una referencia de datos debe incluir un método persistente para la identificación que sea único y ampliamente comprensible por una comunidad. Existen varios tipos de identificadores persistentes que podrían usarse para identificar conjuntos de datos: los ejemplos incluyen Handles, Claves de recursos de archivo (ARK) y URL persistentes (PURL), todos los cuales pueden resolverse en una ubicación de Internet. El esquema que está ganando más fuerza es el Identificador de Objeto Digital (DOI).

source: The DOI System is an identifier scheme administered by the International DOI Foundation. The task of managing DOI registers is delegated to registration agencies (for a list, see [here](http://www.doi.org/registration_agencies.html)) that each specialise in a type of resource. For research datasets, the registration agency is the [DataCite Consortium](https://www.datacite.org/). Among the services it provides are human and machine interfaces for simple end-user administration of DOI registrations. DataCite also collects metadata about each dataset it registers so they can be more easily understood and identified. Any repository wishing to register DOIs needs to obtain a username and password from DataCite to gain access to the registration service. While best practice has yet to emerge on some matters, certain conventions are already becoming established.
es: El Sistema DOI es un esquema de identificación administrado por la Fundación Internacional DOI. La tarea de administrar los registros de DOI se delega a las agencias de registro (para obtener una lista, consulte [aquí] (http://www.doi.org/registration_agencies.html)) que se especializan en un tipo de recurso. Para los conjuntos de datos de investigación, la agencia de registro es el [Consorcio DataCite] (https://www.datacite.org/). Entre los servicios que ofrece se encuentran las interfaces persona-computadora para la administración simple de registros DOI por parte de la persona usuaria final. DataCite también recopila metadatos sobre cada conjunto de datos que registra para que puedan entenderse e identificarse más fácilmente. Cualquier repositorio que desee registrar un DOI debe registrarse en DataCite para obtener acceso al servicio de registro. Si bien las mejores prácticas aún no han surgido en algunos asuntos, ciertas convenciones ya se están estableciendo.

source: In particular, when organisations register a DOI for a resource, they should not introduce semantic elements into the suffix, especially not metadata that might change over time (for example, publisher, archive, owner). Assign identifiers to static datasets only when no further changes or corrections are expected (such as after quality control checks are complete). As DOIs are used to cite data as evidence, the resource to which a DOI points should also remain unchanged, with any new version receiving a new DOI.
es: En particular, cuando las organizaciones registran un DOI para un recurso, no deben introducir elementos semánticos en el sufijo, especialmente ningún metadato que pueda cambiar con el tiempo (por ejemplo, en relación a la edición o propiedad del recurso). Asigna identificadores a los conjuntos de datos estáticos sólo cuando no se esperan más cambios o correcciones (como después de que se completen los controles de calidad). Como los DOI se utilizan para citar datos como evidencia, el recurso al que apunta un DOI también debe permanecer sin cambios, y cualquier versión nueva recibirá un nuevo DOI.

source: Furthermore, whichever identifier scheme you pick make sure it allows the identifier to be resolved to a URL. This URL should belong to a landing page that contains descriptive information about the dataset, as well as links or instructions for accessing it. You should also ensure that datasets are made citable and identifiable at an appropriate level of granularity. For example, it would be no use citing CERN's entire data repository as someone attempting to reproduce your work would not be able to find the data used in a specific piece of work without considerable difficulty. Where possible you should be able to cite the data used, and only the data used.
es: Además, cualquiera que sea el esquema de identificador que elijas, asegúrate de que permite que el identificador se resuelva en una URL. Esta URL debe pertenecer a una página de destino que contenga información descriptiva sobre el conjunto de datos, así como enlaces o instrucciones para acceder a él. También debes asegurarte de que los conjuntos de datos se citan e identifican con un nivel de granularidad apropiado. Por ejemplo, sería inútil citar todo el repositorio de datos del CERN, ya que alguien que intente reproducir su trabajo no podrá encontrar los datos utilizados en un trabajo específico sin una dificultad considerable. Siempre que sea posible, deberías poder citar solamente los datos utilizados.

source: ### Barriers to data sharing
es: ### Barreras para compartir datos

source: Sometimes it may not be possible to make data publicly available in its entirety or even in part. There are two main reasons this may be the case:
es: A veces puede no ser posible hacer que los datos estén disponibles públicamente en su totalidad o incluso parcialmente. Hay dos razones principales por las que este puede ser el caso:

source: #### Privacy
es: #### Privacidad

source: Many fields of research involve working with sensitive personal data, medical research being the most obvious example.
es: Muchos campos de investigación implican trabajar con datos personales sensibles, siendo la investigación médica el ejemplo más obvio.

source: Individuals must be protected from (re)identification via their personal data used for research. Anonymisation of the data may be sufficient in some cases, but ensuring that reidentification is not possible is becoming increasingly difficult due to technical progress, growing computational power and – ironically – more open data. For example, reidentification may be possible via data-mining of accessible data and so-called quasi-identifiers, a set of (common) properties that are – in their combination – so specific that they can be used to identify individuals.
es: Las personas deben estar protegidas de la (re)identificación a través de sus datos personales utilizados para la investigación. La anonimización de los datos puede ser suficiente en algunos casos, pero garantizar que la reidentificación no sea posible se está volviendo cada vez más difícil debido al progreso técnico, el creciente poder computacional e -irónicamente- a la creciente apertura de los datos. Por ejemplo, la reidentificación puede ser posible a través de la extracción de datos accesibles y los llamados cuasi-identificadores, un conjunto de propiedades (comunes) que son, en su combinación, tan específicas que pueden usarse para identificar individuos.

source: Preserving privacy may still be possible if partial or generalised datasets are provided.
es: Aún es posible preservar la privacidad si se proporcionan conjuntos de datos parciales o generalizados.

source: For example, providing age bands instead of birth date or only the first two digits of postal codes.
es: Por ejemplo, proporcionar franjas de edad en lugar de la fecha de nacimiento o sólo los dos primeros dígitos de los códigos postales.

source: It may also be possible to provide the data in such a format that researchers can query it whist keeping the data itself closed, for example, a user may be able to send a query to retrieve the mean of a dataset, but not be able to access any of the individual datapoints.
es: También es posible proporcionar los datos en un formato tal que el personal investigador pueda consultarlos mientras mantiene los datos cerrados, por ejemplo, una persona puede enviar una consulta para recuperar la media de un conjunto de datos, pero no puede acceder a cualquiera de los puntos de datos individuales.

source: #### National and commercially sensitive data
es: #### Datos confidenciales nacionales y comerciales

source: In many cases companies are understandably unwilling to publish much of their data. The reasoning goes that if commercially sensitive information is disclosed, it will damage the company’s commercial interests and undermine competitiveness. This is based on the thinking that in competitive markets, innovation will only occur with some protection of information: if a company spends time and money developing something new, the details of which are then made public, then its competitors can easily copy it without having to invest the same resources. The result is that no-one would innovate in the first place. Similarly, governments are often unwilling to publish data that relates to issues such as national security due to public safety concerns.
es: En muchos casos, las empresas no están dispuestas a publicar gran parte de sus datos. El razonamiento es que si se divulga información comercialmente sensible, dañará los intereses comerciales de la empresa y socavará su competitividad. Esto se basa en el pensamiento de que en los mercados competitivos, la innovación sólo ocurrirá con cierta protección de la información: si una empresa gasta tiempo y dinero en desarrollar algo nuevo, cuyos detalles se hacen públicos, entonces sus competidores pueden copiarlo fácilmente sin tener que invertir los mismos recursos. El resultado es que nadie innovaría en primer lugar. Del mismo modo, los gobiernos a menudo no están dispuestos a publicar datos relacionados con cuestiones como la seguridad nacional debido a preocupaciones de seguridad pública.

source: In such cases it may not be possible to make data open, or it may only be only possible to share partial/obscured datasets as outlined in the section above on privacy.
es: En tales casos, puede que no sea posible hacer que los datos se abran, o sólo puede ser posible compartir conjuntos de datos parciales/ocultos como se describe en la sección anterior sobre privacidad.

source: ## Open source software
es: ## Software de código abierto

source: ### What is open source software?
es: ### ¿Qué es el software de código abierto?

source: When a project is open source anybody can view, use, modify, and distribute the project for any purpose.
es: Cuando un proyecto es de código abierto, cualquiera puede ver, usar, modificar y distribuir el proyecto para cualquier propósito.

source: These permissions are enforced through an open source licence.
es: Estos permisos se aplican a través de una licencia de código abierto.

source: Open source is powerful because it lowers the barriers to adoption, allowing ideas to spread quickly.
es: El código abierto es poderoso porque reduce las barreras para la adopción, permitiendo que las ideas se difundan rápidamente.

source: In its most basic form, open sourcing your software simply means putting your code online where it can be viewed and reused by others.
es: En su forma más básica, hacer que el código de tu software sea código abierto simplemente significa poner tu código en línea donde otras personas puedan verlo y reutilizarlo.

source: Many of the most widely used research software is open source.
es: Muchos de los programas de investigación más utilizados son de código abierto.

source: Perhaps the paradigmatic example is the scikit-learn Python package for machine learning (Pedregosa et al., 2011), which, in the space of just over five years, has attracted over 500 unique contributors, 20,000 individual code contributions, and 2,500 article citations.
es: Quizás el ejemplo paradigmático es el paquete de Python scikit-learn para el aprendizaje automático (Pedregosa et al., 2011), que, en el espacio de poco más de cinco años, ha atraído a más de 500 contribuidores, 20,000 contribuciones de códigos individuales y 2,500 citas de artículos .

source: Producing a comparable package using a traditional closed-source approach would likely not be feasible, and would, at the very least, have required a budget of tens of millions of dollars.
es: La producción de un paquete comparable utilizando un enfoque tradicional de código cerrado probablemente no sería factible y, como mínimo, habría requerido un presupuesto de decenas de millones de dólares.

source: While scikit-learn is clearly an outlier, hundreds of other open source packages that support much more domain-specific needs depend in a similar fashion on unsolicited community contributions, for example, the NIPY (neuroimaging in Python) group of projects in neuroimaging (Gorgolewski et al., 2016).
es: Si bien scikit-learn es claramente un caso atípico, cientos de otros paquetes de código abierto que admiten necesidades mucho más específicas del dominio dependen de manera similar de contribuciones comunitarias no solicitadas, por ejemplo, el grupo de proyectos NIPY (neuroimagen en Python) en neuroimagen (Gorgolewski et al., 2016).
