Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/open_research.*.po
Languages: es

source: Open Educational Resources (OERs) offer opportunities for systemic change in teaching and learning content through engaging educators in new participatory processes and effective technologies for engaging with learning.
es: Los Recursos Educativos Abiertos (REA) ofrecen oportunidades para un cambio sistémico en el contenido de la enseñanza y el aprendizaje mediante la participación de los educadores y las educadoras en nuevos procesos participativos y tecnologías eficaces para un aprendizaje más atractivo y estimulante.

source: ### Equity, diversity, inclusion
es: ### Equidad, diversidad, inclusión

source: Open scholarship means open to *everyone* without discrimination based on factors such as race, gender, sexual orientation, or any number of other factors.
es: Una academia de acceso abierto significa abierta a *todas las personas* sin discriminación basada en factores como la raza, el género, la orientación sexual o cualquier otro número de factores.

source: As a community we should undertake to ensure equitable opportunities for all.
es: Como comunidad debemos comprometernos a asegurar oportunidades equitativas para todas las personas.

source: We can go about that by deliberately fostering welcoming, inclusive cultures within out communities.
es: Podemos hacerlo fomentando deliberadamente dentro de nuestras comunidades culturas más acogedoras e inclusivas.

source: For example, reasonable accommodations should be made wherever possible to include community members with disabilities to enable them to participate fully, and this can be as simple as choosing colourblind-safe colour schemes when making graphs.
es: Por ejemplo, siempre que sea posible deben hacerse ajustes razonables para incluir a los miembros de la comunidad con discapacidades a fin de que puedan participar plenamente, y esto puede ser tan sencillo como elegir esquemas de colores seguros para los daltónicos al hacer los gráficos.

source: ### Citizen science
es: ### Ciencia ciudadana

source: Citizen science is the involvement of the public in scientific research – whether community-driven research or global investigations, the Oxford English Dictionary recently defined it as: "scientific work undertaken by members of the general public, often in collaboration with or under the direction of professional scientists and scientific institutions".
es: La ciencia ciudadana es la participación de la sociedad civil en la investigación científica - ya sea la investigación impulsada por la comunidad o las investigaciones globales, el Diccionario de Inglés de Oxford recientemente lo definió como: "la labor científica realizada por miembros del público en general, a menudo en colaboración con científicos y científicas profesionales e instituciones científicas o bajo su dirección".

source: Citizen science offers the power of science to everyone, and the power of everyone to science.
es: La ciencia ciudadana ofrece el poder de la ciencia a todas las personas, y el poder de todas las personas a la ciencia.

source: By allowing members of the public to contribute to scientific research, citizen science helps engage and invest the wider world in science.
es: Al permitir que los miembros del público contribuyan a la investigación científica, la ciencia ciudadana ayuda a comprometer e involucrar al resto de la sociedad global en la ciencia.

source: It also benefits researchers by offering manpower that simply would not be accessible otherwise.
es: También beneficia a quienes investigan al ofrecerles mano de obra que de otra manera no sería accesible.

source: Examples of this include [finding](https://citizensciencegames.com/games/eterna/) ways of folding molecules, and [classifying](https://www.zooniverse.org/) different types of galaxies.
es: Ejemplos de esto incluyen [encontrar](https://citizensciencegames.com/games/eterna/) formas de plegar las moléculas, y [clasificar](https://www.zooniverse.org/) diferentes tipos de galaxias.

source: ### Patient and Public Involvement
es: ### Implicación del paciente y del público

source: Whilst citizen science encompasses one way of contributing to scientific research, Patient and Public Involvement (PPI) is a far more specialised form of citizen science which is particularly useful when doing research on health and/or social issues.
es: Mientras que la ciencia ciudadana abarca una forma de contribuir a la investigación científica, la Implicación del Paciente y el Público (IPP) es una forma mucho más especializada de ciencia ciudadana que es particularmente útil cuando se hace investigación sobre temas de salud y/o sociales.

source: PPI is *not*:
es: IPP *no* es:

source: - Participation: Recruitment of participants (such as for a clinical trial or survey) to contribute data to a project.
es: - Participación: Reclutamiento de participantes (por ejemplo, para un ensayo clínico o una encuesta) para aportar datos a un proyecto.

source: - Engagement: Dissemination, such as presenting at patient interest groups or writing a blog post.
es: - Divulgación: Difusión, tal como presentarse en grupos de interés de pacientes o escribir una entrada en un blog.

source: PPI *is*:
es: IPP *es*:

source: - Involvement: patients and members of the public contribute at *all* stages of the research cycle.
es: - Participación: los pacientes y el público contribuyen en *todas* las etapas del ciclo de investigación.

source: When incorporating PPI into research, researchers work *with* volunteers, rather than doing work *about* them.
es: Al incorporar la IPP en la investigación, los investigadores trabajan *con* voluntarios, en lugar de hacer el trabajo *sobre* ellos.

source: PPI volunteers are usually patients or members of the public with a particular interest in some area of research which means that the topic is often very personal, and being involved in the research cycle can be an empowering experience.
es: Los voluntarios IPP suelen ser pacientes o miembros del público con un interés particular en alguna área de investigación, lo que significa que el tema suele ser muy personal, y la participación en el ciclo de investigación puede ser una experiencia enriquecedora y de empoderamiento.

source: For the researcher, PPI often generates unique and invaluable insights from the volunteers' own personal expertise which cannot always be predicted by the researchers themselves.
es: Para la persona que investiga, la IPP a menudo genera conocimientos únicos e invaluables a partir de la experiencia personal de los voluntarios, que no siempre pueden ser pronosticados por los propios investigadores e investigadoras.

source: It is a good idea to consider PPI very early in a project, ideally before any grant applications or submissions for ethical approval have been written.
es: Es una buena idea considerar la IPP muy pronto en un proyecto, idealmente antes de que se hayan redactado las solicitudes de subvención o las presentaciones para la aprobación ética.

source: PPI volunteers can help researchers in many ways, such as the following:
es: Los voluntarios de la IPP pueden ayudar a quienes investigan de muchas maneras, tales como las siguientes:

source: 1. Generate or shape research questions.
es: 1. Generan o dan forma a las preguntas de la investigación.

source: 2. Contribute to, or review, study design.
es: 2. Contribuyen al o participan en la revisión del diseño del estudio.

source: 3. Help with grant applications or submissions to research ethics committees (particularly the lay summary).
es: 3. Ayudan con las solicitudes de subvención o las presentaciones a los comités de ética (en particular el resumen para el público general).

source: 4. Collect data.
es: 4. Recopilan datos.

source: 5. Analyse data.
es: 5. Analizan datos.

source: 6. Contribute to the manuscript and be listed as a co-author.
es: 6. Contribuyen al manuscrito y figuran como coautores.

source: 7. Disseminate findings in plain English.
es: 7. Difunden los hallazgos en un lenguaje sencillo.

source: One of the biggest barriers to PPI is not knowing how to get started.
es: Una de las mayores barreras para la IPP es no saber cómo empezar.

source: The UK National Institute for Health Research have their own site, [INVOLVE](https://www.invo.org.uk/), to help familiarise yourself with the foundations of PPI.
es: El Instituto Nacional de Investigación de la Salud del Reino Unido tiene su propia página web, [INVOLVE](https://www.invo.org.uk/), para ayudar a familiarizarse con los fundamentos de la IPP.

source: Additionally, charities related to your specific research field may be able to facilitate or support PPI; for example [Cancer Research UK](https://www.cancerresearchuk.org/funding-for-researchers/patient-involvement-toolkit-for-researchers) and [Parkinson's UK](https://www.parkinsons.org.uk/research/patient-and-public-involvement-ppi) have formal guides in place that provide a comprehensive overview of PPI.
es: Adicionalmente, las organizaciones benéficas relacionadas con tu campo de investigación específico pueden facilitar o apoyar la IPP; por ejemplo, [Cancer Research UK](https://www.cancerresearchuk.org/funding-for-researchers/patient-involvement-toolkit-for-researchers) y [Parkinson's UK](https://www.parkinsons.org.uk/research/patient-and-public-involvement-ppi) tienen guías formales que proporcionan una visión general completa de la IPP.

source: ## Checklists
es: ## Listas de control (también conocidas como checklists)

source: ### Open data
es: ### Datos abiertos

source: - [ ] Ensure your data is in a simple, standard format or formats which is machine and human readable.
es: - [ ] Asegúrate de que tus datos estén en un formato simple y estándar o formatos que sean legibles para las máquinas y los humanos.

source: - [ ] Check, reformat or create metadata to clearly describe what the data is, how it was collected, and any associated strengths/weaknesses to someone that finds it.
es: - [ ] Revisa, reformatea o crea metadatos para describir claramente qué son los datos, cómo se han recogido, y cualquier fortaleza/debilidad asociada.

source: - [ ] Identify a relevant, easily discoverable repository or repositories to host your data, and upload it there.
es: - [ ] Identifica un repositorio o repositorios relevantes y fáciles de descubrir para albergar tus datos, y cargarlos allí.

source: - [ ] Assign your data a persistent identifier such as a DOI.
es: - [ ] Asigna a tus datos un identificador único y persistente como un DOI.

source: ### Open source software
es: ### Software de código abierto

source: - [ ] Put your code in a freely accessible repository.
es: - [ ] Pon tu código en un repositorio de libre acceso.

source: - [ ] Include a licence granting others the right to use, copy and modify your work. You can use [this](https://choosealicense.com/) website to help you pick the most appropriate licence for your project.
es: - [ ] Incluye una licencia que otorgue a otros el derecho a usar, copiar y modificar tu trabajo. Puedes utilizar [este](https://choosealicense.com/) sitio web para ayudarte a elegir la licencia más apropiada para tu proyecto.

source: - [ ] Include a readme file containing useful information about a project such as what it is, how to use/install it and how to run any tests.
es: - [ ] Incluye un archivo "readme" con información útil sobre un proyecto, como qué es, cómo usarlo/instalarlo y cómo realizar cualquier prueba.

source: - [ ] If you want others to collaborate on the project include contribution guidelines.
es: - [ ] Si deseas que otros colaboren en el proyecto, incluye una guía de contribución.

source: ### Open hardware
es: ### Hardware abierto

source: - [ ] Use open hardware where practical.
es: - [ ] Utiliza hardware abierto siempre que sea posible.

source: - [ ] Make detailed documentation and designs for any hardware you develop openly available.
es: - [ ] Pon a disposición del público la documentación y los diseños detallados de cualquier hardware que desarrolle.

source: - [ ] Include a readme file containing useful information about a project (for example, what it is and the materials used).
es: - [ ] Incluye un archivo "README" con información útil sobre el proyecto (por ejemplo, qué es y los materiales utilizados).

source: ### Open access
es: ### Acceso abierto

source: - [ ] Publish your research in an open access journal.
es: - [ ] Publica tu investigación en una revista de acceso abierto.

source: - [ ] Store a copy and/or preprint of your work in a freely accessible public repository.
es: - [ ] Guarda una copia y/o "preprint" de tu trabajo en un repositorio público de libre acceso.

source: ### Open notebooks
es: ### Cuadernos abiertos

source: - [ ] Keep notes in an Electronic Lab Notebook.
es: - [ ] Mantén tus notas en un Cuaderno de Laboratorio Electrónico.

source: - [ ] Make your notebooks publicly accessible online.
es: - [ ] Haz que sus cuadernos sean accesibles públicamente en línea.

source: ## What to learn next
es: ## ¿Qué aprender a continuación?

source: If you haven't had a chance already, take a look at the chapter on [version control](/version_control/version_control), particularly the sections on GitHub in the latter half.
es: Si aún no has tenido la oportunidad, dale un vistazo al capítulo sobre [control de versiones](/version_control/version_control), en particular las secciones sobre GitHub en la última mitad.

source: ## Further reading
es: ## Lecturas complementarias

source: [This](http://book.openingscience.org.s3-website-eu-west-1.amazonaws.com/) book on open science has a great deal of interesting information.
es: [Este](http://book.openingscience.org.s3-website-eu-west-1.amazonaws.com/) libro sobre ciencia abierta tiene una gran cantidad de información interesante.

source: For information specific to open source software [this](https://opensource.guide/) is a good place to look.
es: Para obtener información específica sobre el software de código abierto, un buen lugar es [este](https://opensource.guide/).

source: For more information on DOIs and citing resources look [here](http://www.doi.org/index.html).
es: Para más información sobre los DOI y la citación de recursos, consulta [aquí](http://www.doi.org/index.html).

source: If you want to take a look at an active open source project this textbook *is* one.
es: Si quieres dar un vistazo a un proyecto activo de código abierto, este libro de texto *es* uno.

source: The source can be found on GitHub [here](https://github.com/alan-turing-institute/the-turing-way) and for further details related to this project you can take a look at the project [website](https://www.turing.ac.uk/research/research-projects/turing-way-handbook-reproducible-data-science).
es: La fuente se puede encontrar en GitHub [aquí](https://github.com/alan-turing-institute/the-turing-way) y para más detalles relacionados con este proyecto puedes visitar el [sitio web](https://www.turing.ac.uk/research/research-projects/turing-way-handbook-reproducible-data-science).

source: ## Definitions/glossary
es: ## Definiciones/glosario

source: - **Citizen science:** The involvement of members of the public in scientific research.
es: - **Ciencia ciudadana:** La participación de los ciudadanos/miembros del público general en la investigación científica.

source: - **Contributing guidelines:** Guidelines outlining how a person should go about contributing to an open source project.
es: - **Directrices de contribución:** Directrices/guías que describen cómo una persona debe contribuir a un proyecto de código abierto.

source: - **Contributor:** Someone that has contributed something (not necessarily code) to an open source project.
es: - **Colaborador:** Alguien que ha aportado algo (no necesariamente código) a un proyecto de código abierto.

source: - **DOI:** A widely used type of persistent identifier.
es: - **DOI:** Un tipo de identificador persistente muy utilizado.

source: - **GitHub:** An online code hosting and version control service. It has a great many features to aid collaboration between users, and hosts a large number of open source projects.
es: - **GitHub:** Un servicio de alojamiento de código y control de versiones en línea. Dispone de un gran número de funciones para ayudar a la colaboración entre usuarios y alberga un gran número de proyectos de código abierto.

source: - **Maintainer:** Contributors who are responsible for driving the vision and managing the organizational aspects of the project. They may also be authors and/or owners of the project.
es: - **Mantenedor:** Colaboradores que son responsables de impulsar la visión y gestionar los aspectos organizativos del proyecto. También pueden ser autores y/o propietarios del proyecto.

source: - **Metadata:** Data used to describe other data. For example (35, 33, 27, 30, 33) is data but the units (miles per hour) and the fact these are the speeds of cars on a certain stretch of road is metadata.
es: - **Metadatos:** Datos utilizados para describir otros datos. Por ejemplo, (35, 33, 27, 30, 33) son datos, pero las unidades (millas por hora) y el hecho de que son las velocidades de los coches en un determinado tramo de carretera son metadatos.

source: - **Open access publishing (gratis):** The practice of making research publications available to anyone to read without charge.
es: - **Publicación de acceso abierto (gratuita):** La práctica de poner las publicaciones de investigación a disposición de cualquier persona para que las lea gratuitamente.

source: - **Open access publishing (libre):** Libre open access is gratis, meaning the research is available free of charge, but it goes further by granting users the right to copy, reuse, and remix the publication.
es: - **Publicación en acceso abierto (libre):** El acceso abierto libre es gratuito, lo que significa que la investigación está disponible de forma gratuita, pero va más allá al conceder a los usuarios el derecho a copiar, reutilizar y modificar la publicación.

source: - **Open data:** Data that is freely available online for reuse without bureaucratic or administrative barriers.
es: - **Datos abiertos:** Datos que están disponibles libremente en línea para su reutilización sin barreras burocráticas o administrativas.

source: - **Open educational resource:** Educational materials available online for anybody to use, remix and distribute.
es: - **Recurso educativo abierto:** Material educativo disponible en línea para que cualquiera pueda utilizarlo, modificarlo y distribuirlo.

source: - **Open notebook:** The practise of making research notebooks openly available.
es: - **Cuaderno de investigación abierto:** La práctica de dar acceso abierto a los cuadernos de investigación.

source: - **Open source software:** Software which is available online for anybody to view, use, modify, and distribute.
es: - **Software de código abierto:** Software que está disponible en línea para que cualquiera pueda verlo, utilizarlo, modificarlo y distribuirlo.

source: - **Open source hardware:** Hardware with documentation, designs, materials used, and other relevant information freely accessible and available
es: - **Hardware de código abierto:** Hardware con documentación, diseños, materiales utilizados y cualquier otra información relevante de libre acceso.

source: - **Persistent identifier:** A long-lived method for identifying a resource that is unique, and widely understandable by a community.
es: - **Identificador persistente:** Método de larga duración para identificar un recurso que es único y ampliamente comprensible por una comunidad.

source: - **Readme:** A file which contains useful information about a project such as what it is, how to use/install it, how to test it, and how to contribute to it.
es: - **"README":** Un archivo que contiene información útil sobre un proyecto, por ejemplo, qué es, cómo usarlo/instalarlo, cómo probarlo y cómo contribuir a él.

source: - **Repository:** A long-lived place on the internet where resources (be they data, software, publications or anything else) can be stored and accessed.
es: - **Repositorio:** Lugar de larga duración en Internet donde se pueden almacenar y acceder a recursos (ya sean datos, software, publicaciones o cualquier otra cosa).

source: - **Self-archive:** To place your research output in a repository.
es: - **Autoarchivar:** Colocar los resultados de tu investigación en un repositorio.

source: ## Bibliography
es: ## Bibliografía

source: - [3.](https://www.fosteropenscience.eu/content/introduction-open-science-funders-introductory) **Attribution + Noncommercial - CC-BY-NC**
es: - [3.](https://www.fosteropenscience.eu/content/introduction-open-science-funders-introductory) **Atribución + No comercial - CC-BY-NC**

source: - [4.](https://link.springer.com/chapter/10.1007/978-3-319-00026-8_2) **Creative Commons Attribution Noncommercial Licence**
es: - [4.](https://link.springer.com/chapter/10.1007/978-3-319-00026-8_2) **Licencia de Atribución no comercial de Creative Commons**

source: - [5.](https://elifesciences.org/articles/16800) **Attribution 4.0 International (CC BY 4.0)**
es: - [5.](https://elifesciences.org/articles/16800) **Atribución International 4.0 (CC BY 4.0)**

source: - [6.](https://www.fosteropenscience.eu/content/introduction-open-science-funders-introductory) **Attribution + Noncommercial - CC-BY-NC**
es: - [6.](https://www.fosteropenscience.eu/content/introduction-open-science-funders-introductory) **Atribución + No comercial - CC-BY-NC**

source: - [7.](http://book.openingscience.org.s3-website-eu-west-1.amazonaws.com/vision/open_research_data.html) **Creative Commons Attribution-NonCommercical**
es: - [7.](http://book.openingscience.org.s3-website-eu-west-1.amazonaws.com/vision/open_research_data.html) **Atribución- No comercial Creative Commons**

source: ## Footnotes
es: ## Nota al pie
