Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/open_research.*.po
Languages: es

source: 1. References by discipline: Agricultural studies (Kousha and Abdoli, 2010); Physics/astronomy (Gentil-Beccot et al., 2010; Harnad and Brody, 2004; Metcalfe, 2006); Medicine (Sahu et al., 2005; Xu et al., 2011); Computer science (Lawrence, 2001); Sociology/social sciences (Hajjem et al., 2006; Norris et al., 2008; Xu et al., 2011); Psychology (Hajjem et al., 2006); Political science (Hajjem et al., 2006; Antelman, 2004; Atchison and Bull, 2015); Management (Hajjem et al., 2006); Law (Donovan et al., 2015; Hajjem et al., 2006); Economics (Hajjem et al., 2006; McCabe and Snyder, 2015; Norris et al., 2008; Wohlrabe, 2014); Mathematics (Antelman, 2004; Davis and Fromerth, 2007; Norris et al., 2008); Health (Hajjem et al., 2006); Engineering (Antelman, 2004; Koler-Povh et al., 2014); Philosophy (Antelman, 2004); Education (Hajjem et al., 2006; Zawacki-Richter et al., 2010); Business (Hajjem et al., 2006; McCabe and Snyder, 2015); Communication studies (Zhang, 2006); Ecology (McCabe and Snyder, 2014; Norris et al., 2008); Biology (Frandsen, 2009b; Hajjem et al., 2006; McCabe and Snyder, 2014).
es: 1. Referencias por disciplina: Estudios de agricultura (Kousha y Abdoli, 2010); Física/Astronomía (Gentil-Beccot et al., 2010; Harnad y Brody, 2004; Metcalfe, 2006); Medicina (Sahu et al., 2005; Xu et al., 2011); Informática (Lawrence, 2001); Sociología/Ciencias Sociales (Hajjem et al., 2006; Norris et al., 2008; Xu et al., 2011); Psicología (Hajjem et al., 2006); Ciencias políticas (Hajjem et al., 2006; Antelman, 2004; Atchison y Bull, 2015); Gestión (Hajjem et al., 2006); Derecho (Donovan et al., 2015; Hajjem et al., 2006); Economía (Hajjem et al, 2006; McCabe y Snyder, 2015; Norris et al., 2008; Wohlrabe, 2014); Matemáticas (Antelman, 2004; Davis y Fromerth, 2007; Norris et al., 2008); Salud (Hajjem et al., 2006); Ingeniería (Antelman, 2004; Koler-Povh et al., 2014); Filosofía (Antelman, 2004); Educación (Hajjem et al, 2006; Zawacki-Richter et al., 2010); Negocios (Hajjem et al., 2006; McCabe y Snyder, 2015); Estudios de comunicación (Zhang, 2006); Ecología (McCabe y Snyder, 2014; Norris et al., 2008); Biología (Frandsen, 2009b; Hajjem et al., 2006; McCabe y Snyder, 2014).

source: # Open research
es: # Investigación abierta

source: ## Prerequisites / recommended skill level
es: ## Pre-requisitos / nivel de conocimiento recomendado

source: | Prerequisite | Importance | Notes |
es: | Pre-requisitos | Importancia | Notas |

source: | [Experience with version control](/version_control/version_control) | Helpful | Experience with GitHub is particularly useful |
es: | [Experiencia con el control de versiones](/version_control/version_control) | Útil | La experiencia con GitHub es particularmente útil |

source: Recommended skill level: low.
es: Nivel de habilidad recomendado: bajo.

source: 1. [Summary](#summary)
es: 1. [Resumen] (#resumen)

source: 2. [How this will help you/ why this is useful](#how-this-will-help-you--why-this-is-useful)
es: 2. [Cómo te ayudará esto/por qué es útil](#how-this-will-help-you--why-this-is-useful)

source: 3. [Open data](/open_research/01/opendata#open-data)
es: 3. [Datos abiertos](/open_research/01/opendata#open-data)

source: 1. [Steps to make your data open](/open_research/01/opendata#steps-to-make-your-data-open)
es: 1. [Pasos para que tus datos sean abiertos](/open_research/01/opendata#steps-to-make-your-data-open)

source: 1. [Step 1: Make your data available](/open_research/01/opendata#step-1-make-your-data-available)
es: 1. [Paso 1: Haz que tus datos estén disponibles](/open_research/01/opendata#step-1-make-your-data-available)

source: 2. [Step 2: Make your data easy to understand](/open_research/01/opendata#step-2-make-your-data-easy-to-understand)
es: 2. [Paso 2: Haz que tus datos sean fáciles de entender](/open_research/01/opendata#step-2-make-your-data-easy-to-understand)

source: 3. [Step 3: Make your data easy to use](/open_research/01/opendata#step-3-make-your-data-easy-to-use)
es: 3. [Paso 3: Facilita el uso de los datos](/open_research/01/opendata#step-3-make-your-data-easy-to-use)

source: 4. [Step 4: Make your data citeable](/open_research/01/opendata#step-4-make-your-data-citeable)
es: 4. [Paso 4: Haz que tus datos sean citables](/open_research/01/opendata#step-4-make-your-data-citeable)

source: 2. [Barriers to data sharing](/open_research/01/opendata#barriers-to-data-sharing)
es: 2. [Barreras para el intercambio de datos](/open_research/01/opendata#barriers-to-data-sharing)

source: 1. [Privacy](/open_research/01/opendata#privacy)
es: 1. [Privacidad](/open_research/01/opendata#privacy)

source: 2. [National and commercially sensitive data](/open_research/01/opendata#national-and-commercially-sensitive-data)
es: 2. [Datos nacionales y comercialmente sensibles(/open_research/01/opendata#national-and-commercially-sensitive-data)

source: 4. [Open source software](/open_research/02/opensourcesoftware#open-source-software)
es: 4. [Software de código abierto](/open_research/02/opensourcesoftware#open-source-software)

source: 1. [What is open source software?](/open_research/02/opensourcesoftware.html#what-is-open-source-software)
es: 1. [¿Qué es el software de código abierto?](/open_research/02/opensourcesoftware.html#what-is-open-source-software)

source: 2. [How running and contributing to open source software projects benefits you](/open_research/02/opensourcesoftware.html#how-running-and-contributing-to-open-source-software-projects-benefits-you)
es: 2. [Cómo te beneficia dirigir y contribuir a proyectos de software de código abierto](/open_research/02/opensourcesoftware.html#how-running-and-contributing-to-open-source-software-projects-benefits-you)

source: 1. [Making your own work open source](/open_research/02/opensourcesoftware.html#making-your-own-work-open-source)
es: 1. [Haz que tu propio trabajo sea de código abierto](/open_research/02/opensourcesoftware.html#making-your-own-work-open-source)

source: 2. [Contributing to others' open source software projects](/open_research/02/opensourcesoftware.html#contributing-to-others-open-source-software-projects)
es: 2. [Contribuye a los proyectos de software de código abierto de otros](/open_research/02/opensourcesoftware.html#contributing-to-others-open-source-software-projects)

source: 3. [How open source software benefits research](/open_research/02/opensourcesoftware.html#how-open-source-software-benefits-research)
es: 3. [Cómo beneficia el software de código abierto a la investigación](/open_research/02/opensourcesoftware.html#how-open-source-software-benefits-research)

source: 4. [How to run your own open source software project](/open_research/02/opensourcesoftware.html#how-to-run-your-own-open-source-software-project)
es: 4. [Cómo dirigir tu propio proyecto de software de código abierto](/open_research/02/opensourcesoftware.html#how-to-run-your-own-open-source-software-project)

source: 1. [Welcome users by adding information to your README](/open_research/02/opensourcesoftware.html#welcome-users-by-adding-information-to-your-readme)
es: Dale la bienvenida a los usuarios añadiendo información a tu README

source: 2. [Contributing guidelines](/open_research/02/opensourcesoftware.html#contributing-guidelines)
es: 2. [Pautas para contribuir](/open_research/02/opensourcesoftware.html#contributing-guidelines)

source: 3. [Code of conduct](/open_research/02/opensourcesoftware.html#code-of-conduct)
es: 3. [Código de conducta](/open_research/02/opensourcesoftware.html#code-of-conduct)

source: 5. [How to contribute to other's open source software projects](/open_research/02/opensourcesoftware.html#how-to-contribute-to-others-open-source-software-projects)
es: 5. [Cómo contribuir a los proyectos de software de código abierto de otros](/open_research/02/opensourcesoftware.html#how-to-contribute-to-others-open-source-software-projects)

source: 1. [Anatomy of an open source software project](/open_research/02/opensourcesoftware.html#anatomy-of-an-open-source-software-project)
es: 1. [Anatomía de un proyecto de software de código abierto](/open_research/02/opensourcesoftware.html#anatomy-of-an-open-source-software-project)

source: 2. [Contribute your changes](/open_research/02/opensourcesoftware.html#contribute-your-changes)
es: 2. [Aporta tus cambios](/open_research/02/opensourcesoftware.html#contribute-your-changes)

source: 3. [Looking for projects to contribute to and how to contribute to them](/open_research/02/opensourcesoftware.html#looking-for-projects-to-contribute-to-and-how-to-contribute-to-them)
es: 3. [Busca proyectos a los que contribuir y cómo contribuir a ellos](/open_research/02/opensourcesoftware.html#looking-for-projects-to-contribute-to-and-how-to-contribute-to-them)

source: 6. [Closed software](/open_research/02/opensourcesoftware.html#closed-software)
es: 6. [Software privativo](/open_research/02/opensourcesoftware.html#closed-software)

source: 5. [Open hardware](/open_research/03/openhardware#open-hardware)
es: 5. [Hardware abierto](/open_research/03/openhardware#open-hardware)

source: 1. [Why open hardware?](/open_research/03/openhardware#why-open-hardware)
es: 1. [¿Por qué el hardware abierto?](/open_research/03/openhardware#why-open-hardware)

source: 2. [Elements of an open source hardware project](/open_research/03/openhardware#elements-of-an-open-source-hardware-project)
es: 2. [Elementos de un proyecto de hardware de código abierto](/open_research/03/openhardware#elements-of-an-open-source-hardware-project)

source: 3. [Open source hardware processes and practices](/open_research/03/openhardware#open-source-hardware-processes-and-practices)
es: 3. [Procesos y prácticas de hardware de código abierto](/open_research/03/openhardware#open-source-hardware-processes-and-practices)

source: 1. [Designing your hardware](/open_research/03/openhardware#designing-your-hardware)
es: 1. [Diseña tu hardware](/open_research/03/openhardware#designing-your-hardware)

source: 2. [Hosting your design file](/open_research/03/openhardware#hosting-your-design-files)
es: 2. [Alojamiento de tu archivo de diseño](/open_research/03/openhardware#hosting-your-design-files)

source: 3. [Distributing open source hardware](/open_research/03/openhardware#distributing-open-source-hardware)
es: 3. [Distribución de hardware de código abierto](/open_research/03/openhardware#distributing-open-source-hardware)

source: 6. [Open access](/open_research/04/openaccess#open-access)
es: 6. [Acceso abierto](/open_research/04/openaccess#open-access)

source: 1. [What is open access?](/open_research/04/openaccess#what-is-open-access)
es: 1. [¿Qué es el acceso abierto?](/open_research/04/openaccess#what-is-open-access)

source: 1. [Repositories and self-archiving](/open_research/04/openaccess#repositories-and-self-archiving)
es: 1. [Repositorios y autoarchivos](/open_research/04/openaccess#repositories-and-self-archiving)

source: 2. [Open access publishing](/open_research/04/openaccess#open-access-publishing)
es: 2. [Publicación de acceso abierto](/open_research/04/openaccess#open-access-publishing)

source: 2. [Why does open access matter?](/open_research/04/openaccess#why-does-open-access-matter)
es: 2. [¿Por qué es importante el acceso abierto?](/open_research/04/openaccess#why-does-open-access-matter)

source: 3. [Best practice for open access](/open_research/04/openaccess#best-practice-for-open-access)
es: 3. [Mejores prácticas para el acceso abierto](/open_research/04/openaccess#best-practice-for-open-access)

source: 1. [Self-archiving](/open_research/04/openaccess#self-archiving)
es: 1. [Autoarchivado](/open_research/04/openaccess#self-archiving)

source: 2. [Publication](/open_research/04/openaccess#publication)
es: 2. [Publicación](/open_research/04/openaccess#publication)

source: 7. [Open notebooks](/open_research/05/opennotebooks#open-notebooks)
es: 7. [Notebooks abiertos](/open_research/05/opennotebooks#open-notebooks)

source: 8. [Open scholarship](/open_research/06/openscholarship#open-scholarship)
es: 8. [Becas abiertas](/open_research/06/openscholarship#open-scholarship)

source: 1. [Open educational resources](/open_research/06/openscholarship#open-educational-resources)
es: 1. [Recursos educativos abiertos](/open_research/06/openscholarship#open-educational-resources)

source: 2. [Equity, Diversity, Inclusion](/open_research/06/openscholarship#equity-diversity-inclusion)
es: 2. [Equidad, Diversidad, Inclusión](/open_research/06/openscholarship#equity-diversity-inclusion)

source: 3. [Citizen science](/open_research/06/openscholarship#citizen-science)
es: 3. [Ciencia ciudadana](/open_research/06/openscholarship#citizen-science)

source: 9. [Checklists](/open_research/07/resources#checklists)
es: 9. [Listas de chequeo](/open_research/07/resources#checklists)

source: 10. [What to learn next](/open_research/07/resources#what-to-learn-next)
es: 10. [Qué aprender a continuación](/open_research/07/resources#what-to-learn-next)

source: 11. [Further reading](/open_research/07/resources#further-reading)
es: 11. [Más información](/open_research/07/resources#further-reading)

source: 12. [Definitions/glossary](/open_research/07/resources#definitionsglossary)
es: 12. [Definiciones/glosario](/open_research/07/resources#definitionsglossary)

source: 13. [Bibliography](/open_research/07/resources#bibliography)
es: 13. [Bibliografía](/open_research/07/resources#bibliography)

source: ## Summary
es: ## Resumen

source: Open research aims to transform research by making it more reproducible, transparent, re-usable, collaborative, accountable, and accessible to society. It pushes for change in the way that research is carried out and disseminated by digital tools. One definition of open research, [as given by the Organisation for Economic Co-operation and Development (OECD)](https://www.fct.pt/dsi/docs/Making_Open_Science_a_Reality.pdf "Making Open Science a Reality, OECD Science, Technology and Industry Policy Papers No. 25"), is the practice of making "the primary outputs of publicly funded research results – publications and the research data – publicly accessible in digital format with no or minimal restriction." In order to achieve this openness in research, each element of the research process should:
es: La investigación abierta pretende transformar la investigación haciéndola más reproducible, transparente, reutilizable, colaborativa, responsable y accesible para la sociedad. Impulsa el cambio en la forma en que la investigación se lleva a cabo y se difunde mediante herramientas digitales. Una de las definiciones de la investigación abierta, [según la Organización para la Cooperación y el Desarrollo Económico (OCDE)](https://www.fct.pt/dsi/docs/Making_Open_Science_a_Reality.pdf "Making Open Science a Reality, OECD Science, Technology and Industry Policy Papers No. 25"), es la práctica de hacer que "los productos primarios de los resultados de la investigación financiada con fondos públicos -las publicaciones y los datos de la investigación- sean accesibles al público en formato digital sin ninguna restricción o con una restricción mínima". Para lograr esta apertura en la investigación, cada elemento del proceso de investigación debería:

source: - Be publicly available: It is difficult to use and benefit from knowledge hidden behind barriers such as passwords and paywalls.
es: - Estar a disposición del público: Es difícil utilizar y aprovechar los conocimientos ocultos tras barreras como las contraseñas y los paneles de pago.

source: - Be reusable: Research outputs need to be licensed appropriately so that prospective users clearly know any limitations on re-use.
es: - Ser reutilizable: Los resultados de la investigación deben tener una licencia adecuada para que los posibles usuarios conozcan claramente las limitaciones de reutilización.

source: - Be transparent: With appropriate metadata to provide clear statements of how research output was produced and what it contains.
es: - Ser transparente: Con metadatos apropiados para proporcionar declaraciones claras de cómo se produjo el resultado de la investigación y lo que contiene.

source: The research process typically has the following form: data is collected and then analysed (usually using software). This process may involve the use of specialist hardware. The results of the research are then published. Throughout the process it is good practice for researchers to document their working in notebooks. Open research aims to make each of these elements open:
es: El proceso de investigación suele tener la siguiente forma: se recogen los datos y luego se analizan (normalmente mediante software). Este proceso puede implicar el uso de hardware especializado. A continuación se publican los resultados de la investigación. A lo largo del proceso, es una buena práctica que los investigadores documenten su trabajo en notebooks. La investigación abierta pretende que cada uno de estos elementos sea abierto:

source: - Open data: Documenting and sharing research data openly for re-use.
es: - Datos abiertos: Documentar y compartir abiertamente los datos de investigación para su reutilización.

source: - Open source software: Documenting research code and routines, and making them freely accessible and available.
es: - Software de código abierto: Documentar el código y las rutinas de investigación, y hacerlos accesibles y disponibles libremente.

source: - Open hardware: Documenting designs, materials, and other relevant information related to hardware, and making them freely accessible and available.
es: - Hardware abierto: Documentar los diseños, materiales y otra información relevante relacionada con el hardware, y hacerlos accesibles y disponibles de forma gratuita.

source: - Open access: Making all published outputs freely accessible for maximum use and impact.
es: - Acceso abierto: Hacer que todos los productos publicados sean de libre acceso para lograr el máximo uso e impacto.

source: - Open notebooks: An emerging practice, documenting and sharing the experimental process of trial and error.
es: - Notebooks abiertos: Una práctica emergente que documenta y comparte el proceso experimental de prueba y error.

source: These elements are expanded upon in this chapter.
es: Estos elementos se amplían en este capítulo.

source: Open scholarship is a concept that extends open research further. It relates to making other aspects of scientific research open to the public, for example:
es: La beca abierta es un concepto que amplía la investigación abierta. Se refiere a hacer que otros aspectos de la investigación científica estén abiertos al público, por ejemplo:

source: - Open educational resources: Making educational resources publicly available to be re-used and modified.
es: - Recursos educativos abiertos: Poner los recursos educativos a disposición del público para su reutilización y modificación.

source: - Equity, diversity, inclusion: Ensuring scholarship is open to anyone without barriers based on factors such as race, background, gender, and sexual orientation.
es: - Equidad, diversidad, inclusión: Garantizar que las becas estén abiertas a cualquier persona sin barreras basadas en factores como la raza, el origen, el género y la orientación sexual.

source: - Citizen science: The inclusion of members of the public in scientific research.
es: - Ciencia ciudadana: La inclusión de miembros del público en la investigación científica.

source: These elements are also discussed in detail in this chapter.
es: Estos elementos también se analizan en detalle en este capítulo.

source: ## How this will help you / why this is useful
es: ## Cómo te ayudará esto / por qué es útil

source: There are five main schools of thought motivating open practices to benefit research:
es: Hay cinco escuelas principales de pensamiento que motivan las prácticas abiertas en beneficio de la investigación:

source: | School | Belief | Aim |
es: | Escuela | Convicción | Objetivo |

source: | Infrastructure | Efficient research depends on the available tools and applications. | Creating openly available platforms, tools, and services for researchers. |
es: | Infraestructura | La eficacia de la investigación depende de las herramientas y aplicaciones disponibles. | Creación de plataformas, herramientas y servicios de libre acceso para los investigadores. |

source: | Pragmatic | Knowledge-creation could be more efficient if researchers worked together. | Opening up the process of knowledge creation. |
es: | Pragmático | La creación de conocimiento podría ser más eficiente si los investigadores trabajasen juntos. | Abrir el proceso de creación de conocimiento. |

source: | Measurement | Academic contributions today need alternative impact measurements. | Developing an alternative metric system for research impact. |
es: | Medición | Las contribuciones académicas de hoy en día necesitan medidas de impacto alternativas. | Desarrollo de un sistema métrico alternativo para el impacto de la investigación. |

source: | Democratic | The access to knowledge is unequally distributed. | Making knowledge freely available for everyone. |
es: | Democrático | El acceso al conocimiento está distribuido de una manera inequitativa. | Poner el conocimiento a disposición de todos de forma gratuita. |

source: | Public | Research needs to be made accessible to the public. | Making research accessible for citizens. |
es: | Público | La investigación debe ser accesible para el público. | Hacer que la investigación sea accesible para los ciudadanos. |

source: Open practices also benefit the researchers that propagate them. For example there is evidence [(Mckiernan et al. 2016)](https://elifesciences.org/articles/16800) that open access articles are cited more often, as shown by the metastudy presented in the figure below.
es: Las prácticas abiertas también benefician a los investigadores que las propagan. Por ejemplo, hay pruebas [(Mckiernan et al. 2016)](https://elifesciences.org/articles/16800) de que los artículos de acceso abierto se citan con más frecuencia, como muestra el metaestudio presentado en la siguiente figura.

source: | The relative citation rate (OA: non-OA) in 19 fields of research. This rate is defined as the mean citation rate of OA articles divided by the mean citation rate of non-OA articles. Multiple points for the same discipline indicate different estimates from the same study, or estimates from several studies. (See footnote 1 for references.) |
es: | La tasa de citación relativa (OA: no OA) en 19 campos de investigación. Esta tasa se define como la tasa de citación media de los artículos OA dividida por la tasa de citación media de los artículos no OA. Los puntos múltiples para la misma disciplina indican estimaciones diferentes del mismo estudio, o estimaciones de varios estudios. (Vé a la nota 1 para las referencias).

source: Another benefit of openness is that while research collaborations are essential to advancing knowledge, identifying and connecting with appropriate collaborators is not trivial. Open practices can make it easier for researchers to connect with one another by increasing the discoverability and visibility of one’s work, facilitating rapid access to novel data and software resources, and creating new opportunities to interact with and contribute to ongoing communal projects.
es: Otro beneficio de la apertura es que, aunque las colaboraciones en investigación son esenciales para el avance del conocimiento, identificar y conectar con los colaboradores adecuados no es trivial. Las prácticas abiertas pueden facilitar que los investigadores se conecten entre sí aumentando la posibilidad de descubrir y la visibilidad de su trabajo, facilitando el acceso rápido a nuevos datos y recursos de software, y creando nuevas oportunidades para interactuar y contribuir a los proyectos comunitarios en curso.
