Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/rdm.*.po
Languages: es

source: Listing all efforts working in and around FAIRness is practically impossible, as this is a fast moving, disperse and
es: Enumerar todos los esfuerzos que trabajan en FAIRness y en torno a él es prácticamente imposible, ya que se trata de una actividad rápida, dispersa y

source: diverse field. Nevethless, if you are interested in following the discussion and/or participate in it, here are two
es: un campo diverso. No obstante, si estás interesado en seguir el debate y/o participar en él, aquí tienes dos

source: global and international initiatives that act as umbrella organizations and reference points for many discipline
es: iniciativas globales e internacionales que actúan como organizaciones paraguas y puntos de referencia para muchas disciplinas

source: specific efforts: [GOFAIR](https://www.go-fair.org) and the [Research Data Alliance (RDA)](https://www.rd-alliance.org).
es: esfuerzos específicos: [GOFAIR](https://www.go-fair.org) y la [Research Data Alliance (RDA)](https://www.rd-alliance.org).

source: Under GOFAIR there are many [Implementation Networks (INs)](https://www.go-fair.org/implementation-networks) committed
es: En el marco de GOFAIR hay muchas [Redes de Implementación (INs)](https://www.go-fair.org/implementation-networks) comprometidas

source: to implementing elements of the Internet of FAIR Data and Services within the three pillars: GO Build (Technology), GO
es: a implementar elementos de la Internet de Datos y Servicios FAIR dentro de los tres pilares: GO Build (Tecnología), GO

source: Change (Culture) and GO Train (Training). Under the RDA there are several groups tackling different aspects relevant to
es: Cambio (Cultura) y GO Train (Formación). En el marco de la RDA hay varios grupos que abordan diferentes aspectos relacionados con

source: the RDM life cycle, and among these one [group](https://www.rd-alliance.org/groups/fair-data-maturity-model-wg) is
es: el ciclo de vida de la gestión de datos para la investigación, y entre estos un [grupo](https://www.rd-alliance.org/groups/fair-data-maturity-model-wg)

source: reviewing existing efforts, building on them to define a common set of common assessment criteria for the evaluation of
es: está revisando los esfuerzos existentes, basándose en ellos para definir un conjunto de criterios comunes de evaluación de

source: FAIRness. Watch this space!
es: FAIRness. ¡Mira este espacio!

source: #### Metadata and identifiers - community standards
es: #### Metadatos e identificadores - normas comunitarias

source: Metadata (to describe and report the data) and unique persistent identifiers (to cite and reference data) are the two
es: Los metadatos (para describir y comunicar los datos) y los identificadores únicos persistentes (para citar y referenciar los datos) son los dos

source: pillars of the FAIR principles. The use of community-defined standards for metadata and identified is vital for
es: pilares de los principios FAIR. El uso de normas definidas por la comunidad para los metadatos e identificadas es vital para

source: high-quality, reproducible research and for the integrative analysis and comparison of heterogeneous data from multiple
es: una investigación de alta calidad y reproducible y para el análisis integrador y la comparación de datos heterogéneos procedentes de múltiples

source: sources, domains and disciplines. Although also in this areas there is a lot of work in progress, and expecially
es: fuentes, dominios y disciplinas. Aunque también en estas áreas hay mucho trabajo en curso, y especialmente

source: metadata standards are disciplines specific, or specific to a given digital object, you need to know what these are and
es: las normas de metadatos son específicas de las disciplinas o de un objeto digital determinado, por lo que es necesario conocerlas y

source: which one are relevant to your data type in order to mention them in your DMP and use them.
es: para saber cuáles son relevantes para su tipo de datos con el fin de mencionarlos en su DMP y utilizarlos.

source: You can use [FAIRsharing](https://fairsharing.org) as a lookup resource to identify and cite the metadata and/or
es: Puedes utilizar [FAIRsharing](https://fairsharing.org) como recurso de búsqueda para identificar y citar los metadatos y/o

source: identifier schemas, databases or repositories that exist for your data and discipline, for example, when creating a data
es: esquemas de identificación, bases de datos o repositorios que existen para tus datos y disciplina, por ejemplo, al crear un

source: management plan for a grant proposal or funded project; or when submitting a manuscript to a journal, to identify the
es: plan de gestión para una propuesta de subvención o un proyecto financiado; o cuando se presenta un manuscrito a una revista, para identificar las

source: recommended databases and repositories, as well as the standards they implement to ensure all relevant information about
es: bases de datos y repositorios recomendados, así como las normas que aplican para garantizar toda la información pertinente sobre

source: the data is collected at the source. FAIRsharing also operates under GOFAIR and the RDA, and is
es: los datos se recojan en la fuente. FAIRsharing también opera bajo GOFAIR y la RDA, y es

source: [widely adopted](https://fairsharing.org/communities) by publishers, funders, and other organizations; like any other
es: [sea adoptada](https://fairsharing.org/communities) por editores, financiadores y otras organizaciones; como cualquier otro

source: FAIR-enabling resources, it will continue to evolve, better linking to DMP and FAIRness assessment tools, to better help
es: recurso que permita el uso de FAIR, seguirá evolucionando y se vinculará mejor con las herramientas de evaluación de DMP y FAIRness, para ayudar mejor a

source: you maing data FAIR a reality.
es: que hagas de los datos FAIR una realidad.

source: ### Storage and backup
es: ### Almacenamiento y copia de seguridad

source: Data loss can be catastrophic for your research project and can happen often. You can prevent data loss by picking
es: La pérdida de datos puede ser catastrófico para un proyecto de investigación y puede ocurrir a menudo. Puedes prevenir la pérdida de datos eligiendo

source: suitable storage solutions and backing your data up frequently.
es: soluciones de almacenamiento adecuadas y hacer copias de seguridad de los datos con frecuencia.

source: #### Where to store data
es: #### Dónde almacenar datos

source: - Most institutions will provide a _network drive_ that you can use to store data.
es: - Muchas instituciones proporcionan _unidades de red_ que puedes utilizar para almacenar datos.

source: - _Portable storage media_ such as memory sticks (USB sticks) are more risky and vulnerable to loss and damage.
es: - Los medios de almacenamiento portátiles, como los lápices de memoria (USB), son más arriesgados y vulnerables a pérdidas y daños.

source: - _Cloud storage_ provides a convenient way to store, back and up and retrieve data. You should check terms of use
es: - El almacenamiento en la nube proporciona una forma conveniente de almacenar, respaldar y recuperar datos. Debes consultar las condiciones de uso

source: before using them for your research data.
es: antes de utilizarlos para sus datos de investigación.

source: Especially if you are handling personal or sensitive data, you need to ensure the cloud option is compliant with any
es: Especialmente si estás manejando datos personales o sensibles, necesitas asegurarte de que la opción de la nube cumple con cualquier

source: data protection rules the data is bound by. To add an additional layer of security, you should encrypt devices and/or
es: normas de protección de datos a las que están sujetos los datos. Para añadir una capa adicional de seguridad, debes cifrar los dispositivos y/o

source: files where needed.
es: archivos cuando sea necesario.

source: Your institution might provide local storage solutions and policies or guidelines restricting what you can use. Thus, we
es: Es posible que tu institución proporcione soluciones de almacenamiento local y políticas o directrices que restrinjan lo que puedes utilizar. Por lo tanto, nosotros

source: recommend you familiarise yourself with your local policies anc recommendations.
es: te recomendamos que te familiarices con las políticas y recomendaciones locales.

source: When you are ready to release the data to the wider community, you can also search for the appropriate
es: Cuando estés lista para liberar los datos a la comunidad en general, también puedes buscar las

source: [databases and repositories](https://fairsharing.org/databases) in FAIRsharing, according to your data type, and type of
es: [bases de datos y repositorios](https://fairsharing.org/databases) en FAIRsharing, según su tipo de datos, y tipo de

source: access to the data. Major
es: acceso a los datos.

source: [publishers are progressively defining clearer recommendations for data deposition and sharing](https://fairsharing.org/recommendations),
es: [Los principales editores están definiendo progresivamente recomendaciones más claras para el depósito y el intercambio de datos](https://fairsharing.org/recommendations),

source: endorsing specific generics as well as domain-sepecific databases and repositories.
es: avalando bases de datos y repositorios genéricos, así como específicos del sector.

source: #### Backups
es: #### Copias de seguridad

source: To avoid loosing your data, you should follow good backup practices.
es: Para evitar perder tus datos, debes seguir unas buenas prácticas de copia de seguridad.

source: - You should have 2 or 3 copies of your files, stored on
es: - Deberías tener 2 o 3 copias de tus archivos, almacenados en

source: - at least 2 different storage media,
es: - al menos 2 medios de almacenamiento diferentes,

source: - in different locations.
es: - en diferentes lugares.

source: The more important the data and the more often the datasets change, the more frequently you should back them up. If your
es: Cuanto más importantes sean los datos y más a menudo cambien los conjuntos de datos, más a menudo deberás hacer una copia de seguridad de los mismos. Si tu

source: files take up a large amount of space and backing up all of them would be difficult or expensive, you may want to create
es: ocupan una gran cantidad de espacio y hacer una copia de seguridad de todos ellos sería difícil o costoso, es posible que quieras crear

source: a set of criteria for when you back up the data. This can be part of your data management plan.
es: un conjunto de criterios para cuando hagas una copia de seguridad de los datos. Esto puede formar parte de tu plan de gestión de datos.

source: ### Data organisation in spreadsheets
es: ### Organización de datos en hojas de cálculo

source: Spreadsheets, such as Microsoft Excel files, are commonly used to collect, store, manipulate, analyse, and share
es: Las hojas de cálculo, como los archivos de Microsoft Excel, se utilizan habitualmente para recopilar, almacenar, manipular, analizar y compartir

source: research data. Spreadsheets are convenient and easy-to-use tools for these tasks but are not amenable to reproducibility
es: datos de investigación. Las hojas de cálculo son herramientas cómodas y fáciles de usar para estas tareas, pero no se prestan a la reproducibilidad

source: if used as dynamic documents. There is a collection of [horror-stories](http://www.eusprig.org/horror-stories.htm) that
es: si se utilizan como documentos dinámicos. Hay una colección de [cuentos de terror](http://www.eusprig.org/horror-stories.htm) que

source: document the many ways that the use of spreadsheets have scuppered analyses due to unexpected behaviour or error-prone
es: documentan las numerosas formas en que el uso de hojas de cálculo ha echado por tierra los análisis debido a comportamientos inesperados o a errores

source: editing processes. Some of these mishaps are not unique to spreadsheets, but
es: de procesos de edición. Algunos de estos percances no son exclusivos de las hojas de cálculo, pero

source: [many are](https://doi.org/10.1186/s13059-016-1044-7).
es: [muchos lo son](https://doi.org/10.1186/s13059-016-1044-7).

source: Data manipulation and analysis in spreadsheets in particular is best avoided as, without version control, it can lead to
es: En particular, es mejor evitar la manipulación y el análisis de datos en hojas de cálculo, ya que, sin control de versiones, puede dar lugar a

source: non-reproducible workflows. By opening and editing raw data files directly by hand, for example to change values or
es: flujos de trabajo no reproducibles. Al abrir y editar a mano los archivos de datos sin procesar, por ejemplo para cambiar valores o

source: perform calculations, the process by which new values are obtained is not properly documented, and you may accidentally
es: realizar cálculos, el proceso por el que se obtienen los nuevos valores no está bien documentado, y puede que accidentalmente

source: over-write something or type in the wrong value only to notice after it's too late (or not at all).
es: sobreescribir algo o teclear un valor erróneo sólo para darse cuenta después de que es demasiado tarde (o no se da cuenta).

source: Even if these errors are avoided, if the spreadsheet is poorly organised then it may be
es: Aunque se eviten estos errores, si la hoja de cálculo está mal organizada puede ser

source: [difficult for collaborators](https://luisdva.github.io/pls-don't-do-this/) to easily [read-in and re-use](#FAIR) your
es: [difícil para los colaboradores](https://luisdva.github.io/pls-don't-do-this/) para fácilmente [leer y reutilizar](#FAIR) su

source: data for further analysis.
es: datos para su posterior análisis.

source: It's often not practical to avoid the use of spreadsheets altogether but there are some simple steps that can be taken
es: A menudo no es práctico evitar el uso de hojas de cálculo por completo, pero hay algunas medidas sencillas que puedes tomar

source: to mitigate their flaws. The following principles, taken from Broman et al. {% cite Broman2018data --suppress_author %},
es: para mitigar sus defectos. Los siguientes principios, tomados de Broman et al. {% cite Broman2018data --suppress_author %},

source: provide some practical advice to ensure your data is clearly organised and human- and machine-readable:
es: ofrecen algunos consejos prácticos para garantizar que tus datos estén claramente organizados y sean legibles para las personas y las máquinas:

source: - Be consistent
es: - Se coherente

source: - Write dates as YYYY-MM-DD
es: - Escriba las fechas como AAAA-MM-DD

source: - Don't leave any cells empty
es: - No dejes ninguna casilla vacía

source: - Put just one thing in a cell
es: - Pon sólo una cosa en una celda

source: - Organize the data as a single rectangle
es: - Organiza los datos como un único rectángulo

source: - Create a data dictionary
es: - Crea un diccionario de datos

source: - Don't include calculations in the raw data files
es: - No incluyas los cálculos en los archivos de datos originales sin procesar

source: - Don’t use font color or highlighting as data
es: - No utilices el color de la fuente o el resaltador como datos

source: - Choose good names for things
es: - Elige buenos nombres para las cosas

source: - Make backups
es: - Realiza copias de seguridad

source: - Use data validation to avoid data entry mistakes
es: - Utiliza validación de datos para evitar errores en la introducción de datos

source: - Save the data in plain text files
es: - Guarda los datos en archivos de texto plano

source: ### Documentation and metadata
es: ### Documentación y metadatos

source: Having data available is of no use if it cannot be understood. For example a table of numbers is useless if there are no
es: Disponer de datos no sirve de nada si no se pueden entender. Por ejemplo, una tabla de números es inútil si no hay

source: headings which describe what the columns/rows contain. Therefore you should ensure that open datasets include consistent
es: encabezamientos que describen el contenido de las columnas o filas. Por lo tanto, hay que asegurarse de que los conjuntos de datos abiertos incluyan

source: core metadata, and that the data is fully described. This requires that all documentation accompanying data is written
es: metadatos básicos, y que los datos estén completamente descritos. Esto requiere que toda la documentación que acompaña a los datos esté escrita

source: in clear, plain language, and that data users have sufficient information to understand the source, strengths,
es: en un lenguaje claro y sencillo, y que los usuarios de los datos tengan suficiente información para entender la fuente, los puntos fuertes,

source: weaknesses, and analytical limitations of the data so that they can make informed decisions when using it.
es: debilidades y limitaciones analíticas de los datos para que puedan tomar decisiones informadas al utilizarlos.

source: - The level of documentation and metadata will vary according to the project and the range of people the data needs to
es: - El nivel de documentación y metadatos variará en función del proyecto y del rango de personas a las que los datos

source: be understood by
es: deban dirigirse.

source: - It is best practice to use recognised community metadata standards to make it easier for datasets to be combined. For
es: - La mejor práctica es utilizar normas comunitarias de metadatos reconocidas para facilitar la combinación de conjuntos de datos.

source: example, for brain data the [Brain Imaging Data Structure](https://doi.org/10.25504/FAIRsharing.rd1j6t) is the
es: Por ejemplo, para los datos cerebrales, la [Estructura de Datos de Imágenes Cerebrales] (https://doi.org/10.25504/FAIRsharing.rd1j6t) son las

source: strandards to use; other [metadata standards](https://fairsharing.org/standards)(reporting requirements,
es: normas a utilizar; otras [normas de metadatos](https://fairsharing.org/standards)(requisitos de información,

source: termonologies, and models/schemas) are searchable in FAIRsharing.
es: termonologías y modelos/esquemas) se pueden buscar en FAIRsharing.

source: - Variables should be defined and explained using
es: - Las variables deben definirse y explicarse utilizando

source: [data dictionaries](http://help.osf.io/m/bestpractices/l/618767-how-to-make-a-data-dictionary)
es: [diccionarios de datos](http://help.osf.io/m/bestpractices/l/618767-how-to-make-a-data-dictionary)

source: - Data should be stored in logical and heirarchical folder structures with a README file used to describe the structure.
es: - Los datos deben almacenarse en estructuras de carpetas lógicas y jerárquicas con un archivo README que describa la estructura.

source: The README file is helpful for others and will also help you find your data in the future
es: El archivo README es útil para otros y también te ayudará a encontrar tus datos en el futuro

source: ### Sharing and archiving data
es: ### Compartir y archivar datos

source: #### Motivations for sharing data
es: #### Motivos para compartir datos

source: The world is witnessing a significant global transformation, facilitated by technology and digital media, and fueled by
es: El mundo está asistiendo a una importante transformación global, facilitada por la tecnología y los medios digitales, e impulsada por

source: data and information. This transformation has enormous potential to foster more transparent, accountable, efficient,
es: datos e información. Esta transformación tiene un enorme potencial para fomentar una mayor transparencia, responsabilidad y eficiencia,

source: responsive, and effective research. Only a very small proportion of the original data is published in conventional
es: y una investigación sensible y eficaz. Sólo una proporción muy pequeña de los datos originales se publica en los

source: scientific journals. Existing policies on data archiving notwithstanding, in today’s practice data are primarily stored
es: revistas científicas. A pesar de las políticas existentes sobre el archivo de datos, en la práctica actual los datos se almacenan principalmente

source: in private files, not in secure institutional repositories, and effectively are lost to the public. This lack of access
es: en archivos privados, no en repositorios institucionales seguros, y efectivamente se pierden para el público. Esta falta de acceso

source: to scientific data is an obstacle to international research for two main reasons:
es: en archivos privados, no en repositorios institucionales seguros, y efectivamente se pierden para el público. Esta falta de acceso

source: 1. It is generally difficult or impossible to fully reproduce a scientific study without the original data.
es: 1. Por lo general, es difícil o imposible reproducir completamente un estudio científico sin los datos originales.

source: 2. It often causes unnecessary duplication of research efforts; large amounts of research funds are spent every year to
es: 2. A menudo provoca una duplicación innecesaria de los esfuerzos de investigación; cada año se gastan grandes cantidades de fondos de investigación para

source: recreate already existing data. Furthermore, it inhibits joint research activities on various aspects of the same
es: recrear datos ya existentes. Además, inhibe las actividades de investigación conjunta sobre diversos aspectos del mismo

source: problem.
es: problema.

source: Accordingly, there is an ongoing global data revolution that seeks to advance collaboration and the creation and
es: En consecuencia, se está produciendo una revolución mundial de los datos que busca avanzar en la colaboración y en la creación y

source: expansion of effective, efficient research programs. Sharing data openly is crucial to meeting these objectives. Open
es: ampliación de programas de investigación eficaces y eficientes. Compartir los datos de forma abierta es crucial para cumplir estos objetivos.

source: data means that the data is freely available on the internet permitting any user to download, copy, analyse, re-process,
es: Latos abiertos significa que los datos están disponibles gratuitamente en Internet, lo que permite a cualquier usuario descargarlos, copiarlos, analizarlos y reprocesarlos,

source: and re-use it for any other purpose without financial, legal, or technical barriers other than those inseparable from
es: y reutilizarlo para cualquier otro fin sin más barreras financieras, legales o técnicas más

source: gaining access to the internet itself. This represents a real shift in how research works. At the moment anyone who
es: que acceder a la propia Internet. Esto representa un verdadero cambio en el funcionamiento de la investigación. En la actualidad, cualquiera que

source: wishes to use scientific data from a researcher often has to contact that researcher and make a request. Open by default
es: desee utilizar datos científicos de una investigación suele tener que ponerse en contacto con los investigadores y hacer una solicitud. Abierto por defecto

source: turns this on its head and says that there should be a presumption of publication for all. Researchers need to justify
es: le da la vuelta a esto y dice que debería haber una presunción de publicación de datos para todos. Los investigadores deben justificar

source: data that’s kept closed, for example for security or data protection reasons. Free access to, and subsequent use of,
es: las razones por las que los datos que se mantienen cerrados, por ejemplo, por razones de seguridad o protección de datos. El libre acceso a los datos y su posterior uso,
