Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/rdm.*.po
Languages: es

source: # Research Data Management
es: # Gestión de datos de investigación

source: ## Prerequisites / recommended skill level
es: ## Pre-requisitos / nivel de conocimiento recomendado

source: The following sections in this handbook provide useful context and complementary information to this chapter:
es: Las siguientes secciones de este manual proporcionan un contexto necesario e información complementaria a este capítulo:

source: | Prerequisite | Importance |
es: | Pre-requisitos | Importancia |

source: | [Version Control](/version_control/version_control) | Helpful |
es: | [Control de versiones](/version_control/version_control) | Ayuda |

source: | [Open Research](/open_research/open_research) | Helpful |
es: | [Investigación abierta](/open_research/open_research) | Ayuda |

source: ## Table of Contents
es: ## Tabla de contenidos

source: - [Research Data Management](#research-data-management)
es: - [Gestión de datos de investigación](#research-data-management)

source: - [Prerequisites / recommended skill level](#prerequisites--recommended-skill-level)
es: - [Pre-requisitos / nivel de conocimiento recomendado](#prerequisites--recommended-skill-level)

source: - [Table of Contents](#table-of-contents)
es: - [Tabla de contenidos](#table-of-contents)

source: - [Summary](#summary)
es: - [Resumen](#summary)

source: - [How this will help you/ why this is useful](#how-this-will-help-you-why-this-is-useful)
es: - [Cómo le ayudará esto / por qué es útil](#how-this-will-help-you-why-this-is-useful)

source: - [Chapter content](#chapter-content)
es: - [Contenido del capítulo](#chapter-content)

source: - [What Is Data?](#what-is-data)
es: - [¿Qué son los datos?](#what-is-data)

source: - [The Research Data Lifecycle - A Model for Data Management](#the-research-data-lifecycle---a-model-for-data-management)
es: - [El ciclo de vida de los datos de investigación: un modelo para la gestión de datos](#the-research-data-lifecycle---a-model-for-data-management)

source: - [The FAIR principles and practices](#the-fair-principles-and-practices)
es: - [ Los principios FAIR y prácticas](#the-fair-principles-and-practices)

source: - [Theory](#theory)
es: - [Teoría](#theory)

source: - [Tools and indicators](#tools-and-indicators)
es: - [Herramientas e indicadores](#tools-and-indicators)

source: - [Metadata and identifiers - community standards](#metadata-and-identifiers---community-standards)
es: - [Metadatos e identificadores - estándares de la comunidad](#metadata-and-identifiers---community-standards)

source: - [Storage and backup](#storage-and-backup)
es: - [Almacenamiento y copias de seguridad](#storage-and-backup)

source: - [Where to store data](#where-to-store-data)
es: - [Dónde almacenar datos](#where-to-store-data)

source: - [Backups](#backups)
es: - [Copias de seguridad](#backups)

source: - [Data organisation in spreadsheets](#data-organisation-in-spreadsheets)
es: - [Organización de datos en hojas de cálculo](#data-organisation-in-spreadsheets)

source: - [Documentation and metadata](#documentation-and-metadata)
es: - [Documentación y metadatos](#documentation-and-metadata)

source: - [Sharing and archiving data](#sharing-and-archiving-data)
es: - [Compartir y archivar datos](#sharing-and-archiving-data)

source: - [Motivations for sharing data](#motivations-for-sharing-data)
es: - [Incentivos para compartir datos](#motivations-for-sharing-data)

source: - [Steps to share your data](#steps-to-share-your-data)
es: - [Pasos para compartir datos](#steps-to-share-your-data)

source: - [Step 1: Select what data you want to share](#step-1-select-what-data-you-want-to-share)
es: - [Paso 1: Seleccionar que datos quieres compartir](#step-1-select-what-data-you-want-to-share)

source: - [Step 2: Choose a data repository or other sharing platform](#step-2-choose-a-data-repository-or-other-sharing-platform)
es: - [Paso 2: Elegir un repositorio de datos u otra plataforma colaborativa](#step-2-choose-a-data-repository-or-other-sharing-platform)

source: - [Step 3: Upload your data and documentation](#step-3-upload-your-data-and-documentation)
es: - [Paso 3: Subir tus datos y documentación](#step-3-upload-your-data-and-documentation)

source: - [Step 4: Choose a licence and link to your paper and code](#step-4-choose-a-licence-and-link-to-your-paper-and-code)
es: - [Paso 4: Elegir una licencia y vincular con tu artículo y código](#step-4-choose-a-licence-and-link-to-your-paper-and-code)

source: - [Barriers to data sharing](#barriers-to-data-sharing)
es: - [Barreras para compartir datos](#barriers-to-data-sharing)

source: - [Privacy and data protection](#privacy-and-data-protection)
es: - [Privacidad y protección de datos](#privacy-and-data-protection)

source: - [Consent](#consent)
es: - [Consentimiento](#consent)

source: - [Anonymisation](#anonymisation)
es: - [Anonimización](#anonymisation)

source: - [National and commercially sensitive data](#national-and-commercially-sensitive-data)
es: - [Datos nacionales y comercialmente sensibles](#national-and-commercially-sensitive-data)

source: - [Personal Stories](#personal-stories)
es: - [Historias personales](#personal-stories)

source: - [Checklist](#checklist)
es: - [Lista de verificación](#checklist)

source: - [What to learn next](#what-to-learn-next)
es: - [Qué aprender a continuación](#what-to-learn-next)

source: - [Further reading](#further-reading)
es: - [Lecturas adicionales](#further-reading)

source: - [Definitions/glossary](#definitionsglossary)
es: - [Definiciones/glosario](#definitionsglossary)

source: - [Bibliography](#bibliography)
es: - [Bibliografía](#bibliography)

source: ## Summary
es: ## Resumen

source: Research Data Management (RDM) covers how research data can be stored, described and reused. Data here is used as a
es: La gestión de datos de investigación (RDM) abarca el modo de almacenar, describir y reutilizar los datos de investigación. Aquí los datos se utilizan como

source: generic term to encompass all digital objects. RDM is a key part in enabling reproducible research. RDM ensures
es: término genérico para englobar todos los objetos digitales. El RDM es una pieza clave para hacer posible la investigación reproducible. El RDM garantiza

source: efficiency in research workflows, and also greater reach and impact, as data become FAIR (Findable, Accessible,
es: eficiencia en los flujos de trabajo de investigación, y también un mayor alcance e impacto, ya que los datos se convierten en FAIR (Localizables, Accesibles,

source: Interoperable and Reuseable). Data should be stored in multiple locations and backed-up regularly to prevent loss or
es: interoperable y reutilizable, por su sigla en inglés). Los datos deben almacenarse en varias ubicaciones y se deben hacer copias de seguridad periódicamente para evitar su pérdida o

source: data corruption. Clearly describing data using documentation and metadata ensures that others know how to access, use
es: corrupción de datos. La descripción clara de los datos mediante documentación y metadatos garantiza que los demás sepan cómo acceder a los datos, utilizarlos

source: and re-use your data, and also enable conditions for sharing and publishing data to be outlined.
es: y reutilizarlos, y también permite establecer las condiciones para compartir y publicar los datos.

source: ## How this will help you/ why this is useful
es: ## Cómo te ayudará esto/ por qué esto es útil

source: To be able to share data that is understandable and re-usable by third parties, research data needs to be managed
es: Para poder compartir datos comprensibles y reutilizables por terceros, es necesario gestionar los datos de investigación

source: properly. The FAIR principles provide guidance on how to make data discoverable and reusable. FAIR data is a key
es: correctamente. Los principios FAIR proporcionan orientación sobre cómo hacer que los datos sean descubribles y reutilizables. Los datos FAIR son un elemento clave

source: component of reproducing an analysis. However, FAIR data is not a synonym for open data or quality data. This chapter
es: de la reproducción de un análisis. Sin embargo, datos FAIR no son sinónimo de datos abiertos o de calidad. Este capítulo

source: lays out good data management practice to allow you to plan your data management activities at the start of your
es: establece las buenas prácticas de gestión de datos para permitirle planificar tus actividades de gestión de datos al inicio de tu

source: reproducible research project.
es: proyecto de investigación reproducible.

source: ## Chapter content
es: ## Contenido del capítulo

source: ### What Is Data?
es: ## ¿Qué son los datos?

source: Data are all digital objects that you use and produce during your research life cycle, encompassing datasets, software,
es: Los datos son todos los objetos digitales que se utilizan y producen durante el ciclo de vida de la investigación, y abarcan conjuntos de datos, software,

source: code, workflow, models, figures, tables, images, articles. Data are your research asset. In some fields it's obvious
es: código, flujo de trabajo, modelos, figuras, tablas, imágenes, artículos. Los datos son su activo de investigación. En algunos campos es obvio

source: what data means - you have observations or results of simulations. However, in other fields, particularly in Social
es: lo que significa tener datos: se tienen observaciones o resultados de simulaciones. Sin embargo, en otros campos, especialmente en ciencias sociales

source: Sciences, Humanities or Arts, you may be thinking "I don't think I have any data". A good way of thinking about what
es: humanidades o artes, puedes estar pensando «no creo que tenga datos». Una buena forma de pensar en lo que

source: might be classed as data that needs to be managed is to ask yourself the questions "What is the information that I need
es: que se pueden clasificar como datos que necesitan ser gestionados es hacerse las preguntas «¿Cuál es la información que necesito

source: to use and write about in my paper or book?", "What information would I need to back up my conclusions?" and "What
es: utilizar y de la que debo escribir en mi artículo o libro?», ¿Qué información necesitaría para sustentar mis conclusiones?» y «¿Qué

source: information is needed by a third party to understand and possibly replicate the research that I've done?". This
es: información es necesaria para que una tercera persona entienda y posiblemente replique la investigación que hice?». Estas

source: information is your data.
es: informaciones son tus datos.

source: ### The Research Data Lifecycle - A Model for Data Management
es: ### El ciclo de vida de los datos de investigación - Un modelo para el manejo de datos

source: Research data often follows a 'lifecycle' which follows the research project as it evolves; here is a
es: Los datos de una investigación suelen seguir un «ciclo de vida» que acompaña al proyecto de investigación a medida que evoluciona; he aquí un

source: [video](https://www.ukdataservice.ac.uk/manage-data/lifecycle.aspx) that describes it. This model provides a useful
es: [video](https://www.ukdataservice.ac.uk/manage-data/lifecycle.aspx) que lo describe. Este modelo provee

source: basis on which to plan for research data management, from data creation at the start of a research project, through to
es: una base útil sobre la cual se planea el manejo de los datos de investigación, desde la creación de los datos al inicio de un proyecto, hasta

source: publishing and sharing research at the end of the project, and archiving any research data for the long-term and for
es: publicar y compartir la investigación al final del proyecto, y archivar los datos de la investigación a largo plazo y para

source: future re-use once the project has ended.
es: futura reutilización una vez finalizado el proyecto.

source: The research data lifecycle involves data creation, data use, data publication and sharing, data archiving and data
es: El ciclo de vida de los datos de investigación incluye la creación de datos, el uso de datos, la publicación y el intercambio de datos, el archivo de datos y la

source: re-use or destruction. However, data have a longer lifespan than the research project that creates them.
es: reutilización o destrucción. Sin embargo, los datos tienen una vida más larga que el proyecto de investigación que los crea.

source: ### The FAIR principles and practices
es: ### Los principios FAIR y prácticas

source: The FAIR guiding principles for scientific data management and stewardship {% cite Wilkinson2016fair %} have been
es: Los principios rectores de FAIR para la gestión y administración de datos científicos {% cite Wilkinson2016fair %} han sido

source: developed as guidelines to improve the findability, accessibility, interoperability and re-usability of digital assets;
es: desarrolladas como directrices para mejorar la localizabilidad, accesibilidad, la interoperabilidad y la re-utilización de los activos digitales;

source: all of which will support research reproducibility. Defined and endorsed by a growing community, these principles put a
es: todo ello para apoyar la reproducibilidad de la investigación. Definidos y respaldados por una comunidad cada vez más numerosa, estos principios ponen a

source: specific emphasis on enhancing the ability of machines to automatically find and use digital objects, in addition to
es: énfasis específico en la mejora de la capacidad de las máquinas para encontrar y utilizar automáticamente los objetos digitales, además de

source: supporting its reuse by individuals throughout their life cycle. The capacity of computational systems to find, access,
es: apoyando su reutilización por parte de los individuos a lo largo de su ciclo de vida. La capacidad de los sistemas informáticos para encontrar, acceder,

source: interoperate, and reuse data, with none or minimal human intervention, is essential in today's data-driven era, where
es: interoperar y reutilizar los datos, sin intervención humana o con una intervención mínima, es esencial en la era actual impulsada por los datos, en la que

source: humans increasingly rely on computational support to deal with data as a result of the increase in volume, velocity and
es: los humanos dependen cada vez más del apoyo informático para tratar los datos como consecuencia del aumento del volumen, la velocidad y la

source: variety and complexity.
es: variedad y complejidad.

source: #### Theory
es: #### Teoría

source: Here is a [simple overview](https://www.go-fair.org/fair-principles) of what the FAIR principles recommend. In breif,
es: He aquí un [resumen sencillo](https://www.go-fair.org/fair-principles) de lo que recomiendan los principios FAIR. En pocas palabras,

source: data should be:
es: los datos debería ser:

source: **Findable:** the first step in (re)using data is to find them, and descriptive metadata is essential.
es: **Encontrable:** el primer paso para (re)utilizar los datos es encontrarlos, y los metadatos descriptivos son esenciales.

source: - F1. (Meta)data are assigned a globally unique and persistent identifier
es: - F1. A los (meta)datos se les asigna un identificador global único y persistente

source: - F2. Data are described with rich metadata (defined by R1 below)
es: - F2. Los datos se describen con metadatos enriquecidos (definidos por R1 a continuación)

source: - F3. Metadata clearly and explicitly include the identifier of the data they describe
es: - F3. Los metadatos incluyen clara y explícitamente el identificador de los datos que describen

source: - F4. (Meta)data are registered or indexed in a searchable resource
es: - F4. Los (meta)datos se registran o indexan en un recurso de búsqueda

source: **Accessible:** to get data one needs to know if authentication and authorisation is necessary, or if data is open with
es: **Accesible:** para obtener los datos hay que saber si es necesaria la autentificación y la autorización, o si los datos están abiertos con

source: no restrictions.
es: sin restricciones.

source: - A1. (Meta)data are retrievable by their identifier using a standardised communications protocol
es: - A1. Los (meta)datos son recuperables por su identificador mediante un protocolo de comunicación normalizado

source: - A1.1 The protocol is open, free, and universally implementable
es: - A1.1 El protocolo es abierto, gratuito y de aplicación universal

source: - A1.2 The protocol allows for an authentication and authorisation procedure, where necessary
es: - A1.2 El protocolo permite un procedimiento de autenticación y autorización, cuando sea necesario

source: - A2. Metadata are accessible, even when the data are no longer available
es: - A2. Los metadatos son accesibles, incluso cuando los datos ya no están disponibles

source: **Interoperable:** data need to be integrated with other data and/or interoperate with applications or workflows.
es: **Interoperable:** los datos deben integrarse con otros datos y/o interoperar con aplicaciones o flujos de trabajo.

source: - I1. (Meta)data use a formal, accessible, shared, and broadly applicable language for knowledge representation.
es: - I1. Los (meta)datos utilizan un lenguaje formal, accesible, compartido y ampliamente aplicable para la representación del conocimiento.

source: - I2. (Meta)data use vocabularies that follow FAIR principles
es: - I2. Los (meta)datos utilizan vocabularios que siguen los principios FAIR

source: - I3. (Meta)data include qualified references to other (meta)data
es: - I3. Los (meta)datos incluyen referencias calificadas a otros (meta)datos

source: **Reusable:** data should be well-described so that they can be used or replicated in different settings.
es: **Reutilizables:** los datos deben estar bien descritos para que puedan ser utilizados o replicados en diferentes escenarios.

source: - R1. Meta(data) are richly described with a plurality of accurate and relevant attributes
es: - R1. Los meta(datos) se describen de forma exhaustiva con una pluralidad de atributos precisos y relevantes

source: - R1.1. (Meta)data are released with a clear and accessible data usage license
es: - R1.1. Los (meta)datos se publican con una licencia de uso de datos clara y accesible

source: - R1.2. (Meta)data are associated with detailed provenance
es: - R1.2. Los (meta)datos están asociados a una procedencia detallada

source: - R1.3. (Meta)data meet domain-relevant community standards
es: - R1.3. Los (meta)datos cumplen con las normas de la comunidad relevantes para el dominio

source: It is important to stress that making data 'FAIR' is not the same as making it 'open' (as accessibility principle
es: Es importante destacar que hacer que los datos sean "FAIR" no es lo mismo que hacerlos "abiertos" (como principio de accesibilidad

source: clearly explains). Data should be as open as possible, as closed as necessary.
es: explica claramente). Los datos deben ser tan abiertos como sea posible y tan cerrados como sea necesario.

source: The FAIR principles refer to three types of entities: data (as any digital object), metadata (information about that
es: Los principios FAIR se refieren a tres tipos de entidades: datos (como cualquier objeto digital), metadatos (información sobre ese

source: digital object), and infrastructure (such as software and repositories). For instance, the findability principle F4 defines
es: objeto digital), y la infraestructura (como el software y los repositorios). Por ejemplo, el principio de buscabilidad F4 define

source: that both metadata and data are registered or indexed in a searchable resource (such as a data repository). For example,
es: que tanto los metadatos como los datos estén registrados o indexados en un recurso de búsqueda (como un repositorio de datos). Por ejemplo,

source: the FAIR principles are also being applied to [software](https://doi.org/10.6084/m9.figshare.7449239.v2), and projects
es: los principios FAIR también se aplican al [software](https://doi.org/10.6084/m9.figshare.7449239.v2), y los proyectos

source: where the data and software are both FAIR the research is more likely to be reproducible.
es: Cuando los datos y el software son FAIR, es más probable que la investigación sea reproducible.

source: It is much easier to make data FAIR if you plan to do this from the beginning of your research project. One way to do
es: Es mucho más fácil hacer que los datos sean FAIR si te planteas hacerlo desde el principio de tu proyecto de investigación. Una forma de hacerlo

source: this is to create a Data Management Plan (DMP), in [DMPonline](https://dmponline.dcc.ac.uk/) or just as a text file, to
es: es crear un plan de gestión de datos (DMP), en [DMPonline](https://dmponline.dcc.ac.uk/) o simplemente como un archivo de texto, para

source: help you think through how to manage your data. The DMP should include information on data creation (volume,
es: ayudarte a pensar en cómo gestionar tus datos. El DMP debe incluir información sobre la creación de datos (volumen,

source: formats/types and workflows), data use (where the raw or 'live' data is being stored), data publication and data
es: formatos/tipos y flujos de trabajo), el uso de los datos (dónde se almacenan los datos brutos o "vivos"), la publicación de los datos y la

source: archiving at the end of the project (long-term data storage, or what data is 'kept' at the end of a project). DMPs
es: biblioteca de datos al final del proyecto (almacenamiento de datos a largo plazo, o qué datos se "guardan" al final de un proyecto). DMPs

source: should also regularly be updated as the research project progresses or diverge from the initial design.
es: también deben actualizarse periódicamente a medida que el proyecto de investigación avanza o se desvía del diseño inicial.

source: #### Tools and indicators
es: #### Herramientas e indicadores

source: Altought started by a community operating in the life science, the FAIR principles have rapidly been adopted by
es: Aunque fueron iniciados por una comunidad que operaba en las ciencias de la vida, los principios FAIR han sido rápidamente adoptados por

source: publishers, funders, and pan-disciplinary infrastructure programmes and societies, in all disciplines. Many groups and
es: editores, financiadores, programas de infraestructuras pandisciplinarias y sociedades, en todas las disciplinas. Muchos grupos y

source: organization are working to define guidances and tools to help researchers, as well as other stakeholders (such as
es: organizaciones trabajando en la definición de directrices y herramientas para ayudar a los investigadores, así como a otras partes interesadas (como

source: librarians, funders, publishers, and trainers) to make data FAIR and assess its FAIRness level.
es: bibliotecarios, financiadores, editores y formadores) para hacer que los datos sean FAIR y evaluar su nivel de FAIRness.

source: This rapid uptake and community involvement, however, has also caused some confusion and ambiguity on what FAIRness is
es: Sin embargo, esta rápida aceptación y participación de la comunidad también ha provocado cierta confusión y ambigüedad sobre lo que es "FAIRness"

source: and how we can measure it. It is important to say that the FAIR principles are aspirational, in that they do not
es: y cómo podemos medirlo. Es importante decir que los principios FAIR son una aspiración, en el sentido de que no

source: strictly define how to achieve a state of FAIRness, but rather describe a continuum of features, attributes, and
es: definen estrictamente cómo alcanzar un estado de FAIRness, sino que describen un continuo de características, atributos y

source: behaviors that will move a digital resource closer to that goal.
es: comportamientos que acerquen un recurso digital a ese objetivo.
