Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/rdm.*.po
Languages: es

source: data is of significant value to society and the economy, and that data should, therefore, be open by default. Research
es: Los datos tienen un valor significativo para la sociedad y la economía, y por tanto deben ser abiertos por defecto. Investigación

source: is often publically-funded, so the results of this research should be openly available as a public good.
es: a menudo se financia con fondos públicos, por lo que los resultados de esta investigación deberían estar disponibles abiertamente como un bien público.

source: ### Steps to share your data
es: ### Pasos para compartir tus datos

source: #### Step 1: Select what data you want to share
es: #### Paso 1: Selecciona los datos que quieres compartir

source: Not all data can be made openly available, due to ethical and commercial concerns, and you may decide that some of your
es: No todos los datos pueden ponerse a disposición del público, debido a cuestiones éticas y comerciales, y puedes decidir que algunos de tus

source: intermediate data is too large to share. So you first need to decide which data you need to share for others to be able
es: datos de procesamiento intermedios son demasiado grandes para compartirlos. Así que primero hay que decidir qué datos hay que compartir para que otros puedan

source: to reproduce your research.
es: para reproducir tu investigación.

source: #### Step 2: Choose a data repository or other sharing platform
es: #### Paso 2: Elegir un repositorio de datos u otra plataforma de intercambio

source: Data should be shared in a formal, open, and indexed data repository where possible so that it will be accessible in the
es: Los datos deben compartirse en un repositorio de datos formal, abierto e indexado, siempre que sea posible, para que sean accesibles

source: long-run. Suitable data repositories by subject, content type or location can be found at
es: a largo plazo. Se pueden encontrar repositorios de datos adecuados por tema, tipo de contenido o ubicación en

source: [Re3data.org](https://www.re3data.org/) and in [FAIRsharing](https://fairsharing.org/databases) where you can also see
es: [Re3data.org](https://www.re3data.org/) y en [FAIRsharing](https://fairsharing.org/databases) donde también puedes ver

source: which standards (metadata and identifier) the repositories implement and which journal/publisher recommend them. If
es: qué estándares (metadatos e identificadores) aplican los repositorios y qué revista/editorio los recomienda. Si

source: possible use a repository which assigns a DOI, a digital object identifier, to make it easier for others to cite your
es: posible utilizar un repositorio que asigne un DOI, un identificador de objeto digital, para facilitar que otros citen tus

source: data.
es: datos.

source: #### Step 3: Upload your data and documentation
es: #### Paso 3: Subir los datos y la documentación

source: In line with the FAIR principles outlined above upload the data in open formats as much as possible and include
es: En consonancia con los principios FAIR expuestos anteriormente, carga los datos en formatos abiertos en la medida de lo posible e incluye

source: sufficient documentation and metadata that someone else can understand your data.
es: documentación y metadatos suficientes para que otra persona pueda entender sus datos.

source: #### Step 4: Choose a licence and link to your paper and code
es: #### Paso 4: Elige una licencia y enlaza con tu documento y código

source: So that others know what they can do with your data you need to apply a licence to your data. The most commonly used
es: Para que otros sepan lo que pueden hacer con sus datos, es necesario aplicar una licencia a los mismos. La más utilizada

source: licences are [Creative Commons](https://creativecommons.org/choose/),
es: licencias son [Creative Commons](https://creativecommons.org/choose/),

source: [Open Government Licence](http://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/), or an
es: [Licencia de Gobierno Abierto](http://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/), o una

source: [Open Data Commons Attribution License](https://opendatacommons.org/licenses/by/index.html). To get maximum value from
es: [Licencia de atribución Open Data Commons](https://opendatacommons.org/licenses/by/index.html). Para obtener el máximo valor de

source: data sharing make sure that your paper and code both link to your data, and vice versa, to allow others to best
es: asegúrate de que tu artículo y tu código están vinculados a tus datos, y viceversa, para que otros puedan

source: understand your project. <a name="Barriers-Share"></a>
es: entender su proyecto.

source: ### Barriers to data sharing
es: ### Barreras para compartir datos

source: Some academics still find sharing data difficult. Recent surveys {% cite Stuart2018sharing %} amongst researchers find
es: A algunos académicos les sigue resultando difícil compartir datos. Recientes encuestas {% citan a Stuart2018sharing %} entre los investigadores encuentran

source: that sharing data is challenging for the following reasons:
es: que compartir datos es un reto por las siguientes razones:

source: - Organising data in a presentable and useful way (mentioned by 46%),
es: - Organizar los datos de forma presentable y útil (mencionado por el 46%),

source: - Unsure about copyright and licensing as mentioned by 37%,
es: - El 37% no está seguro sobre los derechos de autor y las licencias,

source: - Not knowing which repository to use as raised by 33%.
es: - No saber qué repositorio utilizar según lo planteado por el 33%.

source: These are cultural challenges that might be addressed in changing practice going forward. However, there are also legal,
es: Se trata de retos culturales que podrían abordarse al cambiar la práctica en el futuro. Sin embargo, también los hay legales,

source: ethical or contractual reasons that sometimes prevent making data publicly available in its entirety or even in parts.
es: razones éticas o contractuales que a veces impiden hacer públicos los datos en su totalidad o incluso en partes.

source: Those will be addressed in the following paragraphs.
es: En los siguientes párrafos se abordarán estos temas.

source: #### Privacy and data protection
es: #### Privacidad y protección de datos

source: Many fields of scientific disciplines involve working with sensitive personal data. Their management is well regulated
es: Muchos campos de las disciplinas científicas implican trabajar con datos personales sensibles. Su gestión está bien regulada

source: in data protection legislation (in Europe through national implementations of the General Data Protection Regulation)
es: en la legislación sobre protección de datos (en Europa a través de las aplicaciones nacionales del Reglamento General de Protección de Datos)

source: and ethics procedures as they are established in most research institutions {% cite EU2016protection %}.
es: y los procedimientos éticos tal y como están establecidos en la mayoría de las instituciones de investigación {% cite EU2016protection %}.

source: ##### Consent
es: ##### Consentimiento

source: In order to make sure that anonymised research data can be made available for future reuse, it is important that consent
es: Para garantizar que los datos de investigación anonimizados puedan estar disponibles para su futura reutilización, es importante que el consentimiento

source: forms cover sharing anonymised data with other researchers. Research so far suggests that study participants are usually
es: Los formularios cubren el intercambio de datos anónimos con otros investigadores. Las investigaciones realizadas hasta ahora sugieren que los participantes en el estudio suelen estar

source: less concerned about the data being archived and shared than researchers think {% cite Kuula2010archiving %}.
es: menos preocupados por que los datos sean archivados y compartidos de lo que los investigadores creen {% cite Kuula2010archiving %}.

source: Participant information sheets and consent forms should include how research data will be stored, preserved and used in
es: Las hojas de información de los participantes y los formularios de consentimiento deben incluir cómo se almacenarán, conservarán y utilizarán los datos de la investigación

source: the long-term, and how confidentiality will be protected when needed.
es: a largo plazo, y cómo se protegerá la confidencialidad cuando sea necesario.

source: ##### Anonymisation
es: ##### Anonimización

source: Individuals must be protected from (re)identification via their personal data used for research. Anonymisation of the
es: Los individuos deben estar protegidos de la (re)identificación a través de sus datos personales utilizados para la investigación. La anonimización de los

source: data may be sufficient in some cases, but ensuring that reidentification is not possible is becoming increasingly
es: datos puede ser suficiente en algunos casos, pero garantizar que la reidentificación no sea posible es cada vez más

source: difficult and might be impossible due to technical progress, growing computational power and – ironically – more open
es: difícil y podría ser imposible debido al progreso técnico, a la creciente potencia de cálculo y - irónicamente - a la mayor apertura

source: data. For example reidentification may be possible via data-mining of accessible data and so-called quasi-identifiers, a
es: datos. Por ejemplo, la reidentificación puede ser posible a través de la extracción de datos accesibles y los llamados cuasi-identificadores, un

source: set of (common) properties that are – in their combination – so specific that they can be used to identify. Preserving
es: conjunto de propiedades (comunes) que son -en su combinación- tan específicas que pueden utilizarse para identificar. La conservación de

source: privacy may still be possible if partial or generalised datasets are provided. For example, providing age bands instead
es: la privacidad puede seguir siendo posible si se proporcionan conjuntos de datos parciales o generalizados. Por ejemplo, proporcionar bandas de edad en lugar de

source: of birth date or only the first two digits of postal codes. It may also be possible to provide the data in such a format
es: de la fecha de nacimiento o sólo los dos primeros dígitos de los códigos postales. También es posible proporcionar los datos en este formato

source: that researchers can query it whist keeping the data itself closed. For example, a user may be able to send a query to
es: para que los investigadores puedan consultarla mientras mantienen los datos cerrados. Por ejemplo, un usuario puede enviar una consulta para

source: retrieve the mean of a dataset, but not be able to access any of the individual datapoints. Another way to provide
es: recuperar la media de un conjunto de datos, pero no poder acceder a ninguno de los puntos de datos individuales. Otra forma de proporcionar

source: anonymized data is to provide [synthetic data](https://en.wikipedia.org/wiki/Synthetic_data), data generated to reflect
es: datos anónimos es proporcionar [datos sintéticos](https://en.wikipedia.org/wiki/Synthetic_data), datos generados para reflejar

source: the conditions and properties of the raw data without including any of the personal information.
es: las condiciones y propiedades de los datos brutos sin incluir ninguna información personal.

source: #### National and commercially sensitive data
es: #### Datos confidenciales nacionales y comerciales

source: In many cases companies are understandably unwilling to publish much of their data. The reasoning goes that if
es: En muchos casos, es comprensible que las empresas no estén dispuestas a publicar gran parte de sus datos. El razonamiento es que si

source: commercially sensitive information of a company is disclosed, it will damage the company’s commercial interests and
es: La divulgación de información comercialmente sensible de una empresa perjudicará los intereses comerciales de la misma y

source: undermine competitiveness. This is based on the thinking that in competitive markets, innovation will only occur with
es: socavaría la competitividad. Esto se basa en la idea de que en los mercados competitivos, la innovación sólo se producirá con

source: some protection of information: if a company spends time and money developing something new, the details of which are
es: cierta protección de la información: si una empresa dedica tiempo y dinero a desarrollar algo nuevo, cuyos detalles

source: then made public, then its competitors can easily copy it without having to invest the same resources. The result is
es: luego se hacen públicos, entonces sus competidores pueden copiarlo fácilmente sin tener que invertir los mismos recursos. El resultado es

source: that no-one would innovate in the first place. Similarly governments are often unwilling to publish data that relates to
es: que nadie innovaría en primer lugar. Del mismo modo, los gobiernos a menudo no están dispuestos a publicar datos relacionados con

source: issues such as national security due to public safety concerns. In such cases it may not be possible to make data open,
es: cuestiones como la seguridad nacional por motivos de seguridad pública. En estos casos puede que no sea posible hacer que los datos sean abiertos,

source: or it may only be only possible to share partial/obscured datasets as outlined in the section above on privacy.
es: o puede que sólo sea posible compartir conjuntos de datos parciales/obscuros, como se indica en la sección anterior sobre privacidad.

source: ## Personal Stories
es: ## Historias personales

source: ### Susanna-Assunta Sansone: from FAIR co-author to FAIR doer
es: ### Susanna-Assunta Sansone: de coautora de FAIR a realizadora de FAIR

source: Let's start with my digital footprints so that you can discovery my activities:
es: Empecemos con mis huellas digitales para que puedas descubrir mis actividades:

source: - [Biography](https://www.eng.ox.ac.uk/people/susanna-assunta-sansone)
es: - [Biografía](https://www.eng.ox.ac.uk/people/susanna-assunta-sansone)

source: - [The Data Readiness group I run at Oxford University](https://sansonegroup.eng.ox.ac.uk)
es: - [El grupo de preparación de datos que dirijo en la Universidad de Oxford](https://sansonegroup.eng.ox.ac.uk)

source: - [Profile on LinkedIn](https://uk.linkedin.com/in/sasansone)
es: - [Perfil en LinkedIn](https://uk.linkedin.com/in/sasansone)

source: - [Talks on SlideShare](https://www.slideshare.net/SusannaSansone)
es: - [Presentaciones en SlideShare](https://www.slideshare.net/SusannaSansone)

source: - [Twitter; yes I am the FAIRlady](https://twitter.com/SusannaASansone)
es: - [Twitter; sí, soy una señora FAIR](https://twitter.com/SusannaASansone)

source: - [Activities on GitHub; yeah, no code sorry](https://github.com/SusannaSansone)
es: - [Actividades en GitHub; Si... no hay código perdón](https://github.com/SusannaSansone)

source: I have worked on research data management since 2001, yes, way before this area was even considered a 'thing'. I was
es: Llevo trabajando en la gestión de datos de investigación desde 2001, sí, mucho antes de que este ámbito se considerase "algo". A mí

source: also told that there is no career to make in research data management. Well, how wrong that comment was! Formely seen as
es: también me dijeron que no se puede hacer carrera en la gestión de datos de investigación. Pues bien, ¡qué equivocado estaba ese comentario! Antes se consideraba que

source: intersection between service provision and IT, data management has become a first class citizen, recognized as a
es: la intersección entre la prestación de servicios y la informática, la gestión de datos se ha convertido en un ciudadano de primera clase, reconocido como

source: research and development subject, as it should be. A lot of the credit for this change goes to the FAIR principles. Love
es: tema de investigación y desarrollo, como debería ser. Gran parte del mérito de este cambio se debe a los principios de FAIR. Ámalo

source: it or hate it, FAIR is now an internationally-known lighthouse brand. Since we published the first article on the
es: u odialo, FAIR es ahora una marca conocida internacionalmente. Desde que publicamos el primer artículo sobre la

source: [FAIR principles](https://doi.org/10.1038/sdata.2016.18), enabling FAIR has been my focus.
es: [Principios FAIR](https://doi.org/10.1038/sdata.2016.18), facilitar el uso de FAIR ha sido mi foco de atención.

source: The reuse of other people’s data is providing useful insights for new research questions and products, and driving new
es: La reutilización de los datos de otras personas está proporcionando ideas útiles para nuevas preguntas de investigación y productos, e impulsando nuevos

source: scientific discoveries. To realize its potential, however, we need new mechanisms to manage the growing availability and
es: descubrimientos científicos. Sin embargo, para aprovechar su potencial, necesitamos nuevos mecanismos para gestionar la creciente disponibilidad y

source: scale of scholarly digital products, such as datasets, software, algorithms, articles. FAIR has been specifically
es: escala de productos digitales académicos, como conjuntos de datos, software, algoritmos y artículos. FAIR ha sido específicamente

source: designed to emphasise the machine-readablity of these digital objects.
es: diseñado para enfatizar la legibilidad mecánica de estos objetos digitales.

source: With my group of research software and knowledge engineerings we address the grand challenges related to information
es: Con mi grupo de investigación de software e ingeniería del conocimiento abordamos los grandes retos relacionados con la información

source: science and scholarly communications, where data quality and readiness for (re)use is a prerequisite for success. I
es: ciencia y las comunicaciones académicas, donde la calidad de los datos y la preparación para su (re)utilización es un requisito previo para el éxito.

source: believe that better data means better science, and this underpins reusable research, aids scholarly publishing, and
es: Creo que mejores datos significan mejor ciencia, y esto apuntala la investigación reutilizable, ayuda a la publicación académica y

source: enables faster and reliable data-driven discoveries. As I say in my [one minute video](https://youtu.be/3VDw7XIulIk), my
es: permite realizar descubrimientos más rápidos y fiables basados en datos. Como digo en mi [vídeo de un minuto](https://youtu.be/3VDw7XIulIk), mi

source: vision is to transform the concept of data readiness into a powerful toolkit at the researchers’ fingertips, to realize
es: La visión es transformar el concepto de preparación de datos en un poderoso conjunto de herramientas al alcance de los investigadores, para realizar

source: FAIR data by stealth.
es: datos FAIR.

source: FAIR is not a magic wand. There is a lot to be done to enable and enact this transformation. We need all hands on deck!
es: FAIR no es una varita mágica. Hay mucho que hacer para posibilitar y llevar a cabo esta transformación. Necesitamos que todos se pongan manos a la obra.

source: Researchers, service providers, journal publishers, library science experts, funders and learned societies in the
es: Investigadores, proveedores de servicios, editores de revistas, expertos en biblioteconomía, financiadores y sociedades científicas de la

source: academic as well as in the commercial and governmental setting all play a role: from providing use cases, to drive
es: académico, así como en el ámbito comercial y gubernamental, todos desempeñan un papel: desde proporcionar casos de uso, hasta impulsar

source: policy and culture changes that motivates, rewards and credits researchers for disseminating and publishing
es: cambios políticos y culturales que motiven, recompensen y acrediten a los investigadores por difundir y publicar

source: high-quality, machine-readable data; to building tools and services, to inform, training and educate.
es: datos de alta calidad y legibles por máquina; a la creación de herramientas y servicios, a la información, la formación y la educación.

source: There are many community efforts around FAIR; keeping abreast with these is an activity in itself. I spend considerable
es: Hay muchos esfuerzos comunitarios en torno a FAIR; estar al tanto de ellos es una actividad en sí misma. Dedico un tiempo considerable a

source: time to bring my group activities (such as [ISA](https://isa-tools.org) and [FAIRsharing](https://fairsharing.org)) in
es: tiempo para llevar mis actividades de grupo (como [ISA](https://isa-tools.org) y [FAIRsharing](https://fairsharing.org)) en

source: and under larger international umbrella organizations like
es: y bajo organizaciones internacionales como

source: [GOFAIR](https://www.go-fair.org/implementation-networks/overview/fair-strepo) and the
es: [GOFAIR](https://www.go-fair.org/implementation-networks/overview/fair-strepo) y

source: [RDA](http://dx.doi.org/10.15497/RDA00030) to interact with others, learn from them, compare and contrast efforts and
es: [RDA](http://dx.doi.org/10.15497/RDA00030) para interactuar con otros, aprender de ellos, comparar y contrastar esfuerzos y

source: build new collaborations. I also play leading roles, seating on boards and chairing working groups with collagues,
es: construir nuevas colaboraciones. También desempeño funciones de liderazgo, formando parte de consejos de administración y presidiendo grupos de trabajo con colegas,

source: because you must get your hands dirty and lead by example.
es: porque hay que ensuciarse las manos y predicar con el ejemplo.

source: In research data management, the history is the future. The one I envision is a future where scientific evidences are
es: En la gestión de datos de investigación, la historia es el futuro. El que yo vislumbro es un futuro en el que las pruebas científicas están

source: routinely available in a transparent, trustworthy and persistent manner to support peer-review and withstand
es: disponibles de forma rutinaria, transparente, fiable y persistente para apoyar la revisión por pares y resistir

source: reproducibility, to underpin new results and discoveries, and effectively drive sciences forward.
es: reproducibilidad, para apuntalar nuevos resultados y descubrimientos, e impulsar eficazmente la ciencia.

source: My advice: be aware, be FAIR!
es: Mi consejo: sé consciente, ¡sé FAIR!

source: ## Checklist
es: ## Lista de verificación

source: - [ ] Don't Touch the Raw Data - back it up somewhere reasonable and keep a read-only copy.
es: - [ ] No toques los datos originales: haz una copia de seguridad en algún lugar razonable y guarda una copia de sólo lectura.

source: - [ ] Have a plan! - Decide where your data is going to be stored, what its called, when/if it needs to be deleted
es: - [ ] ¡Ten un plan! - Decide dónde se van a almacenar los datos, cómo se llaman, cuándo y si es necesario eliminarlos

source: BEFORE you start collecting it and note it down in a data management plan. If you collect sensitive data, plan for
es: ANTES de empezar a recopilarlos, anótalos en un plan de gestión de datos. Si recoges datos sensibles, planifica

source: consent for sharing from the start!
es: consentimiento para compartir ¡desde el principio!

source: - [ ] Document Everything - You know who the worst person at replying to emails is about what the sampling frequency of
es: - [ ] Documenta todo - ¿Sabes quién es la peor persona en responder a los correos electrónicos sobre lo que la frecuencia de muestreo de
