Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/rdm.*.po
Languages: es

source: channel X was. Nope not him, it's actually yourself from a year ago. Keep the documentation with the data!
es: el canal X era. No, no es él, en realidad eres tú mismo desde hace un año. ¡Guarda la documentación con los datos!

source: - [ ] Create the data you want to see in the word - Imagine someone was about to give you a dataset that you needed to
es: - [ ] Imagina que alguien está a punto de darte un conjunto de datos que necesitas para

source: analyse well in order to get that job you've been dreaming about. What would you want it to look like? That's how
es: analizar bien para conseguir ese trabajo con el que sueñas. ¿Cómo quieres que sea? Así es como

source: yours should look.
es: tus datos deberían ser.

source: - [ ] Try not to re-invent the wheel. Before you start creating some crazy new schema, storage format or naming
es: - [ ] Intenta no reinventar la rueda. Antes de empezar a crear un nuevo esquema, formato de almacenamiento o nomenclatura

source: protocol - have a quick google, ask your colleagues. Something that's already being used is likely going to be
es: protocolo - busqua rápidamente en Google, pregunte a sus colegas. Es probable que algo que ya se utiliza sea

source: better in the long run even if you think there's a better solution. <a name="What-Next"></a>
es: mejor a largo plazo, incluso si crees que hay una solución mejor. <a name="What-Next"></a>

source: ## What to learn next
es: ## ¿Qué aprender a continuación?

source: If you haven't read the chapter on Open Research yet, you might want to read it now for more context on how research
es: Si aún no ha leído el capítulo sobre la investigación abierta, le recomendamos que lo haga ahora para conocer el contexto de la investigación

source: data management supports Open Research. <a name="Further-Reading"></a>
es: de gestión de datos apoya la investigación abierta. <a name="Further-Reading"></a>

source: ## Further reading
es: ## Lecturas complementarias

source: ## Definitions/glossary
es: ## Definiciones/glosario

source: **RDM:** - Research Data Management
es: **RDM:** - Research Data Management (Gestión de datos de investigación )

source: **DMP:** - Data Management Plan
es: **DMP:** - Data Management Plan (Plan de gestión de datos )

source: **FAIR:** - Findable, Accessible, Interoperable and Reusable
es: **FAIR:** - Findable, Accessible, Interoperable and Reusable (Localizable, accesible, interoperable y reutilizable)

source: **METADATA:** - Data that describes other data
es: **METADATA:** - Data that describes other data (Datos que describen otros datos )

source: ## Bibliography
es: ## Bibliografía
