Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/reproducible_environments.*.po
Languages: es

source: - The requirement.txt file does not need to be hand written. Running the command `pip freeze > requirements.txt` will output a requirements.txt file that fully defines the Python environment.
es: - El archivo requirements.txt no necesita ser escrito a mano. Ejecutando el comando `pip freeze > requirements.txt` se obtendrá un archivo requirements.txt que define completamente el entorno de Python.

source: - Used to specify a particular version of Python of R for the Binder to use.
es: - Se utiliza para especificar una versión particular de Python de R para que el Binder utilice.

source: - To specify which version of R to use specify find the date it was captured on [MRAN](https://mran.microsoft.com/documents/rro/reproducibility) and include it in the runtime.txt file as
es: - Para especificar qué versión de R utilizar, busque la fecha en que se capturó en [MRAN](https://mran.microsoft.com/documents/rro/reproducibility) e inclúyala en el archivo runtime.txt como

source: - To specify a version of Python, similarly state the version in this file. For example to use Python 2.7 the file would need to read
es: - Para especificar una versión de Python, indique igualmente la versión en este archivo. Por ejemplo, para usar Python 2.7 el archivo tendría que decir

source: - An install.R file lists the packages to be installed, for example to install the package tibble in the Binder:
es: - Un archivo como install.R enumera los paquetes a instalar, por ejemplo para instalar el paquete tibble en el Binder:

source: - [DESCRIPTION files](https://cran.r-project.org/doc/manuals/r-release/R-exts.html#The-DESCRIPTION-file) are more typically used in the R community for dependency management.
es: - [DESCRIPTION files] (https://cran.r-project.org/doc/manuals/r-release/R-exts.html#The-DESCRIPTION-file) se utilizan más típicamente en la comunidad de R para la gestión de las dependencias.

source: #### Step 2: Put your code on GitHub
es: #### Paso 2: Poner el código en GitHub

source: GitHub is discussed at length in the chapter on version control, which you should refer to if you wish to understand more about this step. In this chapter we will give the briefest possible explanation. GitHub is a very widely used platform where you can make "repositories", and upload code, documentation, or any other files into them. To complete this step:
es: GitHub se discute en profundidad en el capítulo sobre el control de versiones, que deberías consultar si quieres entender más sobre este paso. En este capítulo daremos una explicación lo más breve posible. GitHub es una plataforma muy utilizada en la que puedes hacer "repositorios", y subir a ellos código, documentación o cualquier otro archivo. Para completar este paso:

source: 1. Make an account on [GitHub](https://github.com/).
es: 1. Crea una cuenta en [GitHub](https://github.com/).

source: 2. Create a repository for the project you wish to make a Binder of.
es: 2. Cree un repositorio para el proyecto del que desea hacer un Binder.

source: 3. Upload your project files (including the file you have created to specify your computational environment) to the repository and save ("commit" in the vocabulary of GitHub) them there.
es: 3. Sube los archivos de tu proyecto (incluyendo el archivo que has creado para especificar tu entorno computacional) al repositorio y guárdalos ("commit" en el vocabulario de GitHub) allí.

source: Again, if you are unable to complete these steps refer to the chapter on version control for a fuller explanation.
es: De nuevo, si no puede completar estos pasos, consulte el capítulo sobre el control de versiones para obtener una explicación más completa.

source: #### Step 3: Generate a link to a Binder of your project
es: #### Paso 3: Generar un enlace a una carpeta de su proyecto

source: Head to [https://mybinder.org](https://mybinder.org). You'll see a form that asks you to specify a repository for [mybinder.org](https://mybinder.org) to build. In the first field, paste the URL of the project's GitHub repository. It'll look something like this: `https://github.com/<your-username>/<your-repository>`
es: Dirígete a [https://mybinder.org](https://mybinder.org). Verás un formulario que te pide que especifiques un repositorio para [mybinder.org](https://mybinder.org) para construir. En el primer campo, pega la URL del repositorio GitHub del proyecto. Tendrá un aspecto similar al siguiente `https://github.com/<your-username>/<your-repository>`

source: As you can see there are additional fields in this form, but these are optional are will not be discussed here.
es: Como puede ver, hay campos adicionales en este formulario, pero son opcionales y no se discutirán aquí.

source: Once the URL to the project to be Binderized is supplied two fields will be automatically populated on the screen depicted above:
es: Una vez que la URL del proyecto que se va a encuadernar se suministra, dos campos se rellenan automáticamente en la pantalla representada arriba:

source: - The "Copy the URL below and share your Binder with others" field, which provides a link to the Binder which can be copied and shared by you.
es: - El campo "Copie la URL de abajo y comparta su carpeta con otros", que proporciona un enlace a la carpeta que puede ser copiado y compartido por usted.

source: - The "Copy the text below, then paste into your README to show a binder badge" field, which as described can be included by you in GitHub to create a button that allows anyone that accesses your project on GitHub to launch the Binder.
es: - El campo "Copia el texto de abajo y pégalo en tu README para mostrar un distintivo de Binder", que como se describe puede ser incluido por ti en GitHub para crear un botón que permita a cualquiera que acceda a tu proyecto en GitHub lanzar el Binder.

source: Finally, click the launch button. This will ask [mybinder.org](https://mybinder.org) to build the environment needed to run the project, note that this may take several minutes. You can click on the "Build logs" button to see the logs generated by the build process. These logs are helpful for resolving any issues that cause the build to fail, such as errors in the file defining the computational environment to be generated.
es: Por último, haga clic en el botón de lanzamiento. Esto pedirá a [mybinder.org](https://mybinder.org) que construya el entorno necesario para ejecutar el proyecto, tenga en cuenta que esto puede tardar varios minutos. Puedes hacer clic en el botón "Build logs" para ver los registros generados por el proceso de construcción. Estos registros son útiles para resolver cualquier problema que haga fallar la construcción, como errores en el archivo que define el entorno computacional que se va a generar.

source: Once it has been built the Binder will be automatically launched, again this may take some time.
es: Una vez que se haya construido el Binder se lanzará automáticamente, de nuevo esto puede tomar algún tiempo.

source: ### Including data in a Binder
es: ### Incluir datos en Binder

source: There are a few ways to make data available in your Binder. Which is the best one depends on how big your data is and your preferences for sharing data. Note that the more data that is included include the longer it will take for a Binder to launch. Data also takes up storage space which must be paid for, so it is good to be considerate and minimise the data you include, especially on the publicly provided [mybinder.org](https://mybinder.org).
es: Hay varias maneras de hacer que los datos estén disponibles en tu Binder. Cuál es la mejor depende del tamaño de tus datos y de tus preferencias para compartirlos. Ten en cuenta que cuantos más datos se incluyan, más tiempo tardará en lanzarse el Binder. Los datos también ocupan un espacio de almacenamiento que hay que pagar, por lo que es bueno ser considerado y minimizar los datos que se incluyen, especialmente en el sitio público [mybinder.org](https://mybinder.org).

source: #### Small public files
es: #### Pequeños archivos públicos

source: The simplest approach for small data files that are public is to add them directly to your GitHub repository, i.e to include them along with the rest of your project files in the Binder. This works well and is reasonable for files with sizes up to maybe 10MB.
es: El enfoque más sencillo para los archivos de datos pequeños que son públicos es añadirlos directamente a tu repositorio de GitHub, es decir, incluirlos junto con el resto de los archivos de tu proyecto en el Binder. Esto funciona bien y es razonable para archivos con tamaños de hasta quizás 10MB.

source: #### Medium public files
es: #### Archivos públicos medianos

source: For medium sized files, a few 10s of megabytes to a few hundred megabytes, find some other place online to store them and make sure they are publicly available. Then add a file named postBuild (which is a shell script so the first line must be `#!/bin/bash`) to your project files. In the postBuild file add a single line reading `wget -q -O name_of_your_file link_to_your_file`.
es: Para los archivos de tamaño medio, de unos pocos 10s de megabytes a unos pocos cientos de megabytes, encuentre algún otro lugar en línea para almacenarlos y asegúrese de que están disponibles públicamente. A continuación, añada un archivo llamado postBuild (que es un script de shell por lo que la primera línea debe ser `#!/bin/bash`) a sus archivos de proyecto. En el archivo postBuild añade una sola línea que diga `wget -q -O nombre_de_tu_archivo link_a_tu_archivo`.

source: The postBuild file is used to execute commands when the files to produce the Binder are being generated. In this case it can be used to download your data into the files used to launch the binder.
es: El archivo postBuild se utiliza para ejecutar comandos cuando se están generando los archivos para producir el Binder. En este caso se puede utilizar para descargar sus datos en los archivos utilizados para lanzar el Binder.

source: #### Large public files
es: #### Archivos públicos de gran tamaño

source: The best option for large files is to use a library specific to the data format to stream the data as you are using it. There are a few restrictions on outgoing traffic from your Binder that are imposed by the team operating [mybinder.org](https://mybinder.org). Currently only connections to HTTP and Git are allowed. This comes up when people want to use FTP sites to fetch data. For security reasons FTP is not allowed on [mybinder.org](https://mybinder.org).
es: La mejor opción para los archivos grandes es utilizar una biblioteca específica para el formato de datos para transmitir los datos a medida que los utiliza. Hay algunas restricciones en el tráfico saliente de tu Binder que son impuestas por el equipo que opera [mybinder.org](https://mybinder.org). Actualmente sólo se permiten conexiones a HTTP y Git. Esto surge cuando la gente quiere usar sitios FTP para obtener datos. Por razones de seguridad el FTP no está permitido en [mybinder.org](https://mybinder.org).

source: ## Virtual machines
es: ## Máquinas virtuales

source: ### What are virtual machines?
es: ### ¿Qué son las máquinas virtuales?

source: Virtual machines (VMs) essentially package a whole computer as an app that can be run. As an example see the figure below which shows a windows laptop (note the windows search button in the lower left corner) running a virtual ubuntu machine (note the terminal outputting the operating system). The machine running the VM is called the "host machine". Using software like [VirtualBox](https://www.virtualbox.org/) or [Vagrant](https://www.vagrantup.com/), a user can create and run any number of VMs. As you could probably guess, having several VMs running at once can be a drain on memory, so just because you can run several at once doesn’t mean you should.
es: Las máquinas virtuales (VMs) esencialmente empaquetan un ordenador completo como una aplicación que puede ser ejecutada. Como ejemplo, véase la figura siguiente, que muestra un portátil con Windows (nótese el botón de búsqueda de Windows en la esquina inferior izquierda) ejecutando una máquina virtual de Ubuntu (nótese el terminal que muestra el sistema operativo). La máquina que ejecuta la VM se llama "máquina anfitriona". Usando software como [VirtualBox](https://www.virtualbox.org/) o [Vagrant](https://www.vagrantup.com/), un usuario puede crear y ejecutar cualquier número de VMs. Como probablemente puedas adivinar, tener varias VMs ejecutándose a la vez puede suponer un gasto de memoria, así que sólo porque puedas ejecutar varias a la vez no significa que debas hacerlo.

source: Users can download, install, backup and destroy VMs at will, which is part of what makes them an attractive tool for sharing reproducible research. Research often requires specific pieces of software or system settings. If a researcher wishes to reproduce another's work on their own computer making the necessary changes to their environment to run the project may impact their own work. For example near the very start of this chapter it was [described](#How_this_will_help_you_why_this_is_useful) how using a different version of Python can lead to unexpected changes in the results of an analysis. Say a researcher installs an updated version of Python to replicate an analysis because the analysis requires features only present in the updated version. By doing so they put their own work at risk. VMs remove that risk; any tools downloaded or settings changed will only impact the VM, keeping the reproducer's research safe. If they do inadvertently break something in the VM, they can just delete it and make another one. They are effectively a quarantined area.
es: Los usuarios pueden descargar, instalar, hacer copias de seguridad y destruir las máquinas virtuales a su antojo, lo que en parte las convierte en una herramienta atractiva para compartir investigaciones reproducibles. La investigación suele requerir piezas específicas de software o configuraciones del sistema. Si un investigador desea reproducir el trabajo de otro en su propio ordenador, hacer los cambios necesarios en su entorno para ejecutar el proyecto puede afectar a su propio trabajo. Por ejemplo, cerca del comienzo de este capítulo se [describió](#How_this_will_help_you_why_this_is_useful) cómo el uso de una versión diferente de Python puede conducir a cambios inesperados en los resultados de un análisis. Digamos que un investigador instala una versión actualizada de Python para replicar un análisis porque el análisis requiere características sólo presentes en la versión actualizada. Al hacerlo, ponen en riesgo su propio trabajo. Las VMs eliminan ese riesgo; cualquier herramienta descargada o configuración cambiada sólo afectará a la VM, manteniendo la investigación del reproductor a salvo. Si se rompe algo en la máquina virtual por error, se puede borrar y hacer otra. Son efectivamente un área en cuarentena.

source: Virtual machines can be shared by exporting them as single files. Another researcher can then import that file using their own virtualisation software like [VirtualBox](https://www.virtualbox.org/) and open up a copy of the VM which will contain all the software files and settings put in place by the person that made the VM. Therefore in practice they will have a working version of the project without the pain of setting it up themselves.
es: Las máquinas virtuales pueden compartirse exportándolas como archivos individuales. Otro investigador puede entonces importar ese archivo utilizando su propio software de virtualización como [VirtualBox](https://www.virtualbox.org/) y abrir una copia de la VM que contendrá todos los archivos de software y las configuraciones establecidas por la persona que hizo la VM. Por lo tanto, en la práctica tendrán una versión del proyecto que funcione sin tener que preocuparse de configurarla ellos mismos.

source: #### Setting up a virtual machine
es: #### Configuración de una máquina virtual

source: First choose a tool for generating VMs. Here the widely-used [VirtualBox](https://www.virtualbox.org/) is chosen. Download and install it on your system. To create a new machine click "New" in the top left. A window will pop up where you can enter a name for the machine and select what operating system and version of the operating system to use. In the figure below a machine called demo_VM running ubuntu is being created:
es: En primer lugar, elija una herramienta para generar VMs. En este caso se elige la ampliamente utilizada [VirtualBox](https://www.virtualbox.org/). Descárgala e instálala en tu sistema. Para crear una nueva máquina haz clic en "New" en la parte superior izquierda. Aparecerá una ventana en la que puedes introducir un nombre para la máquina y seleccionar qué sistema operativo y qué versión del sistema operativo quieres utilizar. En la figura siguiente se está creando una máquina llamada demo_VM que ejecuta ubuntu:

source: As you click through you can adjust other features of the machine to be created such as how much memory it should have access to. The default options are suitable for most purposes, but this process permits customisation.
es: A medida que se hace clic, se pueden ajustar otras características de la máquina que se va a crear, como la cantidad de memoria a la que debe tener acceso. Las opciones por defecto son adecuadas para la mayoría de los propósitos, pero este proceso permite la personalización.

source: #### Starting a virtual machine
es: #### Iniciar una máquina virtual

source: To start a virtual machine simply select the machine from the list of VMs on the left, and click the green "start" arrow at the top:
es: Para iniciar una máquina virtual basta con seleccionarla en la lista de máquinas virtuales de la izquierda y hacer clic en la flecha verde de "inicio" de la parte superior:

source: #### Sharing virtual virtual machines
es: #### Compartir máquinas virtuales

source: A researcher can do work on their VM, and then export the whole thing. To export a virtual machine click "File" in the top left and then "Export". This will export the VM as a single file which can be shared like any other.
es: Una investigadora puede trabajar en su VM y luego exportarla en su totalidad. Para exportar una máquina virtual, haga clic en "Archivo" en la parte superior izquierda y luego en "Exportar". Esto exportará la VM como un único archivo que puede ser compartido como cualquier otro.

source: Someone that has access to this file and VirtualBox installed just needs to click "File" in the top left and then "Import" and select that file. Once it is imported they can start the VM as described before by selecting it from the menu clicking the green start arrow at the top.
es: Alguien que tenga acceso a este archivo y VirtualBox instalado sólo tiene que hacer clic en "Archivo" en la parte superior izquierda y luego "Importar" y seleccionar ese archivo. Una vez importado, puede iniciar la máquina virtual como se ha descrito anteriormente, seleccionándola en el menú y haciendo clic en la flecha verde de inicio en la parte superior.

source: ## Containers
es: ## Contenedores

source: ### Why Containers?
es: ### ¿Por qué usar contenedores?

source: Even for moderately complex projects, the size of the software dependency stack can be huge. Take for example a simple
es: Incluso en proyectos moderadamente complejos, el tamaño de la pila de dependencias del software puede ser enorme. Tomemos por ejemplo una simple cadena de pasos

source: pipeline to build a pdf report for an analysis scripted in R using Rmarkdown. To make this reproducible, not only (i)
es: para construir un informe en pdf para un análisis programado en R usando Rmarkdown. Para que esto sea reproducible, no sólo (i)

source: the respective R packages need to be installed and (ii) the R version needs to be the same, but also (iii) the versions
es: los respectivos paquetes de R tienen que estar instalados y (ii) la versión de R tiene que ser la misma, pero también (iii) las versiones

source: of pandoc and LaTeX need to be exaclty the same as during runtime.
es: de pandoc y LaTeX deben ser exactamente las mismas que durante el tiempo de ejecución.

source: Instead of trying to resolve these dependencies via a package manager (such as conda) which also depends on all required
es: En lugar de intentar resolver estas dependencias a través de un gestor de paquetes (como conda) que también depende de que todo el

source: software being available in a single package manager, it might be easier to simply create a snapshot of the entire
es: software esté disponible en un único gestor de paquetes, podría ser más fácil crear simplemente una instantánea de todo el

source: computing environment including all dependencies. These computing environments are then self-contained, hence the name
es: entorno informático incluyendo todas las dependencias. Estos entornos informáticos son entonces auto-contenidos, de ahí el nombre

source: 'containers'.
es: 'contenedores'.

source: ### What are containers?
es: ### ¿Qué son los contenedores?

source: Containers allow a researcher to package up a project with all of the parts it needs, such as libraries, dependencies,
es: Los contenedores permiten a los investigadores empaquetar un proyecto con todas las partes que necesita, como bibliotecas y dependencias,

source: and system settings and ship it all out as one package. Anyone can then open up a container and work within it, viewing
es: y la configuración del sistema y enviarlo todo como un paquete. Cualquiera puede abrir un contenedor y trabajar en él, viendo

source: and interacting with the project as if the machine they are accessing it from is identical to the machine specified in
es: e interactuar con el proyecto como si la máquina desde la que acceden fuera idéntica a la especificada en

source: the container - regardless of what their computational environment _actually_ is. They are designed to make it easier to
es: el contenedor - independientemente de cuál sea su entorno computacional _realmente_. Están diseñados para facilitar

source: transfer projects between very different environments.
es: la transferencia de proyectos entre entornos muy diferentes.

source: In a way, containers behave like a virtual machine. To the outside world, they look like their own complete system. But
es: En cierto modo, los contenedores se comportan como una máquina virtual. Para el mundo exterior, parecen su propio sistema completo. Pero

source: unlike a virtual machine, rather than creating a whole virtual operating system plus all the software and tools
es: a diferencia de una máquina virtual, en lugar de crear todo un sistema operativo virtual más todo el software y las herramientas

source: typically packaged with one, containers only contain the individual components they need in order to operate the project
es: normalmente asociadas a una, los contenedores sólo contienen los componentes individuales que se necesitan para operar el proyecto

source: they contain. This gives a significant performance boost and reduces the size of the application.
es: que contienen. Esto proporciona un aumento significativo del rendimiento y reduce el tamaño de la aplicación.

source: Containers are particularly useful way for reproducing research which relies on software to be configured in a certain
es: Los contenedores son una forma especialmente útil de reproducir la investigación que depende de que el software se configure en una determinada

source: way, and/or which makes use of libraries that vary between (or don't exist on) different systems. In summary containers
es: forma y/o que hace uso de bibliotecas que varían entre (o no existen en) diferentes sistemas. En resumen, los contenedores
