Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/reproducible_environments.*.po
Languages: es

source: Docker daemon to build the image. The deamon uses the Dockerfile and its context to build the image. If the context
es: demonio de docker para hacer build de la imagen. El demonio utiliza el Dockerfile y su context para hacer el build de la imagen

source: contains many large files which aren't needed for building the image (old datafiles, for example) then it is a waste of
es: Si el context contiene muchos archivos pesados que no se necesitan para hacer el build de la imagen (archivos de datos viejos, por ejemplo) entonces es un desperdicio de tiempo

source: time sending them to the daemon, and doing do can make the process of building an image slow. Files can be excluded from
es: pasarlos al demonio, y hacerlo podría volver el proceso de build de la imagen muy lento. Los archivos pueden ser excluidos del

source: the context by listing them in a text file called .dockerignore, and it is good practise to do so.
es: context haciendo una lista de ellos en un archivo de texto llamado .dockerignore, lo que se considera buena práctica.

source: The files do not need to be listed individually in the .dockerignore file. Here is an example of the contents of a
es: Los archivos no necesitan aparecer individualmente en el archivo .dockerignore. Aquí un ejemplo de los contenidos de un

source: .dockerignore file:
es: archivo .dockerignore:

source: This excludes from the context:
es: Esto excluye del contexto:

source: - All jpg files in the same directory as the Dockerfile file
es: - Todos los archivos jpg en el mismo directorio que el archivo Dockerfile

source: - All png files in the same directory as the Dockerfile file _or any subdirectories within it_
es: - Todos los archivos png en el mismo directorio que el archivo Dockerfile _o cualquier subdirectorio dentro de él_

source: - All files within the data_files directory
es: - Todos los archivos del directorio data_files

source: - The file named "file_to_exclude.txt"
es: - El archivo llamado "file_to_exclude.txt" (archivos a excluir).

source: ### Sharing images
es: ### Compartir imágenes

source: Docker images can be shared most easily via [DockerHub](https://hub.docker.com/), which requires an account. Say two
es: Las imágenes Docker se pueden compartir más fácilmente a través de [DockerHub](https://hub.docker.com/), que requiere una cuenta. Digamos que dos

source: researchers, Alice and Bob, are collaborating on a project and Alice wishes to share an image of some of her work with
es: investigadores, Alice y Bob, están colaborando en un proyecto y Alice desea compartir una imagen de su trabajo con

source: To do this Alice must:
es: Para ello, Alice debe:

source: - Write a Dockerfile to produce an image of her work
es: - Escribir un Dockerfile para producir una imagen de su trabajo

source: - Build the image. She (being inventive) calls it image_name
es: - Construye la imagen. Ella (siendo inventiva) la llama imagen_nombre

source: - Go to DockerHub and sign up for an account. Say Alice (again, being inventive) chooses the username username_Alice
es: - Ve a DockerHub y regístrate para obtener una cuenta. Digamos que Alice (de nuevo, siendo inventiva) elige el nombre de usuario username_Alice

source: - Log into DockerHub via the terminal on her machine using `sudo docker login`
es: - Inicie sesión en DockerHub a través del terminal de su máquina utilizando `sudo docker login`.

source: - Tag the image of her project on her machine via the command line by supplying the name of the image and using the
es: - Etiquetar la imagen de tu proyecto en tu máquina a través de la línea de comandos proporcionando el nombre de la imagen y utilizando el comando

source: pattern `username/image_name:version`, so Alice runs the command:
es: patrón `nombre_de_usuario/nombre_de_imagen:versión`, por lo que Alice ejecuta el comando:

source: ``` sudo docker tag image_name username_Alice/image_name:version_1 ```
es: ``` sudo docker tag image_name usuario_Alice/nombre_de_imagen:version_1 ```

source: - Push the image to her DockerHub account using `sudo docker tag push username_Alice/image_name:version_1`
es: - Empuja la imagen a su cuenta de DockerHub usando `sudo docker tag push usuario_Alice/nombre_de_imagen:version_1`

source: - Alice's image is now online and can be downloaded. Over to Bob...
es: - La imagen de Alice ya está en línea y se puede descargar. A Bob...

source: Bob (assuming he already has Docker installed) can open a container from Alice's image simply by running
es: Bob (asumiendo que ya tiene Docker instalado) puede abrir un contenedor desde la imagen de Alice simplemente ejecutando

source: ``` sudo docker run -i -t username_Alice/image_name:version_1 ```
es: ``` sudo docker run -i -t usuario_Alice/nombre_de_imagen:version_1 ```

source: Initially Docker will search for this image on Bob's machine, and when it doesn't find it it will _automatically_ search
es: Inicialmente Docker buscará esta imagen en la máquina de Bob, y cuando no la encuentre buscará _automáticamente_.

source: DockerHub, download Alice's image, and open the container with Alice's work and environment on Bob's machine.
es: DockerHub, descarga la imagen de Alice, y abre el contenedor con el trabajo y el entorno de Alice en la máquina de Bob.

source: ### Copying files to and from containers
es: ### Copiar archivos hacia y desde contenedores

source: Containers act much like virtual machines, as a result copying files into and out of them is not as trivial as copying
es: Los contenedores actúan de forma muy parecida a las máquinas virtuales, por lo que copiar archivos dentro y fuera de ellos no es tan trivial como copiar

source: files to different locations within the same computer is.
es: archivos a diferentes ubicaciones dentro del mismo ordenador.

source: A file can be copied from the machine running a container into the container using:
es: Se puede copiar un archivo desde la máquina que ejecuta un contenedor al contenedor utilizando:

source: ``` sudo docker cp file_name conteriner_ID:path_to_where_to_put_file/file_name ```
es: ``` sudo docker cp nombre_de_archivo conteriner_ID:ruta_donde_poner_archivo/nombre_de_archivo ```

source: Recall that container IDs can be obtained using `sudo docker container ls`.
es: Recordemos que los IDs de los contenedores se pueden obtener usando `sudo docker container ls`.

source: A file can be copied from within a container to the machine running the container by running the following command on
es: Se puede copiar un archivo desde dentro de un contenedor a la máquina que lo ejecuta ejecutando el siguiente comando en

source: the machine running the container:
es: la máquina que ejecuta el contenedor:

source: ``` sudo docker cp conteriner_ID:path_to_file/file_name path_to_where_to_put_file/file_name ```
es: ``` sudo docker cp conteriner_ID:ruta_al_archivo/nombre_del_archivo ruta_al_donde_poner_el_archivo/nombre_del_archivo ```

source: If the second part (the `path_to_where_to_put_file/file_name`) is substituted for a `.` then the file will be copied to
es: Si la segunda parte (la `ruta_a_donde_poner_el_archivo/nombre_del_archivo`) se sustituye por un `.`, el archivo se copiará en

source: whatever directory the terminal running the command is in.
es: cualquier directorio en el que se encuentre el terminal que ejecuta el comando.

source: ### Volumes
es: ### Volúmenes

source: Every time a container is opened from an image that container is completely new. For example say a container is opened
es: Cada vez que se abre un contenedor desde una imagen ese contenedor es completamente nuevo. Por ejemplo, digamos que se abre un contenedor

source: and work is done within it, files created, changed, deleted and so on. If that container is then closed and the image it
es: y se trabaja dentro de él, se crean archivos, se modifican, se borran, etc. Si ese contenedor se cierra y la imagen de la que

source: came from is again used to start a container none of that work will be in the new one. It will simply have the starting
es: procede se utiliza de nuevo para iniciar un contenedor, nada de ese trabajo estará en el nuevo. Simplemente tendrá el estado inicial

source: state described in the image.
es: descrito en la imagen.

source: This can be a problem if a researcher wants to work in a container over a period of time, but there is a way around this
es: Esto puede ser un problema si un investigador quiere trabajar en un contenedor durante un periodo de tiempo, pero hay una forma de evitarlo

source: using "volumes". These store work done within a container even after it is closed, and can then be used to load that
es: utilizando "volúmenes". Estos almacenan el trabajo realizado dentro de un contenedor, incluso después de que se cierre, y luego pueden ser utilizados para cargar ese

source: work into future containers.
es: trabajo en los futuros contenedores.

source: To create/use a volume run
es: Para crear/utilizar un volumen ejecuta

source: Hopefully you will give your volume a more descriptive name than volume_name. A "target" directory is required, only
es: Probablemente le darás a tu volumen un nombre más descriptivo que `volume_name`. Se requiere un directorio de "destino" (target), sólo

source: work within this directory in the container which will be saved in the volume. Once the researcher is done they can
es: el trabajo hecho dentro de este directorio en el contenedor se guardará en el volumen. Una vez que la persona que investiga haya terminado puede

source: close the container as normal. When they come back to the project and want to continue their work they just need to use
es: cerrar el contenedor normalmente. Cuando vuelvan al proyecto y quieran continuar con su trabajo sólo tendrán que utilizar

source: the exact same command as above, and it will load the work contained in volume_name into the new container. It will save
es: el mismo comando anterior, y cargará el trabajo contenido en `volume_name` en el nuevo contenedor. Guardará

source: any new work there too.
es: los nuevos cambios ahí presentes, también.

source: Volume related commands:
es: Comandos relacionados con los «volumes» (volúmenes):

source: - List volumes: `sudo docker volume ls`
es: - Para listarlos: `sudo docker volume ls`

source: - Delete a volume: `sudo docker volume rm volume_name`
es: - Borrar un volumen: `sudo docker volume rm volume_name`

source: - Delete all unattached volumes: `sudo docker volume prune`
es: - Borrar todo volumen unattached (sin adjuntar): `sudo docker volume prune`

source: - If, when deleting a container a `-v` is included after `rm` in `sudo docker rm container_ID` any volumes associated
es: - Si al eliminar un contenedor, se agrega un `-v` después de `rm` en `sudo docker rm container_ID` todo volumen asociado

source: with the container will also be deleted.
es: al contenedor será también eliminado.

source: > Prerequisites: At present, Singularity only runs on linux systems (for example Ubuntu). If you use, macOS,
es: > Prerrequisitos: Actualmente, Singularity sólo funciona en sistemas linux (por ejemplo, Ubuntu). Si utilizas, macOS,

source: > [Singularity Desktop for macOS](https://www.sylabs.io/singularity-desktop-macos/) is in "Alpha Preview" stage.
es: > [Singularity Desktop para macOS](https://www.sylabs.io/singularity-desktop-macos/) está en fase de "Alpha Preview".

source: A major drawback of Docker for reproducible research is that it is not intended as a user-space application but as a
es: Una de las principales desventajas de Docker para la investigación reproducible es que no está pensado como una aplicación para el espacio del usuario, sino como una

source: tool for server administrators. As such it requires root access to operate. There is, however, no reason why the
es: herramienta para administradores de servidores. Como tal, requiere acceso de root para funcionar. Sin embargo, no hay ninguna razón por la que la

source: execution of an analysis should require root access for the user. This is especially important when computations are
es: ejecución de un análisis deba requerir el acceso de root para el usuario. Esto es especialmente importante cuando los cálculos son

source: conducted on shared resource like HPC systems where users will never have root access.
es: realizados en recursos compartidos como los sistemas HPC en los que los usuarios nunca tendrán acceso de root.

source: The [singularity](https://www.sylabs.io/) container software was introduced to address exactly this issue. Singularity
es: El software de contenedores [singularity](https://www.sylabs.io/) se introdujo para resolver exactamente este problema. Singularity

source: was created with HPC sytems and reproducible research in mind (see [this](https://www.youtube.com/watch?v=DA87Ba2dpNM)
es: se creó pensando en los sistemas HPC y en la investigación reproducible (véase [este](https://www.youtube.com/watch?v=DA87Ba2dpNM)

source: video). It does not require root access to run (only to build container _images_!) and thus enables HPC users to locally
es: vídeo). No requiere acceso de root para ejecutarse (¡sólo para construir las _imágenes_ del contenedor!) y, por lo tanto, permite a los usuarios de HPC

source: build container images before running analyses, for example, on a high-performance cluster. As an added benefit, this makes it
es: hacer build local de las imágenes de los contenedores antes de correr análisis, por ejemplo, en un cluster de alto desempeño. Como ventaja adicional, esto hace

source: possible to use almost any software on an HPC system without having to bother admin staff with installing it. In
es: posible utilizar casi cualquier software en un sistema HPC sin tener que molestar al personal de administración con su instalación.

source: recognition of the fact that Docker is _the_ most well known containerization approach, singularity aims at maintaining
es: reconocimiento del hecho de que Docker es _el_ enfoque de contenerización más conocido, la singularidad tiene como objetivo mantener

source: compatibility with docker containers as much as possible, meaning that singularity can be used to run normal docker containers
es: compatibilidad con los contenedores docker en la medida de lo posible, lo que significa que singularity puede utilizarse para ejecutar contenedores docker normales

source: (without requiring root access!).
es: (¡sin requerir acceso root!).

source: Singularity can be used to run Docker images or extend them by building new images based on docker containers as base
es: Singularity puede utilizarse para ejecutar imágenes Docker o ampliarlas construyendo nuevas imágenes basadas en contenedores Docker como base

source: layer. For instance, we could use singularity to spin up a vanilla ubuntu container and getting a shell in it using the
es: capa. Por ejemplo, podríamos usar singularity para hacer girar un contenedor vanilla ubuntu y obtener un shell en él usando el

source: (type `exit` to leave the interactive shell again).
es: (escriba `exit` (salir) para volver a salir del shell interactivo).

source: Just as docker images are built using `Dockerfile` files, singularity containers are built from singularity definition
es: Al igual que las imágenes Docker se construyen utilizando archivos `Dockerfile`, los contenedores singularity se construyen a partir de la definición de singularity

source: files. The process and syntax is similar to docker files but there are subtle differences. As a minimal working example,
es: archivos. El proceso y la sintaxis son similares a los archivos Docker, pero hay sutiles diferencias. Como ejemplo de trabajo mínimo,

source: we can build a 'lolcow' container based on the official ubuntu docker container image. Put the following in a
es: podemos construir un contenedor 'lolcow' basado en la imagen oficial de contenedores de ubuntu. Poner lo siguiente en un

source: `lolcow.def` file (based on the
es: `lolcow.def` file (basado en el

source: [Singularity documentation](https://www.sylabs.io/guides/3.2/user-guide/build_a_container.html)):
es: [Documentación sobre la singularidad](https://www.sylabs.io/guides/3.2/user-guide/build_a_container.html):

source: This 'recipe' uses a docker image as basis (here: ubuntu) installs a few apt packages, modifies a few environment
es: Esta 'receta' utiliza una imagen docker como base (aquí: ubuntu) instala unos cuantos paquetes apt, modifica unos cuantos entornos

source: variables, and specifies the runscript (which is executed using the `singularity run` command). Details on the
es: y especifica el script de ejecución (que se ejecuta con el comando `singularity run`). Los detalles sobre el

source: singularity definition file format can be found in the official [documentation](https://www.sylabs.io/docs/).
es: El formato del archivo de definición de singularidad puede encontrarse en la [documentación] oficial (https://www.sylabs.io/docs/).

source: A container image can then be built (requiring root!) via
es: A continuación, se puede construir una imagen de contenedor (¡requiere root!) a través de

source: This will pull the ubuntu image from dockerhub, run the steps of the recipe in the definition file and produce a single
es: Esto sacará la imagen de ubuntu de dockerhub, ejecutará los pasos de la receta en el archivo de definición y producirá un único

source: output image file (`lolcow.simg`). Finally the runscript is executed as
es: archivo de imagen de salida (`lolcow.simg`). Por último, el script de ejecución se ejecuta como

source: Ideally, you should see a nice ASCII cow and a few words of wisdom, as in
es: Lo ideal sería ver una bonita vaca ASCII y unas cuantas palabras de sabiduría, como en

source: Being HPC compatible, singularity containers are also supported by a wide range of workflow management tools. For
es: Al ser compatibles con HPC, los contenedores de singularidad también son compatibles con una amplia gama de herramientas de gestión del flujo de trabajo. Para

source: example, both [snakemake](https://snakemake.readthedocs.io/en/stable/) and
es: ejemplo, tanto [snakemake](https://snakemake.readthedocs.io/en/stable/) como

source: [nextflow](https://www.nextflow.io/docs/latest/singularity.html) support job-specific singularity containers. This makes
es: [nextflow](https://www.nextflow.io/docs/latest/singularity.html) soportan contenedores de singularidad específicos para cada trabajo. Esto hace que

source: singularity containers uniquely suited for parallelizing workflows on HPC systems using the widely used
es: Los contenedores de singularidad son especialmente adecuados para paralelizar flujos de trabajo en sistemas HPC utilizando el ampliamente utilizado

source: [slurm](https://slurm.schedmd.com/documentation.html) workload manager. Using singularity containers and
es: [slurm](https://slurm.schedmd.com/documentation.html) gestor de cargas de trabajo. Utilizando contenedores de singularidad y

source: snakemake/nextflow is therefore a way of scaling reproducibility to massive scale and - as an added benefit - bringing
es: snakemake/nextflow es, por lo tanto, una forma de escalar la reproducibilidad a escala masiva y -como beneficio adicional- aportar

source: workflows from a desktop machine to an HPC system no longer requires writing custom job submission scripts.
es: Los flujos de trabajo de una máquina de escritorio a un sistema HPC ya no requieren escribir scripts de envío de trabajos personalizados.

source: #### Long-term storage of container images
es: #### Almacenamiento a largo plazo de imágenes de contenedores

source: It is important to note that a mere container recipe file is not reproducible in itself since the build process depends
es: Es importante tener en cuenta que un simple archivo de receta de contenedor no es reproducible en sí mismo, ya que el proceso de construcción depende

source: on various (online) sources. Thus the same recipe file might lead to different images if the underlying sources were
es: en varias fuentes (en línea). Así, el mismo archivo de recetas podría dar lugar a imágenes diferentes si las fuentes subyacentes estuviesen

source: updated.
es: actualizadas.

source: To achieve true reproducibility, it is therefore important to store the actual container _images_. For singularity
es: Por ello, para lograr una verdadera reproducibilidad, es importante almacenar las _imágenes_ reales del contenedor. Para la singularidad

source: images, this is particularly easy since an image is simply a large file. These can vary in size from a few tens of
es: imágenes, esto es particularmente fácil ya que una imagen es simplemente un archivo grande. Su tamaño puede variar desde unas decenas de

source: megabytes (microcontainers) to several gigabyte and are therefore not suited for being stored in a git repository
es: megabytes (microcontenedores) a varios gigabytes y, por tanto, no son adecuados para ser almacenados en un repositorio git

source: themselves. A free, citable, and long-term solution to storing container images is [zenodo.org](https://zenodo.org/)
es: ellos mismos. Una solución gratuita, citable y a largo plazo para almacenar imágenes de contenedores es [zenodo.org](https://zenodo.org/)

source: which allows up to 50 Gb per repository. Since zenodo is minting DOIs for all content uploaded, the images are
es: que permite hasta 50 Gb por repositorio. Como zenodo está acuñando DOIs para todo el contenido subido, las imágenes son

source: immediately citable. In contrast to [dockerhub](https://hub.docker.com/) (which also only accepts docker images)
es: inmediatamente citable. A diferencia de [dockerhub](https://hub.docker.com/) (que también acepta sólo imágenes docker)

source: zenodo.org is also clearly geared towards long-term storage and discoverability via a sophisticated metadata system and
es: zenodo.org también está claramente orientado al almacenamiento a largo plazo y a la capacidad de descubrimiento mediante un sofisticado sistema de metadatos y

source: thus ideally suited for storing scientific containers associated with particular analyses since these tend to not change
es: por lo tanto, es ideal para almacenar contenedores científicos asociados a análisis particulares, ya que éstos tienden a no cambiar

source: over time.
es: a lo largo del tiempo.

source: #### Words of Warning
es: #### Palabras de advertencia

source: Even though singularity and docker might look similar, they are conceptually very different. Besides the obvious fact
es: Aunque singularity y docker puedan parecer similares, son conceptualmente muy diferentes. Además del hecho obvio

source: that singularity does not require root access to run containers, it also handles the distinction between the host and
es: que la singularidad no requiere acceso root para ejecutar contenedores, también maneja la distinción entre el host y

source: container file system differently. For instance, by default singularity includes a few bind points in the container,
es: sistema de archivos del contenedor de manera diferente. Por ejemplo, por defecto Singularity incluye algunos puntos de enlace en el contenedor,

source: namely:
es: a saber:

source: Note, `$PWD` comes in handy since it implies that all files in the working directory are visible within the container.
es: Ten en cuenta que `$PWD` es muy útil ya que implica que todos los archivos del directorio de trabajo son visibles dentro del contenedor.

source: Binding `$HOME` by default, however, also implies that software using configuration files from `$HOME` might behave in
es: Sin embargo, la vinculación de `$HOME` por defecto, también implica que el software que utiliza los archivos de configuración de `$HOME` podría comportarse de
