Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/reproducible_environments.*.po
Languages: es

source: an unexpected way since the image specific configuration files are overwritten with the current users settings in
es: una forma inesperada, ya que los archivos de configuración específicos de la imagen se sobrescriben con la configuración actual de los usuarios en

source: `$HOME`. While this behaviour is handy in HPC scenarios, it is potentially dangerous for reproducible research. To avoid
es: `$HOME`. Si bien este comportamiento es útil en escenarios de HPC, es potencialmente peligroso para la investigación reproducible. Para evitar

source: potential issues, any software installed in a singularity container should be pointed to a global, user-independent
es: problemas potenciales, cualquier software instalado en un contenedor de singularidad debe apuntar a un

source: configuration files.
es: archivos de configuración.

source: ## Checklist
es: ## Lista de verificación

source: - [ ] Choose the most appropriate method for your project for capturing your computational environment
es: - [ ] Elige el método más apropiado para tu proyecto para capturar tu entorno computacional

source: - [ ] Capture your computational environment
es: - [ ] Capturar su entorno computacional

source: - [ ] Share your captured computational environment along with your results/analysis
es: - [ ] Comparta su entorno computacional capturado junto con sus resultados/análisis

source: ## What to learn next
es: ## ¿Qué aprender a continuación?

source: We recommend reading the chapter on testing, and then the chapter on continuous integration. Note that the chapter on version control is a prerequisite for the chapter on continuous integration. The open research chapter also contains further information on sharing research reproducibly.
es: Recomendamos leer el capítulo sobre las pruebas y, a continuación, el capítulo sobre la integración continua. Ten en cuenta que el capítulo sobre el control de versiones es un requisito previo para el capítulo sobre la integración continua. El capítulo sobre investigación abierta también contiene más información sobre cómo compartir la investigación de forma reproducible.

source: ## Further reading
es: ## Lecturas complementarias

source: The [Docker documentation](https://docs.docker.com/get-started/) contains a lot of information about containers in general.
es: La [documentación de Docker](https://docs.docker.com/get-started/) contiene mucha información sobre los contenedores en general.

source: ## Definitions/glossary
es: ## Definiciones/glosario

source: **Binder:** A web-based service which allows users to upload and share fully-functioning versions of their projects in an environment they define.
es: **Binder:** Un servicio basado en la web que permite a los usuarios cargar y compartir versiones totalmente funcionales de sus proyectos en un entorno que ellos definen.

source: **Computational environment:** Features of a computer which can impact the behaviour of work done on it, such as its operating system, what software it has installed, and what versions of software packages are installed.
es: **Entorno informático:** Características de un ordenador que pueden influir en el comportamiento del trabajo realizado en él, como su sistema operativo, el software que tiene instalado y las versiones de los paquetes de software instalados.

source: ## Bibliography
es: ## Bibliografía

source: ## Prerequisites / recommended skill level
es: ## Pre-requisitos / nivel de conocimiento recomendado

source: - [Summary](#Summary)
es: - [Resumen](#Summary)

source: ## Summary
es: ## Resumen

source: ## How this will help you/ why this is useful
es: ## Cómo te ayudará esto/ por qué esto es útil
