Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/reproducible_environments.*.po
Languages: es

source: are a more robust way of sharing reproducible research than, for instance, package management systems or Binder because
es: son una forma más sólida de compartir la investigación reproducible que, por ejemplo, los sistemas de gestión de paquetes o Binder porque

source: they reproduce the entire system used for the research, not just the packages explicitly used by it. Their major
es: reproducen todo el sistema utilizado para la investigación, no sólo los paquetes que utiliza explícitamente. Su mayor

source: downside is that due to their greater depth they are conceptually more difficult to grasp and produce than many other
es: inconveniente es que, debido a su mayor profundidad, son conceptualmente más difíciles de comprender y producir que muchos otros

source: methods of replicating computational environments.
es: métodos de replicación de entornos informáticos.

source: Ben Corrie give as reasonably accessible overview on core concepts in
es: Ben Corrie ofrece una visión general razonablemente accesible de los conceptos básicos (en inglés) en

source: ['What is a container?'](https://www.youtube.com/watch?v=EnJ7qX9fkcU).
es: ['¿Qué es un contenedor?'](https://www.youtube.com/watch?v=EnJ7qX9fkcU).

source: ### What are images?
es: ### ¿Qué son las imágenes?

source: Images are the files used to generate containers. Humans don't make images, they write the recipes to generate images.
es: Las imágenes son los archivos utilizados para generar contenedores. Los humanos no hacen imágenes, escriben las recetas para generar imágenes.

source: Containers are then identical copies instantiated from images.
es: Los contenedores son entonces copias idénticas instanciadas a partir de imágenes.

source: Think of it like this:
es: Piénsalo así:

source: - A recipe file a human writes contains all the steps to generate a working version of the project and its computational
es: - Un archivo de recetas que un humano escribe contiene todos los pasos para generar una versión de trabajo del proyecto y su entorno computacional

source: environment, but no actual materials. Think of this as like a blueprint.
es: , pero sin materiales reales. Piensa en esto como en un esquema.

source: - Building an image takes that recipe and using it assembles all the packages, software libraries, and configurations
es: - La construcción de una imagen toma esa receta y con ella ensambla todos los paquetes, bibliotecas de software y configuraciones

source: needed to make the fully fledged project and environment and bundles them up in a condensed lump. Think of images like
es: necesarias para realizar el proyecto y el entorno completos y los agrupa en un bulto condensado. Piensa en imágenes como

source: a bit of flat pack furniture made using the blueprint.
es: un mueble para ensamblar hecho con ese esquema.

source: - Containers take that image and assemble a full working version of the project and the environment needed to run it.
es: - Los contenedores toman esa imagen y montan una versión completa de trabajo del proyecto y el entorno necesario para ejecutarlo.

source: Think of this as assembling the bit of flat pack furniture.
es: Piensa en esto como el montaje de un mueble para ensamblar.

source: So if a researcher wants to allow others to reproduce their work they would need to write a recipe file, and use it to
es: Por lo tanto, si un investigador quiere permitir que otros reproduzcan su trabajo, tendrá que escribir un archivo de recetas y utilizarlo para

source: build an image of their project. They can then share this image file with anyone who wants to replicate their work. That
es: construir una imagen de su proyecto. A continuación, pueden compartir este archivo de imagen con cualquiera que quiera replicar su trabajo. Que

source: person can then use the image to generate a container containing a working version of the project.
es: puede utilizar la imagen para generar un contenedor que contenga una versión de trabajo del proyecto.

source: ### What is Docker?
es: ### ¿Qué es Docker?

source: There are a number of different tools available for creating and working with containers. We will focus on Docker, which
es: Hay varias herramientas disponibles para crear y trabajar con contenedores. Nos centraremos en Docker, que

source: is widely used, but be aware that others such as Singularity also exist. Singularity is sometimes preferred for use on
es: es muy utilizado, pero hay que tener en cuenta que también existen otros como Singularity. A veces se prefiere Singularity para su uso en

source: HPC systems as it does not need `sudo` permissions to be run, while Docker does.
es: sistemas de computación de alto rendimiento ya que no necesita permisos `sudo` para ser ejecutado, mientras que Docker sí.

source: In Docker the recipe files used to generate images are known as Dockerfiles, and should be named "Dockerfile".
es: En Docker los archivos de recetas utilizados para generar imágenes se conocen como Dockerfiles, y deben llamarse "Dockerfile".

source: [DockerHub](https://hub.docker.com/) hosts a great many pre-made images which can be downloaded and build upon, such as
es: [DockerHub](https://hub.docker.com/) aloja una gran cantidad de imágenes prefabricadas que pueden descargarse y construirse a partir de ellas, como por ejemplo

source: [images](https://hub.docker.com/_/ubuntu) of Ubuntu machines. This makes the process of writing Dockerfiles relatively
es: [imágenes](https://hub.docker.com/_/ubuntu) de las máquinas Ubuntu. Esto hace que el proceso de escribir Dockerfiles sea relativamente

source: easy since users very rarely need to start from scratch, they can just customise existing images. However, this does
es: fácil, ya que los usuarios rara vez tienen que empezar de cero, sólo pueden personalizar las imágenes existentes. Sin embargo, esto

source: leave a user vulnerable to similar security issues as were described in the section on [YAML files](#Security_issues):
es: dejan al usuario vulnerable a problemas de seguridad similares a los descritos en la sección sobre [archivos YAML](#Cuestiones_de_seguridad):

source: - It is possible to include malicious code in Docker images
es: - Es posible incluir código malicioso en las imágenes Docker

source: - It is possible for people producing images to unknowingly include software in them with security vulnerabilities
es: - Es posible que las personas que producen imágenes incluyan en ellas, sin saberlo, software con vulnerabilidades de seguridad

source: [This](https://opensource.com/business/14/7/docker-security-selinux) article goes deeper into the potential security
es: [Este](https://opensource.com/business/14/7/docker-security-selinux) artículo profundiza en las potenciales

source: vulnerabilities of containers and here is a
es: vulnerabilidades de los contenedores y aquí hay un

source: [detailed breakdown](https://opensource.com/business/14/9/security-for-docker) of security features currently within
es: [desglose detallado](https://opensource.com/business/14/9/security-for-docker) de los elementos de seguridad actualmente en

source: Docker, and how they function. The best advice for using images built by others is as standard- only download and run
es: Docker y su funcionamiento. El mejor consejo para el uso de imágenes construidas por otros es el estándar - sólo descargar y ejecutar

source: something on your machine if it comes from a trusted source. DockerHub has "official image" badges for commonly used,
es: algo en su máquina si proviene de una fuente de confianza. DockerHub tiene insignias de "imagen oficial" para las de uso común,

source: verified images as shown here:
es: imágenes verificadas como se muestra aquí:

source: ### Installing Docker
es: ### Instalar Docker

source: Installers for Docker on a variety of different systems are available [here](https://docs.docker.com/install/). Detailed
es: Los instaladores para Docker en una variedad de sistemas diferentes están disponibles [aquí](https://docs.docker.com/install/). Detallado

source: installation instructions are also available for a variety of operating systems such as
es: Las instrucciones de instalación también están disponibles para una variedad de sistemas operativos como

source: ### Key commands
es: ### Comandos clave

source: Here are a few key commands for creating and working with containers.
es: A continuación se presentan algunos comandos clave para crear y trabajar con contenedores.

source: - To build an image from a Dockerfile go to the directory where the Dockerfile is and run:
es: - Para construir una imagen a partir de un Dockerfile ve al directorio donde está el Dockerfile y ejecuta:

source: - To list the images on your system use
es: - Para mostrar las imágenes de su sistema utilice

source: - To remove an image run
es: - Para eliminar una imagen ejecute

source: - To open a container from an image run
es: - Para abrir un contenedor desde una imagen ejecute

source: The `-i -t` flags automatically open up an interactive terminal within the container so you can view and interact with
es: Las opciones `-i -t` abren automáticamente un terminal interactivo dentro del contenedor para que pueda ver e interactuar con

source: the project files.
es: los archivos del proyecto.

source: - To exit an interactive terminal use the command `exit`.
es: - Para salir de un terminal interactivo utiliza el comando `exit`.

source: - To get a list of active containers with IDs run
es: - Para obtener una lista de contenedores activos con IDs ejecuta

source: - There are also three main commands used for changing the status of containers:
es: - También hay tres comandos principales utilizados para cambiar el estado de los contenedores:

source: - Pausing suspends the process running the container.
es: - La pausa suspende el proceso que ejecuta el contenedor.

source: Containers can be unpaused by replacing `pause` with `unpause`.
es: Los contenedores se pueden desactivar sustituyendo `pause` por `unpause`.

source: - Stopping a container terminates the process running it. A container must be stopped before it can be deleted.
es: Los contenedores se pueden desactivar sustituyendo `pause` por `unpause`.

source: A stopped container can be restarted by replacing `stop` with `restart`.
es: Un contenedor detenido puede reiniciarse sustituyendo `stop` por `restart`.

source: - If `stop` does not work containers can be killed using
es: - Si `stop` no funciona los contenedores pueden ser eliminados usando

source: - To remove a container run
es: - Para eliminar un contenedor ejecuta

source: Let's go through the anatomy of a very simple Dockerfile:
es: Repasemos la anatomía de un archivo Docker muy sencillo:

source: ``` # Step 1: Set up the computational environment # Set the base image FROM ubuntu # Install packages needed to run the project RUN apt-get update RUN apt-get install sudo RUN sudo apt-get update RUN sudo apt-get install -y python3.7 RUN sudo apt-get install -y python3-pip RUN pip3 install numpy #----------------------- # Step 2: Include the project files in the image # Make a directory called "project" to hold the project files RUN mkdir project # Copy files from the project_files directory on the machine building the image # into the "project" directory created by the previous line of code COPY project_files/* project/ ```
es: ``` # Paso 1: Configurar el entorno computacional # Configurar la imagen base FROM ubuntu # Instalar los paquetes necesarios para ejecutar el proyecto RUN apt-get update RUN apt-get install sudo RUN sudo apt-get update RUN sudo apt-get install -y python3.7 RUN sudo apt-get install -y python3-pip RUN pip3 install numpy #----------------------- # Paso 2: Incluir los archivos del proyecto en la imagen # Crea un directorio llamado "project" para guardar los archivos del proyecto RUN mkdir project # Copiar los archivos del directorio project_files en la máquina que construye la imagen # en el directorio "project" creado por la línea de código anterior COPY project_files/* project/ ```

source: This looks complicated, but most of the lines in this example are comments (which are preceded by `#`s), There are only
es: Esto parece complicado, pero la mayoría de las líneas de este ejemplo son comentarios (que están precedidos por `#`s), Sólo hay

source: nine lines of actual code. The first of these is a `FROM` statement specifying a base image. All Dockerfiles require a
es: nueve líneas de código real. La primera de ellas es una declaración `FROM` que especifica una imagen base. Todos los archivos Docker requieren un

source: FROM, even if it's just `FROM SCRATCH`. All the following commands in a Dockerfile build upon the base image to make a
es: FROM, aunque sólo sea `FROM SCRATCH`. Todos los siguientes comandos en un Dockerfile se basan en la imagen base para hacer un

source: functioning version of the researcher's project.
es: versión funcional del proyecto.

source: It is worth spending time carefully choosing an appropriate base image as doing do can reduce the amount of work
es: Merece la pena dedicar tiempo a elegir cuidadosamente una imagen de base adecuada, ya que hacerlo puede reducir la cantidad de trabajo

source: involved in writing a Dockerfile dramatically. For example a collection of images with the R programming language
es: que supone escribir un Dockerfile de forma dramática. Por ejemplo, una colección de imágenes con el lenguaje de programación R

source: included in them can be found [here](https://github.com/rocker-org/rocker-versioned). If a project makes use of R it is
es: incluido en ellos puede encontrarse [aquí](https://github.com/rocker-org/rocker-versioned). Si un proyecto hace uso de R es

source: convenient to use one of these as a base image rather than spend time writing commands in your Dockerfile to install R.
es: es conveniente usar una de estas como imagen base en lugar de gastar tiempo escribiendo comandos en su Dockerfile para instalar R.

source: The biggest block of lines comes next, it's a series of `RUN` statements, which run shell command when building the
es: El bloque más grande de líneas viene a continuación, es una serie de sentencias `RUN`, que ejecutan el comando shell al construir el

source: image. In this block they are used to install the software necessary to run the project. Run commands can also be
es: imagen. En este bloque se utilizan para instalar el software necesario para ejecutar el proyecto. Los comandos de ejecución también pueden ser

source: chained as follows if desired:
es: encadenado de la siguiente manera si se desea:

source: Another RUN statement is used to run the shell command `RUN mkdir project` which makes a directory called project in the
es: Otra sentencia RUN se utiliza para ejecutar el comando de shell `RUN mkdir project` que crea un directorio llamado `project` en el

source: container to host the files related to this project.
es: para alojar los archivos relacionados con este proyecto.

source: Finally the `COPY` command is used to copy the project files from the machine building the image into the image itself.
es: Por último, el comando `COPY` se utiliza para copiar los archivos del proyecto de la máquina que construye la imagen en la propia imagen.

source: The syntax of this command is `COPY file_to_copy location_in_container_to_copy_to`. In this example all the files in the
es: La sintaxis de este comando es `COPY file_to_copy location_in_container_to_copy_to`. In this example all the files in the

source: "project_files" directory are included in the "project" file in the container. Note that you can only copy files from
es: El fichero «project files» está dentro del fichero «project» en el contenedor. Nota que solo puedes copiar archivos del

source: the directory where the Dockerfile is located, or subdirectories within it (in the example given here the project_files
es: fichero donde se encuentra el Dockerfile, o los subdirectorios dentro de él (en el ejemplo dado aquí el subdirectorio «project_files»).

source: subdirectory).
es: subdirectorio).

source: The `ADD` command has the same capabilities as `COPY`, but it can also be used to add files not on the machine building
es: El comando `ADD` tiene las mismas capacidades que `COPY`, pero también se puede utilizar para añadir archivos que no están en la máquina

source: the image. For example it can be used to include files hosted online by following ADD with a URL to the file. It is good
es: que hace el build de la imagen. Por ejemplo, se puede utilizar para incluir archivos alojados en línea siguiendo a ADD con una URL del archivo. Es buena

source: practice to use `COPY` except where `ADD` is specifically required as the term `COPY` is more explicit about what is
es: práctica utilizar `COPY` excepto cuando se requiera específicamente `ADD` ya que el término `COPY` es más explícito sobre lo que está

source: being done.
es: siendo hecho.

source: Here's what happens if a container is opened from an image called book_example built from the example above:
es: Esto es lo que ocurre si se abre un contenedor desde una imagen llamada book_example que resulta del build del ejemplo anterior:

source: As you can see the directory "project" has been created, and if we look inside the project files "analysis.py" and
es: Como puedes ver se ha creado el directorio «project», y si miramos dentro de los archivos del proyecto «analysis.py» y

source: "data.csv" have been copied into it. Because the software required for the project has already been included by the
es: «data.csv» se han copiado en él. Como el software necesario para el proyecto ya ha sido incluido por el

source: Dockerfile in the image the "analysis.py" script runs without any further software needing to be installed.
es: Dockerfile en la imagen el script «analysis.py» se ejecuta sin necesidad de instalar ningún otro software.

source: This command can be used in Dockerfiles to change the current working directory. Commands that follow this in the
es: Este comando se puede utilizar en Dockerfiles para cambiar el directorio de trabajo actual. Los comandos que siguen en el

source: Dockerfile will be applied within the new working directory unless/until another WORKDIR changes the working directory.
es: Dockerfile se aplicarán dentro del nuevo directorio de trabajo hasta que otro WORKDIR cambie el directorio de trabajo.

source: When a container is opened with an interactive terminal the terminal will open in the final working directory. Here's a
es: Cuando se abre un contenedor con un terminal interactivo, el terminal se abrirá en el directorio de trabajo final. Aquí un

source: simple example of a Dockerfile that uses `WORKDIR`, and the container it generates.
es: ejemplo sencillo de un Dockerfile que utiliza `WORKDIR`, y el contenedor que genera.

source: Directories B_1 and B_2 have been created within directory A.
es: Los directorioes B_1 and B_2 han sido creados dentro del directorio A.

source: WORKDIR should be used whenever changing directories is necessary when building an image. It may be tempting to use
es: WORKDIR debe utilizarse siempre que sea necesario cambiar de directorio al hacer el build una imagen. Puede ser tentador utilizar

source: `RUN cd directory_name` instead as this syntax will be more familiar to those that commonly work via the command line,
es: `RUN cd nombre_de_directorio` en su lugar, ya que esta sintaxis será más familiar para aquellos que suelen trabajar a través de la línea de comandos,

source: but this can lead to errors. After each `RUN` statement in a Dockerfile the image is saved, any following commands are
es: pero esto puede dar lugar a errores. Después de cada declaración `RUN` en un Dockerfile se guarda la imagen, cualquier comando siguiente es

source: applied to the image anew. As an example here is what happens in the above example if the `WORKDIR A` line is swapped
es: aplicado a la imagen de nuevo. A modo de ejemplo, esto es lo que ocurre en el ejemplo anterior si se intercambia la línea `WORKDIR A`

source: for `RUN cd A`
es: con `RUN cd A`.

source: All the directories have are in the top level in this case, rather than B_1 and B_2 being inside A. This is because the
es: Todos los directorios están en el nivel superior en este caso, en lugar de que B_1 y B_2 estén dentro de A. Esto es porque la

source: image was restarted after the `RUN cd A` command and opened at the top (root) level by default, so that is where the
es: imagen se reinició tras el comando `RUN cd A` y se abrió en el nivel superior (root) por defecto, por lo que es ahí donde los

source: `mkdir B_1` and `mkdir B_2` commands took effect.
es: comandos `mkdir B_1` y `mkdir B_2` surtieron efecto.

source: #### Other commands
es: #### Otros comandos

source: Other commands that are sometimes used in Dockerfiles include:
es: Otros comandos que a veces se utilizan en Dockerfiles son:

source: - `CMD`: This is used to run commands as soon as the container is opened. To clarify this is different to RUN commands
es: - `CMD`: Se utiliza para ejecutar comandos tan pronto como se abre el contenedor. Para aclarar, esto es diferente a los comandos RUN,

source: which are commands run as part of _setting up_ a container. For example to have a welcome message when a container is
es: que son comandos que se ejecutan como parte de la _configuración_ de un contenedor. Por ejemplo, para tener un mensaje de bienvenida cuando un contenedor es

source: opened from the image CMD could be used as follows:
es: abierto de la imagen, CMD podría ser utilizado de la siguiente manera:

source: ``` CMD ["echo","Welcome! You just opened this container!"] ```
es: ``` CMD ["echo","¡Enhorabiuena! ¡Acabas de abrir este contenedor!"] ```

source: It's good practice to use CMD for any commands that need to be run before someone starts working in the container
es: Es una buena práctica utilizar CMD para cualquier comando que deba ejecutarse antes de que alguien comience a trabajar en el contenedor

source: instead of forcing users to run them themselves (and trusting that they will even know that they need to).
es: en lugar de obligar a las personas usuarias a ejecutarlos ellas mismas (y confiar en que sabrán siquiera que lo necesitan).

source: - `VOLUMES`: These will be discussed [later](#Volumes).
es: - `VOLUMES`: Serán discutidos [más tarde](#Volumes).

source: - `MAINTAINER`: information regarding the person that wrote the Dockerfile. Typically included at the top of a
es: - `MAINTAINER`: información sobre la persona que escribió el Dockerfile. Normalmente se incluye en la parte superior de un

source: - `EXPOSE`: This includes ports that should be exposed, this is more relevant to people using Docker to share web apps.
es: - `EXPOSE`: esto incluye puertos que deben ser expuestos, esto es más relevante para quienes usan Docker para compartir aplicaciones web.

source: - `USER`: Change the user that a command is run as (useful for dropping privileges).
es: - `USER`: Cambia el usuario con el que un comando corre (útil para quitar privilegios).

source: ### Building images and .dockerignore files
es: ### Hacer el build de las imágenes y el fichero .dockerignore

source: As mentioned in the [key commands](#Key_commands) section, to build an image open a terminal in the same directory as
es: Como se mencionó en la sección [comandos clave](#key_commands), para construir una imagen, abre un terminal en el mismo directorio en el que

source: the Dockerfile to be used and run
es: se encuentra el Dockerfile a usar y corre:

source: When an image is built everything in the Dockerfile's directory and below (this is called the "context") is sent to the
es: Cuando se hace el build de una imagen, todo lo que hay en el directorio del Dockerfile y adentro (esto se llama el "context" (contexto)) se envía al
