Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/reproducible_environments.*.po
Languages: es

source: This allows researchers to easily reproduce one another's computational environments. Note that the list of packages is not just those explicitly installed. It can include OS-specific dependency packages so environment files may require some editing to be portable to different operating systems.
es: Esto permite a los investigadores reproducir fácilmente los entornos computacionales de los demás. Ten en cuenta que la lista de paquetes no son solo los instalados explícitamente. Puedes incluir paquetes de dependencia específicos del sistema operativo, por lo que los archivos de entorno pueden requerir cierta edición para ser portátiles a diferentes sistemas operativos.

source: Environments can also be cloned. This may be desirable, for example, if a researcher begins a new project and wants to make a new environment to work on it in, but the new project's environment (at least initially) requires the same packages as a previous project's environment.
es: Los entornos también se pueden clonar. Esto puede ser deseable, por ejemplo, si un investigador comienza un nuevo proyecto y quiere crear un nuevo entorno para trabajar en él, pero el entorno del nuevo proyecto (al menos inicialmente) requiere los mismos paquetes que el entorno de un proyecto anterior.

source: For example to clone the Project_One environment, and give this new environment the name Project_Two:
es: Por ejemplo, para clonar el entorno Proyecto_Uno y darle a este nuevo entorno el nombre Proyecto_Dos:

source: ``` conda create --name Project_Two --clone Project_One ```
es: ``` conda create --name Proyecto_Dos --clone Proyecto_Uno ```

source: ## YAML files
es: ## Archivos YAML

source: YAML is an indentation-based markup language which aims to be both easy to read and easy to write. Many projects use it for configuration files because of its readability, simplicity and good support for many programming languages. It can be used for a great many things including defining computational environments, and is well integrated with [Travis](https://travis-ci.org/) which is discussed in the chapter on continuous integration.
es: YAML es un lenguaje de marcado basado en la indentación que pretende ser fácil de leer y de escribir. Muchos proyectos lo utilizan para los archivos de configuración debido a su legibilidad, simplicidad y buen soporte para muchos lenguajes de programación. Puede utilizarse para muchas cosas, incluida la definición de entornos informáticos, y está bien integrado con [Travis](https://travis-ci.org/), que se examina en el capítulo sobre integración continua.

source: An a YAML file defining a computational environment might look something like this:
es: Un archivo YAML definiendo un ambiente computacional podría verse así:

source: ``` # Define the operating system as Linux os: linux # Use the xenial distribution of Linux dist: xenial # Use the programming language Python language: python # Use version of Python 3.2 python: 3.2 # Use the Python package numpy and use version 1.16.1 packages: numpy: version: 1.16.1 ```
es: ``` # Definir el sistema operativo como Linux os: linux # Usar la distribución xenial de Linux dist: xenial # Usar el lenguaje de programación Python language: python # Usar la versión de Python 3.2 python: 3.2 # Usar el paquete Python numpy y usar la versión 1.16.1 packages: numpy: version: 1.16.1 ```

source: Note that as you can see here that comments can be added by preceding them with a `#`.
es: Note que como puedes ver aquí, los comentarios pueden ser añadidos precediéndolos con un "#".

source: ### YAML syntax
es: ### Sintaxis YAML

source: A YAML document can consist of the following elements.
es: Un documento YAML puede constar de los siguientes elementos.

source: #### Scalars
es: #### Escalares

source: Scalars are ordinary values: numbers, strings, booleans.
es: Los escalares son valores ordinarios: números, cadenas de caracteres, booleanos.

source: ``` number-value: 42 floating-point-value: 3.141592 boolean-value: true # strings can be both 'single-quoted` and "double-quoted" string-value: 'Bonjour' ```
es: ``` valor-numerico: 42 valor-de-punto-flotante: 3.141592 valor-booleano: verdadero # Las cadenas de caracteres pueden ser tanto 'de cita simple' como "de cita doble" valor-de-cadena-de-caracteres: 'Bonjour' ```

source: YAML syntax also allows unquoted string values for convenience reasons:
es: La sintaxis YAML también permite cadena de caracteres sin comillas por razones de conveniencia:

source: ``` unquoted-string: Hello World ```
es: ``` cadena-sin-comillas: Hello World ```

source: #### Lists and Dictionaries
es: #### Listas y diccionarios

source: Lists are collections of elements:
es: Las listas son colecciones de elementos:

source: Every element of the list is indented and starts with a dash and a space.
es: Cada elemento de la lista está indentado y comienza con un guión y un espacio.

source: Dictionaries are collections of `key: value` mappings. All keys are case-sensitive.
es: Los diccionarios son colecciones de asociaciones entre "llaves: valor". Todas las llaves son sensibles a las mayúsculas y minúsculas.

source: Note that a space after the colon is mandatory.
es: Ten en cuenta que un espacio después de la coma es obligatorio.

source: #### YAML gotchas
es: #### Ambigüedades con los archivos YAML

source: Due to the format aiming to be easy to write and read, there're some ambiguities in YAML.
es: Debido al formato que pretende ser fácil de escribir y leer, hay algunas ambigüedades en YAML.

source: - **Special characters in unquoted strings:** YAML has a number of special characters you cannot use in unquoted strings. For example, parsing the following sample will fail:
es: - **Caracteres especiales en cadenas de caracteres sin comillas:** YAML tiene una serie de caracteres especiales que no se pueden usar en cadenas de caracteres sin comillas. Por ejemplo, el análisis sintáctico de la siguiente muestra fallará:

source: ``` unquoted-string: let me put a colon here: oops ```
es: ```cadena-de-caracteres-sin-comillas: déjame poner una coma aquí: oops```

source: Quote the string value makes this value unambiguous:
es: Añadirle comillas a esta cadena de caracteres la hace inequívoca:

source: ``` unquoted-string: "let me put a colon here: oops" ```
es: ```cadena-de-caracteres-sin-comillas: "déjame poner una coma aquí: oops" ```

source: Generally, you should quote all strings that contain any of the following characters: `[] {} : > |`.
es: Generalmente, debes citar todas las cadenas que contengan cualquiera de los siguientes caracteres: `[] {} : > |`.

source: - **Tabs versus spaces for indentation:** do _not_ use tabs for indentation. While resulting YAML can still be valid, this can be a source of many subtle
es: - **Tab vs. espacios para la indentación:** no _no_ usar la tecla Tab para la indentación. Mientras que el YAML resultante puede ser válido, esto puede ser una fuente de muchos sutiles

source: parsing errors. Just use spaces.
es: errores. Sólo usa los espacios.

source: ### How to use YAML to define computational environments
es: ### Cómo usar YAML para definir entornos computacionales

source: Because of their simplicity YAML files can be hand written. Alternatively they can be automatically generated as discussed [above](#Package_management_systems). From a YAML file a computational environment can be replicated in a few ways.
es: Debido a su simplicidad, los archivos YAML se pueden escribir a mano. Alternativamente, se pueden generar automáticamente como se discutió [arriba] (# Package_management_systems). Desde un archivo YAML, un entorno computacional se puede replicar de varias formas.

source: - **Manually.** It can be done manually by carefully installing the specified packages. Because YAML files can also specify operating systems and versions that may or may not match that of the person trying to replicate the environment this may require the use of a [virtual machine](#Virtual_machines).
es: - ** Manualmente. ** Se puede hacer manualmente instalando cuidadosamente los paquetes especificados. Debido a que los archivos YAML también pueden especificar sistemas operativos y versiones que pueden o no coincidir con los de la persona que intenta replicar el entorno, esto puede requerir el uso de una [máquina virtual] (#Virtual_machines).

source: - **Via package management systems such as Conda.** As [discussed](#Package_management_systems) as well as being able to generate YAML files from computational environments Conda can also generate computational environments from YAML files.
es: - ** A través de sistemas de administración de paquetes como Conda. ** Como [discutido] (#Package_management_systems), además de poder generar archivos YAML desde entornos computacionales, Conda también puede generar entornos computacionales a partir de archivos YAML.

source: ### Security issues
es: ### Temas de seguridad

source: There is an inherent risk in downloading/using files you have not written to your computer, and it is possible to include malicious code in YAML files. Do not load YAML files or generate computational environments from them unless you trust their source.
es: Existe un riesgo inherente al descargar / usar archivos que tú no has escrito en tu computadora, es posible incluir código malicioso en archivos YAML. No cargues archivos YAML ni generes entornos computacionales a partir de ellos a menos que confíes en su fuente.

source: Now that we've seen how to use and capture the computational environment used in a Python project, it's time to think about how to share that environment.
es: Ahora que hemos visto cómo utilizar y capturar el entorno computacional utilizado en un proyecto de Python, es hora de pensar en cómo compartir ese entorno.

source: With an `environment.yml` file (or similar from alternative package management systems), it is possible for others to recreate the environment specified by that file. However, this relies on the new user having the same package management system set up, and knowing how to use it. It would be far easier if there was an automated solution to recreate the computational environment - and this is where Binder comes in.
es: Con un archivo "environment.yml" (o similar de sistemas alternativos de gestión de paquetes), es posible que otros recreen el entorno especificado por ese archivo. Sin embargo, esto depende de que el nuevo usuario tenga configurado el mismo sistema de gestión de paquetes y sepa cómo usarlo. Sería mucho más fácil si existiera una solución automatizada para recrear el entorno informático, y aquí es donde entra Binder.

source: Binder uses a tool called repo2docker to create a Docker image of a project based on the configuration files that are included. The resulting image contains the project and the computational environment specified by the original user. Other users can access the image via a cloud-based BinderHub, which allows them to view, edit and run the code from their web browser.
es: Binder utiliza una herramienta llamada repo2docker para crear una imagen Docker de un proyecto basado en los archivos de configuración que se incluyen. La imagen resultante contiene el proyecto y el entorno de cálculo especificado por el usuario original. Otros usuarios pueden acceder a la imagen a través de un BinderHub basado en la nube, que les permite ver, editar y ejecutar el código desde su navegador web.

source: Juliette Taka's excellent cartoon below illustrates the steps in creating and sharing a "binderized" project.
es: La excelente caricatura de Juliette Taka que presentamos a continuación ilustra los pasos para crear y compartir un proyecto "binderizado".

source: **Step 1:** We start with a researcher who has completed a project and wants to share her work with anyone, regardless of their computational environment. Note that Binder does not only have to be applied to finished projects; it can be used in exactly the same way to share projects that are in progress.
es: **Paso 1:** Empezamos con una investigadora que ha completado un proyecto y quiere compartir su trabajo con cualquiera, sin importar su entorno computacional. Tengan en cuenta que Binder no sólo tiene que ser aplicado a proyectos terminados, sino que puede ser usado exactamente de la misma manera para compartir proyectos que están en progreso.

source: **Step 2:** The researcher's project contains many files of different types. In this case the researcher has been working in Jupyter notebooks, but Binder can be used just as effectively with many other file formats and languages which we'll cover in more detail shortly.
es: **Paso 2:** El proyecto de la investigadora contiene muchos archivos de diferentes tipos. En este caso la investigadora ha estado trabajando en cuadernos de Jupyter, pero Binder puede ser utilizado con la misma eficacia con muchos otros formatos de archivo y lenguajes que cubriremos con más detalle en breve.

source: **Step 3:** The researcher uploads her code to a publicly available repository hosting service, such as GitHub, where it can be accessed by others. She includes a file describing the computational environment required to run the project.
es: **Paso 3:** La investigadora sube su código a un servicio de alojamiento de repositorio disponible públicamente, como GitHub, donde puede ser accedido por otros. Ella incluye un archivo que describe el entorno computacional necesario para ejecutar el proyecto.

source: **Step 4:** She generates a link at the [mybinder.org](https://mybinder.org) BinderHub. By clicking on this link anyone can access a "Binderized" version of her project. The click triggers repo2docker to build an Docker image based on the contents of the repository and its configuration files. This image is then hosted on the cloud. The person who clicked the link will be taken to a copy of her project in their web browser that they can interact with. This copy of the project they interact with is hosted in the environment the researcher specified in step 3, regardless of the computational environment of the person is accessing it from.
es: **Paso 4:** Genera un enlace en el [mybinder.org](https://mybinder.org) BinderHub. Haciendo clic en este enlace cualquiera puede acceder a una versión "Binderizada" de su proyecto. El click hace que repo2docker construya una imagen Docker basada en el contenido del repositorio y sus archivos de configuración. Esta imagen es entonces alojada en la nube. La persona que hizo clic en el enlace será llevada a una copia de su proyecto en su navegador web con el que puede interactuar. Esta copia del proyecto con el que interactúan está alojada en el entorno que el investigador especificó en el paso 3, independientemente del entorno computacional desde el que la persona está accediendo.

source: Figure credit: [Juliette Taka, Logilab and the OpenDreamKit project](https://opendreamkit.org/2017/11/02/use-case-publishing-reproducible-notebooks/)
es: Crédito de la figura: [Juliette Taka, Logilab y el proyecto OpenDreamKit](https://opendreamkit.org/2017/11/02/use-case-publishing-reproducible-notebooks/)

source: To get an idea of what this looks like here's what a binder of a simple example project looks like. Files are listed and can be clicked on and modified by the person accessing the binder.
es: Para tener una idea de cómo se ve esto, aquí está el aspecto de una carpeta de un simple proyecto de ejemplo. Los archivos están listados y pueden ser pulsados y modificados por la persona que accede a la carpeta.

source: Users can also open terminals to run or otherwise interact with the files by clicking on "New" and then "Terminal" in the top right of the home binder screen shown above. Here this is used to run the analysis script in the example binder which performs a linear regression on some data:
es: Los usuarios también pueden abrir terminales para ejecutar o interactuar de otra manera con los archivos haciendo clic en "Nuevo" y luego en "Terminal" en la parte superior derecha de la pantalla de la carpeta de inicio que se muestra arriba. Aquí se utiliza para ejecutar el script de análisis en la carpeta de ejemplo que realiza una regresión lineal en algunos datos:

source: As mentioned Binder is well integrated with Jupyter notebooks which can be opened by clicking on "New" and then under "Notebook" in the same way terminals can be opened. These may be more convenient for those working with graphical outputs, as shown here where one is used to run `make_plot.py` in the example Binder:
es: Como ya se ha mencionado, Binder está bien integrado con los cuadernos de Jupyter, que pueden abrirse pulsando en "Nuevo" y luego en "Cuaderno", de la misma manera que pueden abrirse las terminales. Esto puede ser más conveniente para aquellos que trabajan con salidas gráficas, como se muestra aquí donde se utiliza para ejecutar `make_plot.py` en el ejemplo de Binder:

source: If R is installed in a Binder the dropdown menu will show the options to open R Jupyter notebooks and RStudio sessions in the Binder.
es: Si R está instalado en una carpeta, el menú desplegable mostrará las opciones para abrir los cuadernos de R Jupyter y las sesiones de RStudio en la carpeta.

source: ### Disambiguation
es: ### Desambiguación

source: In this section there are a number of related terms, which will be outlined here for clarity:
es: En esta sección hay una serie de términos relacionados, que se expondrán aquí para mayor claridad:

source: - Binder: A sharable version of a project that can be viewed and interacted within a reproducible computational environment via a web browser.
es: - Binder: Una versión compartible de un proyecto que puede verse e interactuar dentro de un entorno computacional reproducible a través de un navegador web.

source: - BinderHub: A service which generates Binders. The most widely-used is [mybinder.org](https://mybinder.org), which is maintained by the Binder team. It is possible to create other BinderHubs which can support more specialised configurations. One such configuration could include authentication to enable private repositories to be shared amongst close collaborators.
es: - BinderHub: Un servicio que genera Binders. El más utilizado es [mybinder.org](https://mybinder.org), mantenido por el equipo de Binder. Es posible crear otros BinderHubs que puedan soportar configuraciones más especializadas. Una de estas configuraciones podría incluir la autenticación para permitir que los repositorios privados se compartan entre colaboradores cercanos.

source: - [mybinder.org](https://mybinder.org): A public and free BinderHub. Because it is public you should not use it if your project requires any personal or sensitive information (such as passwords).
es: - [mybinder.org](https://mybinder.org): Un BinderHub público y gratuito. Al ser público, no debes utilizarlo si tu proyecto requiere información personal o sensible (como contraseñas).

source: - Binderize: To make a Binder of a project.
es: - Binderizar: Hacer un Binder de un proyecto.

source: ### Creating a Binder for a project
es: ### Creando un Binder para un proyecto

source: Creating a Binderized version of a project involves three key steps which will be explained in this section:
es: La creación de una versión Binderizada de un proyecto implica tres pasos clave que se explicarán en esta sección:

source: 1. Specify the computational environment
es: 1. Especificar el entorno informático

source: 2. Put the project files somewhere publicly available (we will describe how to do this with GitHub)
es: 2. Poner los archivos del proyecto en algún lugar disponible públicamente (describiremos cómo hacerlo con GitHub)

source: 3. Generate a link to a Binder of the project
es: 3. Generar un enlace a un Binder del proyecto

source: For a list of sample repositories for use with Binder, see the [Sample Binder Repositories](https://mybinder.readthedocs.io/en/latest/sample_repos.html) page.
es: Para ver una lista de repositorios de muestra para usar con Binder, consulte la página [Repositorios de muestra de Binder](https://mybinder.readthedocs.io/en/latest/sample_repos.html).

source: #### Step 1: Specify your computational environment
es: #### Paso 1: Especifique su entorno de cálculo

source: If a project contains no file specifying the computational environment when a Binder is generated the environment will be the Binder default environment, (containing Python 3.6) which may or may not be suitable for the project. However if it does contain a configuration file for the environment then the Binder will be generated with the specified environment. A full list of such files Binder accepts with examples can be found [here](https://mybinder.readthedocs.io/en/latest/config_files.html), but here are some of the key ones, some of which are language-specific:
es: Si un proyecto no contiene un archivo que especifique el entorno computacional, cuando se genere un Binder, el entorno será el entorno por defecto de Binder (que contiene Python 3.6), que puede o no ser adecuado para el proyecto. Sin embargo, si contiene un archivo de configuración para el entorno, el Binder se generará con el entorno especificado. Una lista completa de estos archivos que Binder acepta con ejemplos se puede encontrar [aquí](https://mybinder.readthedocs.io/en/latest/config_files.html), pero aquí están algunos de los principales, algunos de los cuales son específicos del lenguaje:

source: - Recall that environment.yml files were discussed in the [Package management systems](#Package_management_systems) section.
es: - Recuerde que los archivos del estilo de environment.yml fueron discutidos en la sección [Sistemas de gestión de paquetes](#Package_management_systems).

source: - Dockerfiles will be discussed in the [Containers](#Containers_section) section, so will not be discussed further here.
es: - Los archivos Docker (Dockerfiles) se discutirán en la sección [Contenedores](#Containers_section), por lo que no se discutirá más aquí.

source: - Dependencies that would typically installed via commands such as `sudo apt-get install package_name` should be listed in an apt.txt file, and will be automatically installed in the Binder.
es: - Las dependencias que normalmente se instalan a través de comandos como `sudo apt-get install nombre_de_paquete` deben aparecer en un archivo apt.txt, y se instalarán automáticamente en el Binder.

source: - For example if a project uses Latex the apt.txt file should read
es: - Por ejemplo, si un proyecto utiliza Latex, el archivo apt.txt debería decir

source: to install the base Latex package.
es: para instalar el paquete base de Latex.

source: - For those that use the [package management system](#Package_management_systems) Nix a default.nix file can be a convenient way to capture their environment.
es: - Para aquellos que utilizan el [sistema de gestión de paquetes](#Package_management_systems) Nix un archivo default.nix puede ser una forma conveniente de capturar su entorno.

source: - For Python users a requirements.txt file can be used to list dependent packages.
es: - Para los usuarios de Python se puede utilizar un archivo requirements.txt para listar los paquetes dependientes.

source: - For example to have Binder install numpy this file would simply need to read:
es: - Por ejemplo para que Binder instale numpy este archivo simplemente tendría que leer:

source: - Specific package version can also be specified using an `==`, for example to have Binder install numpy version 1.14.5 then the file would be
es: - También se puede especificar la versión de un paquete específico utilizando un `==`, por ejemplo, para que Binder instale la versión 1.14.5 de numpy, el archivo sería
