Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/reproducible_environments.*.po
Languages: es

source: ## Summary of ways to capture computational environments
es: Resumen de formas de calcular entornos computacionales.

source: There are a number of ways of capturing computational environments. The major ones covered in this chapter will be package management systems, Binder, virtual machines, and containers. Each have their own pros and cons, and which is the most appropriate for you will depend on the nature of your project.
es: Hay muchas formas de capturar entornos de computación. En este capítulo cubriremos principalmente los sistemas de gestión de paquetes, Binder, máquinas virtuales y contenedores. Cada uno tiene sus ventajas y desventajas, y encontrar el entorno más apropiado para tí dependerá de la naturaleza de tu proyecto.

source: These can be broadly split into two categories: those that capture only the software and its versions used in an environment (package management systems), and those that replicate an entire computational environment including the operating system and customised settings (virtual machines and containers).
es: Estos se pueden dividir en dos categorías: los que capturan solo el software y sus versiones utilizadas en un entorno (sistemas de gestión de paquetes) y los que replican un entorno computacional completo, incluido el sistema operativo y la configuración personalizada (máquinas virtuales y contenedores).

source: Another way these can be split is by how the reproduced research is presented to the reproducer. Using Binder or a virtual machine creates a much more graphical, GUI-type result, whereas the outputs of containers and package management systems are more easily interacted with via the command line.
es: Otra forma en que se pueden dividir es por la forma en que la investigación reproducida se presenta quien la vaya a reproducir. El uso de Binder o una máquina virtual crea un resultado mucho más gráfico, mientras que las salidas de los contenedores y los sistemas de gestión de paquetes se interactúan más fácilmente a través de la línea de comandos.

source: <table> <tr> <th></th> <th></th> <th colspan="2">Interaction style</th> </tr> <tr> <th></th> <td></td> <td>Graphical</td> <td>Command line</td> </tr> <tr> <th rowspan="2">What is reproduced?</th> <td>Software and versions</td> <th>Binder</th> <th>Conda</th> </tr> <td>Entire system</td> <th>Virtual Machines</th> <th>Containers</th> <tr> </tr> </table>
es: <table> <tr> <th></th> <th></th> <th colspan="2">Estilo de interacción</th> </tr> <tr> <th></th> <td></td> <td>Gráfico</td> <td>Línea de comandos</td> </tr> <tr> <th rowspan="2">¿Qué se reproduce?</th> <td>Software y versiones</td> <th>Binder</th> <th>Conda</th> </tr> <td>Sistema completo</td> <th>Máquinas Virtuales</th> <th>Contenedores</th> <tr> </tr> </table>

source: Here we give a brief description of each of these tools:
es: A continuación damos una breve descripción de cada una de estas herramientas:

source: ### Package management systems
es: ### Sistemas de manejo de paquetes

source: Package management systems are tools used to install and keep track of the software (and critically versions of software) used on a system, and can export files specifying these required software packages/versions. The files can be shared with others who can use them to replicate the environment, either manually or via their own package management systems.
es: Los sistemas de gestión de paquetes son herramientas que se utilizan para instalar y realizar un seguimiento del software (y, fundamentalmente, las versiones de software) que se utilizan en un sistema, y ​​pueden exportar archivos que especifiquen estos paquetes y/o versiones de software necesarios. Los archivos se pueden compartir con otras personas que pueden usarlos para replicar el entorno, ya sea manualmente o mediante sus propios sistemas de gestión de paquetes.

source: Binder is a service which generates fully-functioning versions of projects from a git repository and serves them on the cloud. These "binderized" projects can be accessed and interacted with by others via a web browser. In order to do this Binder requires that the software (and optionally versions) required to run the project are specified. Users can make use of package management systems or Dockerfiles (discussed in the [Containers section](#Containers_section)) to do this if they so desire.
es: Binder es un servicio que genera versiones de proyectos en la nube desde un repositorio de git. Otros pueden acceder a estos proyectos "binderizados" e interactuar con ellos a través de un navegador web. Para hacer esto, Binder requiere que se especifique el software (y opcionalmente las versiones) requeridas para ejecutar el proyecto. Los usuarios pueden hacer uso de sistemas de administración de paquetes o Dockerfiles (discutidos en la [sección Contenedores] (# sección_contenedores)) para hacer esto si así lo desean.

source: ### Virtual machines
es: ### Máquinas virtuales

source: Virtual machines are simulated computers. A user can make a "virtual" computer very easily, specifying the operating system they want it to have among other features, and run it like any other app. Within the app will be the desktop, file system, default software libraries and other features of the specified machine, which can be interacted with as if it was a real computer. Virtual machines can be easily replicated and shared. This allows researchers to create virtual machines, perform their research on them, and then save their state along with their files, settings and outputs, which they can then distribute as a fully-functioning project.
es: Las máquinas virtuales son computadoras emuladas. Un usuario puede crear una computadora "virtual" muy fácilmente, especificando el sistema operativo que desea que tenga, entre otras características, y ejecutarla cómo cualquier otra aplicación. Dentro de la aplicación estarán el escritorio, el sistema de archivos, las bibliotecas de software predeterminadas y otras características de la máquina especificada, con las que se puede interactuar como si fuera una computadora real. Las máquinas virtuales se pueden replicar y compartir fácilmente. Esto permite a los investigadores crear máquinas virtuales, realizar su investigación en ellas y luego guardar su estado junto con sus archivos, configuraciones y resultados, que luego pueden distribuir como un proyecto en pleno funcionamiento.

source: ### Containers
es: ### Contenedores

source: Containers offer many of the same benefits as virtual machines. They essentially act as entirely separate machines which can contain their own files, software and settings.
es: Los contenedores ofrecen muchos de los mismos beneficios que las máquinas virtuales. Básicamente, actúan como máquinas completamente independientes que pueden contener sus propios archivos, software y configuraciones.

source: The difference is that virtual machines include an entire operating system along with all the associated software. that is typically packaged with it- regardless of whether the project actually makes use of that associated software. Containers only contain the software and files explicitly defined within them in order to run the project they contain. This makes them far more lightweight than virtual machines.
es: La diferencia es que las máquinas virtuales incluyen un sistema operativo completo junto con todo el software asociado con él, independientemente de si el proyecto realmente utiliza este software. Los contenedores solo tienen el software y los archivos definidos explícitamente para ejecutar el proyecto que contienen. Esto los hace mucho más ligeros que las máquinas virtuales.

source: Containers are particularly useful if projects need to be able to run on high performance computing environments as, since they already _contain_ all the necessary software, they save having to install anything on an unfamiliar system where the researcher may not have the required permissions to do so.
es: Los contenedores son particularmente útiles si los proyectos necesitan poder ejecutarse en entornos informáticos de alto rendimiento ya que, dado que ya contienen todo el software necesario, evitan tener que instalar cualquier cosa en un sistema desconocido donde el investigador puede no tener los permisos necesarios para hacerlo. .

source: ## Package management systems
es: ## Sistemas de gestión de paquetes

source: Package managers install and keep track of the different software packages (and their versions) that you use within an environment. There are quite a few to choose from, for example Yum, Zypper, dpkg, and Nix (which will be mentioned briefly later in the [Binder](#Binder_section) section). We're going to focus on [Conda](https://conda.io/en/latest/), which has a number of useful functionalities.
es: Los administradores de paquetes instalan y realizan un seguimiento de los diferentes paquetes de software (y sus versiones) que utiliza en un entorno. Hay bastantes para elegir, por ejemplo, Yum, Zypper, dpkg y Nix (que se mencionarán brevemente mas adelante en la sección [Binder] (# Binder_section)). Nos centraremos en [Conda] (https://conda.io/en/latest/), que tiene una serie de funcionalidades útiles.

source: ### What does Conda do?
es: ### ¿Qué hace Conda?

source: Conda allows users to create any number of environments which are entirely separate, and to quickly and easily change between them.
es: Conda permite a los usuarios crear cualquier cantidad de entornos completamente separados y cambiar rápida y fácilmente entre ellos.

source: For example, say a researcher has a project: Project One, which has its own environment defined by Conda which is made up of a set of packages and versions of those packages:
es: Por ejemplo, digamos que un investigador tiene un proyecto: Proyecto Numero Uno, que tiene su propio entorno definido por Conda que se compone de un conjunto de paquetes y versiones de esos paquetes:

source: | Package name | Version |
es: | Nombre del paquete | Versión |

source: | Package A | 1.5.2 |
es: | Paquete A | 1.5.2 |

source: | Package B | 2.1.10 |
es: | Paquete B | 2.1.10 |

source: | Package C | 0.7.9 |
es: | Paquete C | 0.7.9 |

source: Later the researcher starts Project Two in its own environment:
es: Posteriormente, el investigador inicia el Proyecto Dos en su propio entorno:

source: | Package C | 1.2.4 |
es: | Paquete C | 1.2.4 |

source: | Package D | 1.5.2 |
es: | Paquete D | 1.5.2 |

source: | Package E | 3.7.1 |
es: | Paquete E | 3.7.1 |

source: Note here that the version of package C used in Project Two has been updated from the version used in Project One. If these project environments were not separate then the researcher would have the choice of:
es: Ten en cuenta que la versión del paquete C utilizada en el Proyecto Dos se ha actualizado con respecto a versión utilizada en el Proyecto Uno. Si estos entornos de proyecto no estuvieran separados, el investigador tendría la opción de:

source: - A) Using the older version of package C forever and not benefiting from updates and bugfixes in later versions.
es: - A) Usar la versión anterior del paquete C para siempre y no beneficiarse de actualizaciones y correcciones de errores en versiones posteriores.

source: - B) Installing the updated version of the package and hoping that it doesn't impact Project One.
es: - B) Instalar la versión actualizada del paquete y esperar que no afecte al Proyecto Uno.

source: - C) Installing the updated version of the package for use in Project Two then uninstalling it and reinstalling the old one whenever they need to do work on Project One. This would be extremely annoying, and is a step that risks being forgotten.
es: - C) Instalar la versión actualizada del paquete para usar en el Proyecto Dos, luego desinstalarlo y reinstalar el anterior cada vez que necesites trabajar en el Proyecto Uno. Esto sería muy incómodo y es un paso que corre el riesgo de ser olvidado.

source: All of these options are extremely poor, hence the utility of Conda for creating distinct environments which are easily interchangable.
es: Todas estas opciones son deficientes, de ahí la utilidad de Conda para crear entornos distintos que son fácilmente intercambiables.

source: Conda can also be used to easily capture and export computational environments. It can go in the other direction too; it can generate computational environments from configuration files which can be used to recreate someone else's environment.
es: Conda también se puede utilizar para capturar y exportar fácilmente entornos computacionales. También puede ir en la otra dirección; puede generar entornos computacionales a partir de archivos de configuración que se pueden utilizar para recrear el entorno de otra persona.

source: Another benefit of Conda is that it offers much greater flexibility to users who do not have admin privileges on the machines they are working on (as is very common when working with high performance computing facilities). Without Conda it is typically very difficult to install required software onto such machines. However, because Conda creates and changes _new_ environments rather than making changes to a machine's overall system environment, admin privileges are not required.
es: Otro beneficio de Conda es que ofrece mucha más flexibilidad a los usuarios que no tienen privilegios de administrador en las máquinas en las que están trabajando (como es muy común cuando se trabaja con instalaciones informáticas de alto rendimiento). Sin Conda, normalmente es muy difícil instalar el software necesario en dichas máquinas. Sin embargo, debido a que Conda crea y cambia _nuevos_ entornos en lugar de realizar cambios en el entorno general del sistema de una máquina, no se requieren privilegios de administrador.

source: Finally, while Conda is Python-centric to a degree, it is also well integrated for use with other languages, for example the base version of Conda includes the C++ standard library.
es: Finalmente, aunque Conda está centrado en Python hasta cierto punto, también está bien integrado para su uso con otros lenguajes, por ejemplo, la versión base de Conda incluye la biblioteca estándar C ++.

source: ### Installing Conda
es: ### Instalando Conda

source: Note that these installation instructions are directed towards Linux systems. Instructions for installing Conda on Windows or Mac systems can be found [here](https://docs.conda.io/projects/conda/en/latest/user-guide/install/).
es: Ten en cuenta que estas instrucciones de instalación están dirigidas a sistemas Linux. Las instrucciones para instalar Conda en sistemas Windows o Mac se pueden encontrar [aquí] (https://docs.conda.io/projects/conda/en/latest/user-guide/install/).

source: Go to [https://repo.continuum.io/miniconda/](https://repo.continuum.io/miniconda/) and download the latest Miniconda 3 installer for your system (32 bit or 64 bit), which will have a name like Miniconda_version_number.sh. Run the installer using
es: Ve a [https://repo.continuum.io/miniconda/](https://repo.continuum.io/miniconda/) y descarga el último instalador de Miniconda 3 para tu sistema (32 bits o 64 bits), que tienen un nombre como Miniconda_version_number.sh. Ejecuta el instalador usando

source: You can check that Conda has installed successfully by typing
es: Puedes comprobar que Conda se ha instalado correctamente escribiendo

source: which should output a version number.
es: que debería generar un número de versión.

source: ### Making and using environments
es: ### Creación y uso de entornos

source: Conda automatically installs a base environment with some commonly used software packages. It is possible to just work in this base environment, however it is good practise to create a new environment for each project you start.
es: Conda instala automáticamente un entorno base con algunos paquetes de software de uso común. Es posible trabajar en este entorno base, sin embargo, es una buena práctica crear un nuevo entorno para cada proyecto que inicie.

source: To create an environment use `conda create --name your_project_env_name` followed by a list of packages to include. To include the packages scipy and matplotlib, add them to the end of the command:
es: Para crear un entorno usq `conda create --name nombre_del_proyecto` seguido de una lista de paquetes para incluir. Para incluir los paquetes scipy y matplotlib, agrégalos al final del comando:

source: ``` conda create --name Project_One scipy matplotlib ```
es: ``` conda create --name Proyecto_Uno scipy matplotlib ```

source: You can specify the versions of certain (or all) packages by using `=package_number` after the name. For example, to specify scipy 1.2.1 in the above environment
es: Puedes especificar las versiones de ciertos (o todos) paquetes usando `=número_versión` después del nombre. Por ejemplo, para especificar scipy 1.2.1 en el entorno anterior

source: ``` conda create --name Project_One scipy=1.2.1 matplotlib ```
es: ``` conda create --name Proyecto_Uno scipy=1.2.1 matplotlib ```

source: When creating environments you can also specify versions of languages to install, for example to use Python 3.7.1 in the Project_One environment:
es: Al crear ambientes también puedes especificar las versiones de idiomas a instalar, por ejemplo, para utilizar Python 3.7.1 en el entorno Project_One:

source: ``` conda create --name Project_One python=3.7.1 scipy=1.2.1 matplotlib ```
es: ``` conda create --name Proyecto_Uno python=3.7.1 scipy=1.2.1 matplotlib ```

source: Now that an environment has been created it's time to activate (start using) it via `conda activate environment_name`, so in this example:
es: Ahora que se ha creado un entorno, es hora de activarlo (empezar a usarlo) a través de `conda active nombre_del_proyecto`, así que en este ejemplo:

source: ``` conda activate Project_One ```
es: ``` conda activate Proyecto_Uno ```

source: Note that you may need to use `source` instead of `conda` if you're using an old version of conda.
es: Ten en cuenta que es posible que deba usar `source` en lugar de` conda` si estás usando una versión antigua de conda.

source: Once an environment is activated you should see the environment name before each prompt in your terminal:
es: Una vez que se activa un entorno, deberías ver el nombre del entorno antes de cada mensaje en su terminal:

source: ``` (Project_One) $ python --version Python 3.7.1 ```
es: ``` (Proyecto_Uno) $ python --version Python 3.7.1 ```

source: ### Deactivating and deleting environments
es: ### Desactivación y eliminación de entornos

source: You can deactivate (get out of) an environment using
es: Puedes desactivar (salirte de) un entorno utilizando

source: and remove (delete) an environment as shown here for removing the Project_One environment
es: y eliminar un entorno como se muestra aquí (para eliminar el entorno Proyecto_Uno)

source: ``` conda env remove --name Project_One ```
es: ``` conda env remove --name Proyecto_Uno ```

source: To check if an environment has been successfully removed you can look at a list of all the Conda environments on the system using
es: Para comprobar si un entorno se ha eliminado correctamente, puedes consultar una lista de todos los entornos Conda en el sistema utilizando

source: However deleting an environment may not delete package files that were associated with it. This can lead to a lot of memory being wasted on packages that are no longer required. Packages that are no longer referenced by any environments can be deleted using
es: Sin embargo, es posible que eliminar un entorno no elimine los archivos de paquete que estaban asociados con él. Esto puede hacer que se desperdicie mucha memoria en paquetes que ya no son necesarios. Los paquetes a los que ya no hace referencia ningún entorno se pueden eliminar mediante

source: Alternatively you can delete an environment (such as Project_One) along with its associated packages via:
es: Alternativamente, puedes eliminar un entorno (como Proyecto_Uno) junto con sus paquetes asociados a través de:

source: ``` conda remove --name Project_One --all ```
es: ``` conda remove --name Proyecto_Uno --all ```

source: ### Installing and removing packages within an environment
es: ### Instalación y eliminación de paquetes dentro de un entorno

source: Within an environment you can install more packages using
es: Dentro de un entorno, puedes instalar más paquetes usando

source: ``` conda install package_name ```
es: ``` conda install nombre_del_paquete ```

source: and similarly you can remove them via
es: Y del mismo modo puedes eliminarlos a través de

source: ``` conda remove package_name ```
es: ``` conda remove nombre_del_paquete ```

source: This is the best way to install packages from within Conda as it will also install a Conda-tailored version of the package. However it is possible to use other methods if a Conda-specific version of a package is not available. For example `pip` is commonly used to install Python packages, so a command like
es: Esta es la mejor forma de instalar paquetes desde Conda, ya que también instalará una versión del paquete adaptada a Conda. Sin embargo, es posible utilizar otros métodos si una versión específica de Conda de un paquete no está disponible. Por ejemplo, `pip` se usa comúnmente para instalar paquetes de Python, por lo que un comando como

source: still works.
es: también funciona.

source: Although Python packages have been used in many of the examples given here Conda packages do not have to be Python packages, for example here the R base language is installed along with the R package r-yaml
es: Aunque los paquetes de Python se han utilizado en muchos de los ejemplos que se dan aquí, los paquetes Conda no tienen que ser paquetes de Python, por ejemplo, aquí el lenguaje base R se instala junto con el paquete R r-yaml

source: ``` conda create --name Project_One r-base r-yaml ```
es: ``` conda create --name Proyecto_Uno r-base r-yaml ```

source: A Conda channel is where it downloaded a package from. Common channels include Anaconda (a company which provides the `defaults` conda package channel), and conda-forge (a community-driven packaging endeavour). You can explicitly install a package from a certain channel by specifying it like:
es: Un canal de Conda es de dónde descargó un paquete. Los canales comunes incluyen Anaconda (una empresa que proporciona el canal de paquetes de conda "predeterminados") y conda-forge (un esfuerzo de empaquetado impulsado por la comunidad). Puedes instalar explícitamente un paquete desde un determinado canal especificándolo como:

source: ``` conda install -c channel_name package_name ```
es: ``` conda install -c nombre_del_canal nombre_del_paquete ```

source: ### Exporting and reproducing computational environments
es: ### Exportación y reproducción de entornos computacionales

source: Conda environments can be exported easily to human-readable files in the YAML format. YAML files are discussed in more detail [later](#YAML_files) in this chapter.
es: Los entornos Conda se pueden exportar fácilmente a archivos legibles por humanos en formato YAML. Los archivos YAML se tratan con más detalle [más adelante] (# YAML_files) en este capítulo.

source: To export a conda environment to a file called `environment.yml` activate the environment and then run
es: Para exportar un entorno conda a un archivo llamado `environment.yml`, activa el entorno y luego ejecuta

source: Similarly Conda environments can be created from YAML files via
es: Del mismo modo, los entornos Conda se pueden crear a partir de archivos YAML a través de
