Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/risk_assessment.*.po
Languages: es

source: ## Longer read…
es: ## Lectura más larga...

source: We all use risk assessments all the time. Sometimes they’re formal procedures to ensure an activity is safe, but most of the time they’re the thought of a moment- Is this coffee too hot? Is there a bus coming? Software is no different, and using a risk assessment approach like the one described below can really help make your work successful and sustainable.
es: Todos utilizamos evaluaciones de riesgos continuamente. A veces son procedimientos formales para garantizar la seguridad de una actividad, pero la mayoría de las veces son el pensamiento de un momento: ¿está el café demasiado caliente? ¿Viene un autobús? En software no es diferente, y el uso de un enfoque de evaluación de riesgos como el que se describe a continuación puede ayudar realmente a que su trabajo sea exitoso y sostenible.

source: ### The risk matrix
es: ### La matriz de riesgo

source: A risk matrix is a very popular way of quantifying what’s going on with the thing you’re interested in. One axis measures exposure in some way, and the other the impact of a mishap. The further from the origin, the more safeguards are needed to make the risk acceptable.
es: ### Matriz de riesgo Una matriz de riesgo es una forma muy popular de cuantificar lo que ocurre con lo que te interesa. Un eje mide la exposición de alguna manera, y el otro el impacto de un percance. Cuanto más lejos del origen, más salvaguardias se necesitan para que el riesgo sea aceptable.

source: ![Impact vs complexity risk matrix](../../figures/risk_matrix.png)
es: ![Matriz de riesgo de impacto frente a complejidad](../../figures/risk_matrix.png)

source: In our case, we will use ‘complexity’ and ‘impact’ as the two axes. Some case studies illustrate how it works…
es: En nuestro caso, utilizaremos "complejidad" e "impacto" como los ejes. Algunos casos prácticos ilustran su funcionamiento...

source: Case 1
es: Caso 1

source: > Richard needs to submit a 100 small jobs to the department cluster, with the names of the jobs varying according to a simple pattern. This is tedious and he wants to go outside and play. Therefore, Richard decides to write a short shell script to submit all the jobs. He pauses for a few seconds and asks:
es: > Richard tiene que enviar un centenar de pequeños trabajos a ejecutarse en un servidor, cuyos nombres varían según un patrón sencillo. Esto es tedioso y él quiere salir a divertirse. Por lo tanto, Richard decide escribir un breve script de shell para enviar todos los trabajos. Se detiene unos segundos y pregunta:

source: > How complicated is this? It’ll only be about 1 screen of text.
es: > ¿Qué tan complicado es esto? Sólo será una linea de código.

source: > What’s if it goes wrong? The jobs won’t submit or run and I’ll get some failure emails.
es: > ¿Qué pasa si algo sale mal? Los trabajos no se envían ni se ejecutan y recibo algunos correos electrónicos de error.

source: > Here, Richard decides that both the complexity and impact of this tiny piece of software are low. Therefore, using version control and writing documentation is disproportionate right now. He decides to do a dry run by echoing the submit line to the terminal so he can give it a quick check.
es: > Aquí, Richard decide que tanto la complejidad como el impacto de esta pequeña pieza de software son bajos. Por lo tanto, usar control de versiones y escribir documentación es mucho esfuerzo innecesario en este momento. Decide hacer un simulacro enviando la línea de envío al terminal para poder hacer una prueba rápida.

source: >A few weeks later, someone else in the lab wants to do the same thing. Richard offers his script as it worked quite well for him. The goalposts have moved. Richard pauses for a few more seconds to and reassesses the risk…
es: >Unas semanas después, otra persona del laboratorio quiere hacer lo mismo. Richard ofrece su guión ya que le funcionó bastante bien. Las reglas del juego cambiaron. Richard se detiene unos segundos más para y revaloriza el riesgo...

source: >…5 years later, Richard’s script has evolved into a large workflow control system allowing several universities to manage complex workflows consisting of 1000’s of jobs being submitted to a range of different compute resources. The software now has a formal project board that sets the governance and direction of the software, ensuring that it is sustainable and meets the needs of the 100s of users worldwide.
es: >...5 años después, el guión de Richard ha evolucionado hasta convertirse en un gran sistema de control de flujos de trabajo que permite a varias universidades gestionar complejos flujos de trabajo compuestos por miles de trabajos que se envían a una serie de recursos informáticos diferentes. El software cuenta ahora con una junta de proyecto formal que establece la gobernanza y la dirección del software, garantizando que sea sostenible y satisfaga las necesidades de los cientos de usuarios de todo el mundo.

source: Case 2...
es: Caso 2

source: > Jemma has a problem with visualising some data. The usual library can’t cope with the format her data. She’s heard about Seth’s Friday afternoon project where he’s written a wrapper around this library to solve what seems to be the same problem. They have a coffee and decide to work together. During this coffee, they make some decisions about how they’re going to work successfully together- this is their risk assessment. Seth agrees to go away and improve the inline documentation and add some use case examples before sharing. Jemma agrees to set up a repository into which Seth will put the code.
es: > Jemma tiene un problema con la visualización de algunos datos. La biblioteca habitual no puede hacer frente al formato de sus datos. Ha oído hablar del proyecto del viernes por la tarde de Seth, en el que ha escrito un _wrapper_ (o envoltura) alrededor de esta biblioteca para resolver lo que parece ser el mismo problema. Toman un café y deciden trabajar juntos. Durante este café, toman algunas decisiones sobre cómo van a trabajar juntos con éxito - esta es su evaluación de riesgos. Seth acepta irse y mejorar la documentación en línea y añadir algunos ejemplos de casos de uso antes de compartirlos. Jemma acepta crear un repositorio en el que Seth pondrá el código.

source: > Over time, more people start to make use of this software, with feature requests adding complexity and changes in the underlying library causing breakages. Jemma and Seth agree that things are getting a bit risky because the impact of wrong results might cause problems with publishing results. They therefore introduce continuous integration tests and a review process to ensure things remain sustainable.
es: > Con el tiempo, más gente empieza a hacer uso de este software, con peticiones de características que añaden complejidad y cambios en la biblioteca subyacente que causan roturas. Jemma y Seth están de acuerdo en que las cosas se están volviendo un poco arriesgadas porque el impacto de los resultados erróneos podría causar problemas con la publicación de los resultados. Por lo tanto, introducen pruebas de integración continua y un proceso de revisión para garantizar que las cosas sigan siendo sostenibles.

source: The key point of these case studies is that every piece of software has different needs to be sustainable, and these requirements can change over time. The use of version control, testing, documentation and other sustainability concepts are useful for managing risk. Using none of these tools leaves your software exposed to things going wrong, but using all of them from the outset can get in the way of innovation.
es: El punto clave de estos estudios de caso es que cada pieza de software tiene diferentes necesidades para ser sostenible, y estos requisitos pueden cambiar con el tiempo. El uso del control de versiones, las pruebas, la documentación y otros conceptos de sostenibilidad son útiles para gestionar el riesgo. El uso de ninguna de estas herramientas deja al software expuesto a que las cosas vayan mal, pero el uso de todas ellas desde el principio puede obstaculizar la innovación.

source: The risk assessment approach helps you find the right balance for now. Revisit the topic once in a while, or when something circumstances change.
es: El enfoque de la evaluación de riesgos te ayuda a encontrar el equilibrio adecuado por ahora. Revisa el tema de vez en cuando, o cuando cambien las circunstancias.

source: ### More about measuring complexity
es: ### Más sobre la medición de la complejidad

source: One measure of complexity is line count. The more lines you have the more places there are to make a mistake. However, there are other things one might care about. How many libraries do you depend on? How many functions are there? All of these measure the complexity of the codebase.
es: Una medida de la complejidad es el número de líneas. Cuantas más líneas tenga, más lugares habrá para cometer un error. Sin embargo, hay otras cosas que pueden importarle a uno. ¿De cuántas bibliotecas depende? ¿Cuántas funciones hay? Todo esto mide la complejidad del código base.

source: Complexity can take other forms too. How many use cases are there? Does your blob counting software only get used for counting blobs in the biosciences? Are there people using it to count blobs in CCTV images? What types of computer are people using it on? CPU? GPU? Raspberry Pi?
es: La complejidad también puede adoptar otras formas. ¿Cuántos casos de uso hay? ¿Su software de recuento de manchas sólo se utiliza para contar manchas en las biociencias? ¿Hay gente que lo utiliza para contar manchas en imágenes de CCTV? ¿En qué tipo de ordenador se utiliza? ¿EN LA CPU? ¿GPU? ¿Raspberry Pi?

source: Take a broad view of your software.
es: Adopta una visión amplia de tu software.

source: ### More about measuring impact
es: ### Más sobre la medición del impacto

source: What happens when (not if) your software doesn’t work? Sometimes, it just annoys you for a few minutes. However, other software going wrong can have huge consequences- the retraction of your seminal paper or even lives being lost.
es: ¿Qué pasa cuando (no si) su software no funciona? A veces, sólo te molesta durante unos minutos. Sin embargo, otras veces el software que va mal puede tener enormes consecuencias: la retracción de tu artículo seminal o incluso la pérdida de vidas.

source: Measuring the impact requires good knowledge of what your software is being used for. It can sometimes be difficult to keep track of this until things go wrong. However, one can try to head this off at the pass by asking questions like ‘is this piece of software I use for the analysis in my paper any good?’.
es: Para medir el impacto es necesario conocer bien para qué se utiliza el software. A veces puede ser difícil hacer un seguimiento de esto hasta que las cosas van mal. Sin embargo, se puede intentar evitarlo de antemano haciéndose preguntas como "¿es bueno este software que utilizo para el análisis de mi trabajo?".

source: Again, take a broad view of your software.
es: Una vez más, hay que tener una visión amplia de su software.

source: ## In summary
es: ## En resumen

source: Understand your software and what it is used for. Knowing this helps you decide what sustainability concepts are appropriate for your needs. There are many tools and ecosystems that are commonly used to help you practice these concepts- github, Docker and many more. Read on to learn about these concepts and tools…
es: Comprenda su software y para qué se utiliza. Saber esto te ayuda a decidir qué conceptos de sostenibilidad son apropiados para tus necesidades. Hay muchas herramientas y ecosistemas que se utilizan habitualmente para ayudarte a practicar estos conceptos: github, Docker y muchos más. Sigue leyendo para conocer estos conceptos y herramientas...

source: ## Checklist
es: ## Lista de verificación

source: > this can be done at the end or maybe as a separate checklist exercise, but please do note things down here as you go
es: Comprenda su software y para qué se utiliza. Saber esto te ayuda a decidir qué conceptos de sostenibilidad son apropiados para tus necesidades. Hay muchas herramientas y ecosistemas que se utilizan habitualmente para ayudarte a practicar estos conceptos: github, Docker y muchos más. Sigue leyendo para conocer estos conceptos y herramientas...

source: ## What to learn next
es: ## ¿Qué aprender a continuación?

source: > recommended next chapters that are a good next step up
es: > capítulos recomendados que son un buen siguiente paso

source: ## Further reading
es: ## Lecturas complementarias

source: > top 3/5 resources to read on this topic (if they weren't licensed so we could include them above already) at the top, maybe in their own box/in bold.
es: > los 3/5 mejores recursos para leer sobre este tema (si no tuvieran licencia para poder incluirlos ya arriba) en la parte superior, quizás en su propio recuadro/en negrita.

source: > less relevant/favourite resources in case someone wants to dig into this in detail
es: > recursos menos relevantes/favoritos en caso de que alguien quiera profundizar en esto

source: ## Definitions/glossary
es: ## Definiciones/glosario

source: > Link to the glossary here or copy in key concepts/definitions that readers should be aware of to get the most out of this chapter
es: > Enlaza aquí con el glosario o copia los conceptos/definiciones clave que los lectores deben conocer para sacar el máximo provecho de este capítulo

source: ## Bibliography
es: ## Bibliografía

source: > Credit/urls for any materials that form part of the chapter's text.
es: > Créditos/urls para cualquier material que forme parte del texto del capítulo.

source: # Risk Assessment - deciding how to manage your software
es: # Evaluación de riesgos: decidir cómo gestionar su software

source: Use a risk assessment to help choose the appropriate sustainable software concepts for your project. Too little and your software is unsustainable; too much and you won’t be able to Get On With It. It can take just a few seconds, but gets you off on the right foot.
es: Utilice una evaluación de riesgos para ayudar a elegir los conceptos de software sostenible adecuados para su proyecto. Demasiado poco y su software no será sostenible; demasiado y no podrá ponerse en marcha. Puede llevarle sólo unos segundos, pero le permitirá empezar con buen pie.

source: ## Prerequisites/recommended skill level
es: ## Requisitos previos / nivel de habilidad recomendado

source: > This needs writing
es: > Esto necesita escribirse

source: ## Summary
es: ## Resumen

source: ## How this will help you/why this is useful
es: ## Cómo le ayudará esto/por qué es útil
