Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/testing.*.po
Languages: es

source: Firstly there are positive tests and negative tests. Positive tests check that something works, for example testing that a function that multiplies some numbers together outputs the correct answer. Negative tests check that something generates an error when it should. For example nothing can go quicker than the speed of light, so a plasma physics simulation code may contain a test that an error is outputted if there are any particles faster than this, as it indicates there is a deeper problem in the code.
es: En primer lugar, hay pruebas positivas y pruebas negativas. Las pruebas positivas comprueban que algo funciona, por ejemplo, que una función que multiplica varios números da la respuesta correcta. Las pruebas negativas comprueban que algo genera un error cuando debería hacerlo. Por ejemplo, nada puede ir más rápido que la velocidad de la luz, por lo que un código de simulación de la física del plasma puede contener una prueba de que se produce un error si hay partículas más rápidas que esto, ya que indica que hay un problema más profundo en el código.

source: In addition to these two kinds of tests there are also different levels of tests which test different aspects of a project. These levels are outlined [below](#Level_summary) and both positive and negative tests can be present at any of these levels. A thorough test suite will contain tests at all of these levels (though some levels will need very few).
es: Además de estos dos tipos de pruebas, también hay diferentes niveles de pruebas que comprueban diferentes aspectos de un proyecto. Estos niveles se describen a [continuación](#Resumen_de_los_niveles) y tanto las pruebas positivas como las negativas pueden estar presentes en cualquiera de estos niveles. Un conjunto de pruebas completo contendrá pruebas en todos estos niveles (aunque algunos niveles necesitarán muy pocas).

source: ### Level summary
es: ### Resumen de los niveles

source: [Smoke testing](#Smoke_testing): Very brief initial checks that ensures the basic requirements required to run the project hold. If these fail there is no point proceeding to additional levels of testing until they are fixed.
es: [Prueba de humo](#Prueba_de_humo): Verificaciones iniciales muy breves que garantizan el cumplimiento de los requisitos básicos necesarios para el funcionamiento del proyecto. Si estos fallan, no tiene sentido proceder a niveles adicionales de pruebas hasta que se solucionen.

source: [Unit testing](#Unit_tests): A level of the software testing process where individual units of a software are tested. The purpose is to validate that each unit of the software performs as designed.
es: [Pruebas unitarias](#Pruebas_de_unidades): Un nivel del proceso de pruebas de software en el que se prueban las unidades individuales de un software. El objetivo es validar que cada unidad del software funcione como se ha diseñado.

source: [Integration testing](#Integration_testing): A level of software testing where individual units are combined and tested as a group. The purpose of this level of testing is to expose faults in the interaction between integrated units.
es: [Pruebas de integración](#Pruebas_de_integración): Nivel de pruebas de software en el que las unidades individuales se combinan y se prueban como un grupo. El objetivo de este nivel de pruebas es exponer los fallos en la interacción entre las unidades integradas.

source: [System testing](#System_tests): A level of the software testing process where a complete, integrated system is tested. The purpose of this test is to evaluate whether the system as a whole gives the correct outputs for given inputs.
es: [Pruebas del sistema](#Pruebas_del_sistema): Un nivel del proceso de pruebas de software en el que se prueba un sistema completo e integrado. El objetivo de esta prueba es evaluar si el sistema en su conjunto ofrece las salidas correctas para unas entradas determinadas.

source: [Acceptance testing](#Acceptance_testing): A level of the software testing process where a system is tested for acceptability. The purpose of this test is to evaluate the system's compliance with the project requirements and assess whether it is acceptable for the purpose.
es: [Prueba de aceptación](#Prueba_de_aceptación): Nivel del proceso de prueba de software en el que se comprueba la aceptabilidad de un sistema. El objetivo de esta prueba es evaluar el cumplimiento del sistema con los requisitos del proyecto y valorar si es aceptable para el propósito.

source: Here's an analogy: during the process of manufacturing a ballpoint pen, the cap, the body, the tail, the ink cartridge and the ballpoint are produced separately and unit tested separately. When two or more units are ready, they are assembled and integration testing is performed, for example a test to check the cap fits on the body. When the complete pen is integrated, system testing is performed to check it can be used to write like any pen should. Acceptance testing could be a check to ensure the pen is the colour the customer ordered.
es: He aquí una analogía: durante el proceso de fabricación de un bolígrafo, el gorro, el cuerpo, la cola, el cartucho de tinta y el bolígrafo se producen por separado y se prueban por separado. Cuando dos o más unidades están listas, se ensamblan y se realizan pruebas de integración, por ejemplo una prueba para comprobar que el capuchón encaja en el cuerpo. Cuando el bolígrafo completo está integrado, se realizan pruebas del sistema para comprobar que puede utilizarse para escribir como cualquier bolígrafo. Las pruebas de aceptación pueden consistir en comprobar que el bolígrafo es del color que pidió el cliente.

source: There is also another kind of testing called regression testing. Regression testing is a type of testing that can be performed at any of the four main levels and compares the results of tests before and after a change is made to the code, and gives an error if these are different.
es: También existe otro tipo de pruebas llamadas de regresión. Las pruebas de regresión son un tipo de prueba que puede realizarse en cualquiera de los cuatro niveles principales y que compara los resultados de las pruebas antes y después de realizar un cambio en el código, y da un error si estos son diferentes.

source: These different types of tests will now be discussed in more detail.
es: A continuación, examinaremos con mayor detenimiento estos diferentes tipos de pruebas.

source: ## Smoke testing
es: ## Prueba de humo

source: Smoke tests (also known as build verification tests) are a special kind of initial checks designed to ensure very basic functionality as well as some basic implementation and environmental assumptions. Smoke tests are generally run at the very start of each testing cycle as a sanity check before running a more complete test suite.
es: Las pruebas de humo (también conocidas como pruebas de verificación de la compilación) son un tipo especial de verificaciones iniciales diseñadas para garantizar una funcionalidad muy básica, así como algunas suposiciones básicas de implementación y de entorno. Las pruebas de simulación se realizan generalmente al principio de cada ciclo de pruebas, como una comprobación de la coherencia antes de ejecutar un conjunto de pruebas más completo.

source: The idea behind this type of test is to help to catch big red flags in an implementation and to bring attention to problems that might indicate that further testing is either not possible or not worthwhile. Normally, the tester is asking whether any components are so obviously or badly broken that the build is not worth testing or some components are broken in obvious ways that suggest a corrupt build or some critical fixes that are the primary intent of the new build didn't work. Smoke tests are not very extensive, but should be extremely quick. If a change to a project causes it to fail a smoke test, its an early signal that core assertions were broken and that you should not devote any more time to testing until the problem is resolved. For example if a function that reads in the data a project requires to run is broken there's no point testing any further before that's fixed. The typical result of a failed smoke test is rejection of the build (testing of the build stops) not just a new set of bug reports.
es: La idea detrás de este tipo de prueba es ayudar a detectar grandes alarmas en una implementación y llamar la atención sobre los problemas que podrían indicar que no es posible realizar más pruebas o que no vale la pena hacerlo. Normalmente, la persona que realiza las pruebas se pregunta si algún componente está tan evidentemente o gravemente roto que no merece la pena probar la compilación, o si algunos componentes están rotos de forma evidente, lo que sugiere que la compilación está corrupta o que algunas correcciones críticas que son la intención principal de la nueva compilación no han funcionado. Las pruebas de humo no son muy extensas, pero deberían ser extremadamente rápidas. Si un cambio en un proyecto hace que falle una prueba de humo, es una señal temprana de que las afirmaciones del núcleo estaban rotas y que no deberías dedicar más tiempo a las pruebas hasta que el problema se resuelva. Por ejemplo, si una función que lee los datos que necesita un proyecto para ejecutarse no funciona, no tiene sentido seguir probando hasta que se solucione. El resultado típico de una prueba de humo fallida es el rechazo de la compilación (las pruebas de la compilación se detienen) no sólo un nuevo conjunto de informes de errores.

source: ## Unit tests
es: ## Pruebas unitarias

source: Unit tests are responsible for testing individual elements of code in an isolated and highly targeted way. The functionality of individual functions and classes are tested on their own. The purpose is to validate that each unit of the software performs as designed. A unit is the smallest testable part of any software. In procedural programming, a unit may be an individual program, function or procedure. In object-oriented programming the smallest unit is typically a method. It usually has one or a few inputs and usually a single output. Any external dependencies should be replaced with [stub or mock implementations](#Use_test_doubles_stubs_mocking_where_appropriate) to focus the test completely on the code in question.
es: Las pruebas unitarias se encargan de probar elementos individuales del código de forma aislada y muy específica. La funcionalidad de las funciones y clases individuales se comprueba por sí sola. El objetivo es validar que cada unidad del software funcione como se ha diseñado. Una unidad es la parte más pequeña que se puede probar de cualquier software. En la programación de procedimientos, una unidad puede ser un programa individual, una función o un procedimiento. En la programación orientada a objetos, la unidad más pequeña suele ser un método. Suele tener una o pocas entradas y normalmente una única salida. Cualquier dependencia externa debe ser sustituida por [implementaciones stub o mock](#Use_test_doubles_stubs_mocking_where_appropriate) para centrar la prueba completamente en el código correspondiente.

source: Unit tests are essential to test the correctness of individual code components for internal consistency and correctness before they are placed in more complex contexts. The limited extent of the tests and the removal of dependencies makes it easier to hunt down the cause of any defects. It also is the best time to test a variety of inputs and code branches that might be difficult to hit later on. For example system tests are often time consuming to run and it will likely be impractical to have system tests for every possible path through a code that has more than a few conditional statements. Unit tests are smaller, faster, and so it is more practical to cover all possible cases with them.
es: Las pruebas unitarias son esenciales para comprobar la coherencia interna y la corrección de los componentes individuales del código antes de colocarlos en contextos más complejos. La extensión limitada de las pruebas y la eliminación de dependencias facilitan la búsqueda de la causa de cualquier defecto. También es el mejor momento para probar una variedad de entradas y ramas de código que podrían ser difíciles de atacar más adelante. Por ejemplo, las pruebas del sistema suelen llevar mucho tiempo y probablemente no sea práctico tener pruebas del sistema para todas las rutas posibles a través de un código que tiene más de unas pocas declaraciones condicionales. Las pruebas unitarias son más pequeñas y rápidas, por lo que es más práctico cubrir todos los casos posibles con ellas.

source: Often, after any smoke tests, unit tests are the first tests that are run when any changes are made.
es: A menudo, después de cualquier prueba de humo, las pruebas unitarias son las primeras pruebas que se ejecutan cuando se realiza cualquier cambio.

source: ### Benefits of unit testing
es: ### Beneficios de las pruebas unitarias

source: If a researcher makes a change to a piece of code or how it is run then how can they be sure that doing so has not broken something? They may run a few tests, but without testing every small piece of code individually how can they be certain? Unit testing gives researchers that certainty, and allows them to be confident when changing and maintaining their code.
es: Si un investigador realiza un cambio en un fragmento de código o en la forma de ejecutarlo, ¿cómo puede estar seguro de que al hacerlo no se ha roto algo? Pueden realizar algunas pruebas, pero si no prueban cada pequeño fragmento de código individualmente, ¿cómo pueden estar seguros? Las pruebas unitarias ofrecen a los investigadores esa certeza y les permiten estar seguros al cambiar y mantener su código.

source: Here's a little example. Say a researcher has a small function that does one simple thing (here only a single line for brevity). In this example this will be raising a number to the 5th power:
es: He aquí un pequeño ejemplo. Digamos que un investigador tiene una pequeña función que hace una cosa simple (aquí sólo una línea para ser breve). En este ejemplo será elevar un número a la 5ª potencia:

source: The unit test for this function could look like this:
es: La prueba unitaria para esta función podría ser así:

source: So it checks that the correct result is outputted for a given input. If not the test will fail. The researcher carries on with their work. In the middle of it they decide to tidy up this function, multiplying the number five times like this is a bit crude. They change the `result = x * x * x * x * x` line to `result = x * 5`. Next time they run their unit tests, this test will fail, because they just made a mistake. Maybe they needed a coffee, maybe their finger slipped, maybe their coworker shot them in the ear with a nerf dart and distracted them, but when they were tidying up this function they should have written `result = x ** 5` *not* `result = x * 5`. The failed test will flag up the mistake and it can quickly be corrected. If a mistake like this went unobserved it could lead to serious errors in the researcher's work.
es: Por lo tanto, comprueba que se obtiene el resultado correcto para una entrada determinada. Si no es así, la prueba fallará. El investigador continúa con su trabajo. En medio de él deciden poner en orden esta función, multiplicar el número cinco veces así es un poco burdo. Cambian la línea `result = x * x * x * x` por `result = x * 5`. La próxima vez que ejecuten sus pruebas unitarias, esta prueba fallará, porque acaban de cometer un error. Tal vez necesitaban un café, tal vez se les resbaló el dedo, tal vez su compañero de trabajo les disparó en la oreja con un dardo nerf y les distrajo, pero cuando estaban ordenando esta función deberían haber escrito `result = x ** 5` *no* `result = x * 5`. La prueba fallida señalará el error y se podrá corregir rápidamente. Si un error como éste pasara desapercibido, podría dar lugar a graves errores en el trabajo del investigador.

source: So unit testing leads to more reliable code, but there are other benefits too. Firstly it makes development faster by making bugs easier to find. Larger-scale tests which test large chunks of code (while still useful) have the disadvantage that if they fail it is difficult to pinpoint the source of the bug. Because unit tests by their very definition test small pieces of code they help developers find the cause of a bug much more quickly than higher-level tests or code with no tests at all. Unit tests also make fixing bugs faster and easier because they catch bugs early while they only impact small individual units. If bugs are not detected early via unit tests then it may be a long time before they are discovered, impacting later work that built on the faulty code. This means much more code is at risk and fixing the bug is more time consuming.
es: Así que las pruebas unitarias conducen a un código más fiable, pero también hay otros beneficios. En primer lugar, agiliza el desarrollo al facilitar la detección de errores. Las pruebas a gran escala que comprueban grandes fragmentos de código (aunque siguen siendo útiles) tienen la desventaja de que si fallan es difícil localizar el origen del problema. Dado que las pruebas unitarias, por su propia definición, comprueban pequeños fragmentos de código, ayudan a los desarrolladores a encontrar la causa de un error mucho más rápidamente que las pruebas de nivel superior o el código sin pruebas. Las pruebas unitarias también facilitan y agilizan la corrección de errores, ya que los detectan con antelación cuando sólo afectan a pequeñas unidades individuales. Si los errores no se detectan pronto mediante pruebas unitarias, puede pasar mucho tiempo antes de que se descubran, lo que afecta al trabajo posterior que se ha construido sobre el código defectuoso. Esto significa que hay mucho más código en riesgo y que arreglar el fallo lleva más tiempo.

source: The other major benefit of unit testing is that it strongly incentivises researchers to write modular code because modular code is far easier to write unit tests for. Modular code is code that is broken up into manageable chunks which each accomplish simple tasks. This is typically achieved by dividing the code into functions and groups of functions. In contrast a script which is just one long continuous series of lines which produces a result is highly non-modular.
es: La otra gran ventaja de las pruebas unitarias es que incentivan fuertemente a los investigadores a escribir código modular, porque el código modular es mucho más fácil de escribir pruebas unitarias. El código modular es un código dividido en trozos manejables que realizan tareas sencillas. Esto se consigue normalmente dividiendo el código en funciones y grupos de funciones. Por el contrario, un script que es sólo una larga serie continua de líneas que produce un resultado es altamente no modular.

source: Modular code is much easier to reuse, for example if a researcher has a individual function that does some Useful Thing and in a future project they need to do that thing again it is trivial to copy or import the function. In contrast if the code that does this Useful Thing is entwined with a great deal of other code in a long script it is much harder to separate it out for re-use.
es: El código modular es mucho más fácil de reutilizar, por ejemplo, si un investigador tiene una función individual que hace alguna acción útil y en un futuro proyecto necesita hacer esa acción de nuevo, es sencillo copiar o importar la función. Por el contrario, si el código que hace esta acción útil está entrelazado con una gran cantidad de otro código en un largo script, es mucho más difícil separarlo para su reutilización.

source: ### Unit testing tips
es: ### Consejos para las pruebas unitarias

source: - Many testing frameworks have tools specifically geared towards writing and running unit tests.
es: - Muchos marcos de pruebas tienen herramientas específicamente orientadas a escribir y ejecutar pruebas unitarias.

source: - Isolate the development environment from the test environment.
es: - Aislar el entorno de desarrollo del entorno de pruebas.

source: - Write test cases that are independent of each other. For example, if a unit A utilises the result of another unit B supplies you should test unit A with a [test double](#Use_test_doubles_stubs_mocking_where_appropriate), rather than actually calling the unit B. If you don't do this your test failing may be due to a fault in either unit A *or* unit B, making the bug harder to trace.
es: - Escribe casos de prueba que sean independientes entre sí. Por ejemplo, si una unidad A utiliza el resultado de otra unidad B, debería probar la unidad A con una [prueba doble](#Use_test_doubles_stubs_mocking_where_appropriate), en lugar de llamar a la unidad B. Si no hace esto, tu prueba puede fallar debido a un fallo en la unidad A *o* en la unidad B, haciendo que el fallo sea más difícil de rastrear.

source: - Aim at covering all paths through a unit. Pay particular attention to loop conditions.
es: - Intenta cubrir todos los caminos a través de una unidad. Presta especial atención a las condiciones de los bucles.

source: - In addition to writing cases to verify the behaviour, write cases to ensure the performance of the code. For example, if a function that is supposed to add two numbers takes several minutes to run there is likely a problem.
es: - Además de escribir casos para verificar el comportamiento, escribe casos para asegurar el rendimiento del código. Por ejemplo, si una función que debe sumar dos números tarda varios minutos en ejecutarse es probable que haya un problema.

source: - If you find a defect in your code write a test that exposes it. Why? First, you will later be able to catch the defect if you do not fix it properly. Second, your test suite is now more comprehensive. Third, you will most probably be too lazy to write the test after you have already fixed the defect. Say a code has a simple function to classify people as either adults or children:
es: - Si encuentras un defecto en tu código escribe una prueba que lo exponga. ¿Por qué? En primer lugar, más tarde podrá detectar el defecto si no lo corrige correctamente. En segundo lugar, su conjunto de pruebas es ahora más completo. En tercer lugar, lo más probable es que te dé pereza escribir la prueba cuando ya hayas corregido el defecto. Digamos que un código tiene una función sencilla para clasificar a las personas como adultos o niños:

source: And say this code has a unit test like this:
es: Y digamos que este código tiene una prueba unitaria como esta

source: There's a problem with this code that isn't being tested: if a negative age is supplied it will happily classify the person as a child despite negative ages not being possible. The code should throw an error in this case. So once the bug is fixed:
es: Hay un problema con este código que no se está probando: si se suministra una edad negativa, clasificará sin problemas a la persona como un niño a pesar de que las edades negativas no son posibles. El código debería lanzar un error en este caso. Por lo tanto, una vez que se solucione el error:

source: go ahead and write a test to ensure that future changes in the code can't cause it to happen again:
es: seguir adelante y escribir una prueba para asegurarse de que los futuros cambios en el código no puede causar que suceda de nuevo:
