Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/testing.*.po
Languages: es

source: Integration testing is a level of software testing where individual units are combined and tested as a group. While unit tests validate the functionality of code in isolation, integration tests ensure that components cooperate when interfacing with one another. The purpose of this level of testing is to expose faults in the interaction between integrated units.
es: Las pruebas de integración son un nivel de pruebas de software en el que las unidades individuales se combinan y se prueban como un grupo. Mientras que las pruebas unitarias validan la funcionalidad del código de forma aislada, las pruebas de integración garantizan que los componentes cooperan cuando se interconectan entre sí. El objetivo de este nivel de pruebas es exponer los fallos en la interacción entre las unidades integradas.

source: For example, maybe a unit that reads in some data is working and passes its unit tests, and the following unit that cleans up the data once it's been read in is also working and passes its tests. However say the first unit outputs the data as (time_data, temperature_data) but the function that cleans the data expects input of the form (temperature_data, time_data). This can obviously lead to bugs. While the units are correct there in an error in their integration.
es: Por ejemplo, puede que una unidad que lee unos datos funcione y pase sus pruebas unitarias, y que la siguiente unidad que limpia los datos una vez leídos también funcione y pase sus pruebas. Sin embargo, digamos que la primera unidad da salida a los datos como (datos_tiempo, datos_temperatura) pero la función que limpia los datos espera una entrada de la forma (datos_temperatura, datos_tiempo). Obviamente, esto puede dar lugar a errores. Mientras que las unidades son correctas hay un error en su integración.

source: An example of an integration test for this case could be to supply a test data file, use these functions to read it in and clean it, and check the resulting cleaned data against what would be expected. If a bug like this is present then the cleaned data outputted would be very unlikely to match the expected result, and an error would be raised.
es: Un ejemplo de prueba de integración para este caso podría ser suministrar un archivo de datos de prueba, utilizar estas funciones para leerlo y limpiarlo, y comprobar los datos limpiados resultantes con lo que se esperaba. Si hay un error de este tipo, es muy poco probable que los datos limpiados que se obtengan coincidan con el resultado esperado, y se producirá un error.

source: Integration testing is particularly important in collaborative projects where different people work on different parts of the code. If two different people complete separate units and then need to integrate then integration issues are more likely as neither may understand the other's code. A famous example of this is a multi-million dollar satellite which [crashed](https://en.wikipedia.org/wiki/Mars_Climate_Orbiter) because one piece of code outputted distance data in feet, while another assumed data in meters. This is another example of an integration issue.
es: Las pruebas de integración son especialmente importantes en los proyectos de colaboración en los que diferentes personas trabajan en distintas partes del código. Si dos personas diferentes completan unidades separadas y luego tienen que integrarlas, los problemas de integración son más probables, ya que ninguno de ellos puede entender el código del otro. Un ejemplo famoso es el de un satélite multimillonario que se [estrelló](https://en.wikipedia.org/wiki/Mars_Climate_Orbiter) porque una parte del código daba los datos de la distancia en pies, mientras que otra asumía los datos en metros. Este es otro ejemplo de problema de integración.

source: A sub type of integration testing is system integration testing. This tests the integration of systems, packages and any interfaces to external organizations (such as Electronic Data Interchange, Internet). Depending on the nature of a project system integration testing may or may not be applicable.
es: Un subtipo de prueba de integración es la prueba de integración de sistemas. En ellas se comprueba la integración de sistemas, paquetes y cualquier interfaz con organizaciones externas (como el intercambio electrónico de datos o Internet). Dependiendo de la naturaleza del proyecto, las pruebas de integración del sistema pueden ser aplicables o no.

source: ### Approaches
es: ### Enfoques

source: There are several different approaches to integration testing. Big Bang is an approach to integration testing where all or most of the units are combined together and tested at one go. This approach is taken when the testing team receives the entire software in a bundle. So what is the difference between Big Bang integration testing and system testing? Well, the former tests only the interactions between the units while the latter tests the entire system.
es: Hay varios enfoques diferentes para las pruebas de integración. El Big Bang es un enfoque de las pruebas de integración en el que todas o la mayoría de las unidades se combinan y se prueban de una sola vez. Este enfoque se adopta cuando el equipo de pruebas recibe todo el software en un paquete. ¿Cuál es la diferencia entre las pruebas de integración Big Bang y las pruebas del sistema? Pues que las primeras sólo prueban las interacciones entre las unidades, mientras que las segundas prueban todo el sistema.

source: Top Down is an approach to integration testing where top-level sections of the code (that themselves contain many smaller units) are tested first and lower level units are tested step by step after that. So is a code can be split into the main steps A, B, and C, and each of those contain steps to complete them, and these steps may have substeps like:
es: Top Down es un enfoque de las pruebas de integración en el que las secciones de nivel superior del código (que a su vez contienen muchas unidades más pequeñas) se prueban primero y las unidades de nivel inferior se prueban paso a paso después. Así, un código puede dividirse en los pasos principales A, B y C, y cada uno de ellos contiene pasos para completarlos, y estos pasos pueden tener subpasos como:

source: So in the top down approach the integration between sections at the top level (A, B and C) are tested, then integration between sections at the next level (for example, A.1 -> A.2) and so on. Testing upper level units by running all the code they contain including running lower level ones can lead to upper level tests breaking due to bugs in low level units. This is undesirable, so to prevent this the lower level sections should not be run, but [test stubs](#Use_test_doubles_stubs_mocking_where_appropriate) should be used to simulate the outputs from them.
es: Así, en el enfoque descendente se prueba la integración entre las secciones del nivel superior (A, B y C), luego la integración entre las secciones del siguiente nivel (por ejemplo, A.1 -> A.2) y así sucesivamente. Probar las unidades de nivel superior ejecutando todo el código que contienen, incluyendo la ejecución de las de nivel inferior, puede llevar a que las pruebas de nivel superior se rompan debido a fallos en las unidades de nivel inferior. Esto no es deseable, por lo que para evitarlo no deben ejecutarse las secciones de nivel inferior, sino que deben utilizarse [prueba de simulación](#Use_test_doubles_stubs_mocking_where_appropriate) para simular las salidas de las mismas.

source: Bottom Up is an approach to integration testing where integration between bottom level sections are tested first and upper-level sections step by step after that. Again test stubs should be used, in this case to simulate inputs from higher level sections.
es: Bottom Up es un enfoque de las pruebas de integración en el que la integración entre las secciones de nivel inferior se prueba primero y las secciones de nivel superior paso a paso después. Una vez más, hay que utilizar las prueba simulación, en este caso para simular las entradas de las secciones de nivel superior.

source: Sandwich/Hybrid is an approach to integration testing which is a combination of Top Down and Bottom Up approaches.
es: Sándwich/Híbrido es un enfoque de las pruebas de integración que es una combinación de los enfoques Top Down y Bottom Up.

source: Which approach you should use will depend on which best suits the nature/structure of your project.
es: El enfoque que deba utilizar dependerá del que mejor se adapte a la naturaleza/estructura de su proyecto.

source: ### Integration testing tips
es: ### Consejos para las pruebas de integración

source: - Ensure that you have a proper Detail Design document where interactions between each unit are clearly defined. It is difficult or impossible to perform integration testing without this information.
es: - Asegúrate de que dispone de un documento de diseño detallado adecuado en el que las interacciones entre cada unidad estén claramente definidas. Es difícil o imposible realizar pruebas de integración sin esta información.

source: - Make sure that each unit is unit tested and fix any bugs before you start integration testing. If there is a bug in the individual units then the integration tests will almost certainly fail even if there is no error in how they are integrated.
es: - Asegúrate de que cada unidad se somete a pruebas unitarias y corrige cualquier error antes de empezar las pruebas de integración. Si hay un error en las unidades individuales, es casi seguro que las pruebas de integración fallarán aunque no haya ningún error en la forma de integrarlas.

source: - Use mocking/stubs where appropriate.
es: - Utilizar burlas/esquemas cuando sea necesario.

source: ## System tests
es: ## Pruebas del sistema

source: Once integration tests are performed, another level of testing called system testing can begin. System testing is a level of software testing where a complete and integrated software is tested. The tester supplies the program with input and verifies if the program's output is correct. If it is not then there is a problem somewhere in the system. Note that this does not have to be done manually, it can be automated. The purpose of these tests is to evaluate the system's compliance with the specified requirements. In many ways, system testing acts as an extension to integration testing. The focus of system tests are to make sure that groups of components function correctly as a cohesive whole.
es: Una vez realizadas las pruebas de integración, puede comenzar otro nivel de pruebas denominado pruebas del sistema. Las pruebas del sistema son un nivel de pruebas de software en el que se comprueba un software completo e integrado. El probador suministra al programa una entrada y verifica si la salida del programa es correcta. Si no lo es, hay un problema en alguna parte del sistema. Hay que tener en cuenta que esto no tiene que hacerse manualmente, sino que puede automatizarse. El objetivo de estas pruebas es evaluar la conformidad del sistema con los requisitos especificados. En muchos sentidos, las pruebas del sistema son una extensión de las pruebas de integración. El objetivo de las pruebas del sistema es asegurarse de que los grupos de componentes funcionan correctamente como un todo cohesionado.

source: However, instead of focusing on the interfaces between components, system tests typically evaluate the outward functionality of a full piece of software. This set of tests ignores the constituent parts in order to gauge the composed software as a unified entity. Because of this distinction, system tests usually focus on user- or externally-accessible outputs.
es: Sin embargo, en lugar de centrarse en las interfaces entre componentes, las pruebas del sistema suelen evaluar la funcionalidad externa de una pieza completa de software. Este conjunto de pruebas ignora las partes constituyentes para evaluar el software compuesto como una entidad unificada. Debido a esta distinción, las pruebas del sistema suelen centrarse en los resultados accesibles al usuario o al exterior.

source: System testing can also test features of the system other than correctness. Examples include:
es: Las pruebas del sistema también pueden comprobar características del sistema distintas de la corrección. Algunos ejemplos son:

source: - Performance testing: does the program performance meet the minimum requirements? A performance test may measure how long the system takes to run in a given case.
es: - Pruebas de rendimiento: ¿el rendimiento del programa cumple los requisitos mínimos? Una prueba de rendimiento puede medir el tiempo que tarda el sistema en ejecutarse en un caso determinado.

source: - Migration testing: does the program work when transferred to another computational environment?
es: - Pruebas de migración: ¿funciona el programa cuando se transfiere a otro entorno informático?

source: - Stress/scale/load testing: testing how the program behaves when under stress, for example, when required to process very large volumes of data.
es: - Pruebas de estrés/escala/carga: comprobar cómo se comporta el programa en situaciones de estrés, por ejemplo, cuando se le pide que procese un gran volumen de datos.

source: - Usability testing: how user-friendly is the program (more common in commercial software, tests typically conducted by humans rather than automated).
es: - Pruebas de usabilidad: cómo de fácil es el programa (más común en el software comercial, las pruebas suelen ser realizadas por humanos en lugar de automatizadas).

source: - Recovery testing: Can the program continue if errors occur (again, more common in commercial software).
es: - Pruebas de recuperación: El programa puede continuar si se producen errores (de nuevo, es más común en el software comercial).

source: ### System testing tips
es: ### Consejos para las pruebas del sistema

source: System tests, also called end-to-end tests, run the program, well, from end to end. As such these are the most time consuming tests to run. Therefore you should only run these if all the lower-level tests (smoke, unit, integration) have already passed. If they haven't fix the issues they have detected first before wasting time running system tests.
es: Las pruebas del sistema, también llamadas pruebas de final a final, ejecutan el programa de principio a fin. Por ello, son las que más tiempo. Por lo tanto, sólo debe ejecutarlas si todas las pruebas de nivel inferior (simulación, unidad, integración) ya han pasado. Si no lo han hecho, arregla primero los problemas que han detectado antes de perder el tiempo ejecutando las pruebas del sistema.

source: Because of their time-consuming nature it will also often be impractical to have enough system tests to trace every possible route through a program, especially is there are a significant number of conditional statements. Therefore you should consider the system test cases you run carefully and prioritise:
es: Debido a su naturaleza, que consume mucho tiempo, a menudo no es práctico tener suficientes pruebas del sistema para rastrear todas las rutas posibles a través de un programa, especialmente si hay un número significativo de declaraciones condicionales. Por lo tanto, hay que considerar cuidadosamente los casos de prueba del sistema que se ejecutan y priorizarlos:

source: - The most common routes through a program.
es: - Las rutas más comunes a través de un programa.

source: - The most important routes for a program. For example, the LIGO detector aims to find gravitational wave events, which are extremely rare. If there's a bug in that path through the program which monitors the detector then it's a *huge* problem.
es: - Las rutas más importantes para un programa. Por ejemplo, el detector LIGO tiene como objetivo encontrar eventos de ondas gravitacionales, que son extremadamente raros. Si hay un error en esa ruta a través del programa que monitoriza el detector entonces es un *gran problema*.

source: - Cases that are prone to breakage due to structural problems within the program. Though ideally it's better to just fix those problems, but cases exist where this may not be feasible.
es: - Casos que son propensos a romperse debido a problemas estructurales dentro del programa. Aunque lo ideal es arreglar simplemente esos problemas, pero existen casos en los que esto puede no ser factible.

source: Because system tests can be time consuming it may be impractical to run them very regularly (such as multiple times a day after small changes in the code). Therefore it can be a good idea to run them each night (and to automate this process) so that if errors are introduced that only system testing can detect the programmer will be made of them relatively quickly.
es: Dado que las pruebas del sistema pueden requerir mucho tiempo, puede resultar poco práctico ejecutarlas con mucha regularidad (por ejemplo, varias veces al día tras pequeños cambios en el código). Por lo tanto, puede ser una buena idea ejecutarlas cada noche (y automatizar este proceso) para que si se introducen errores que sólo las pruebas del sistema pueden detectar, el programador se entere de ellos con relativa rapidez.

source: ## Acceptance testing
es: ## Pruebas de aceptación

source: Acceptance tests are one of the last tests types that are performed on software prior to delivery. Acceptance testing is used to determine whether a piece of software satisfies all of the requirements from the business or user's perspective. Does this piece of software do what it needs to do? These tests are sometimes built against the original specification.
es: Las pruebas de aceptación son uno de los últimos tipos de pruebas que se realizan en el software antes de su entrega. Las pruebas de aceptación sirven para determinar si un programa informático satisface todos los requisitos desde el punto de vista de la empresa o del usuario. ¿Hace este software lo que tiene que hacer? A veces, estas pruebas se realizan a partir de la especificación original.

source: Because research software is typically written by the researcher that will use it (or at least with significant input from them) acceptance tests may not be necessary.
es: Dado que el software de investigación suele ser escrito por el investigador que lo va a utilizar (o, al menos, con una aportación importante por su parte), las pruebas de aceptación pueden no ser necesarias.

source: ## Regression testing
es: ## Prueba de regresión

source: Regression testing is a style of testing that focuses on retesting after changes are made. The results of tests after the changes are compared to the results before, and errors are raised if these are different. Regression testing is intended to ensure that changes (enhancements or defect fixes) to the software have not adversely affected it. The likelihood of any code change impacting functionalities that are not directly associated with the code is always there and it is essential that regression testing is conducted to make sure that fixing one thing has not broken another. Regression testing can be performed during any level of testing (unit, integration, system, or acceptance) but it is mostly relevant during system testing. Any test can be reused, and so any test can become a regression test.
es: Las pruebas de regresión son un estilo de prueba que se centra en volver a probar después de realizar cambios. Los resultados de las pruebas después de los cambios se comparan con los resultados anteriores, y se plantean errores si son diferentes. Las pruebas de regresión pretenden garantizar que los cambios (mejoras o correcciones de defectos) realizados en el software no lo han afectado negativamente. La probabilidad de que cualquier cambio de código afecte a funcionalidades que no están directamente asociadas al código siempre está ahí y es esencial que se realicen pruebas de regresión para asegurarse de que al arreglar una cosa no se ha roto otra. Las pruebas de regresión pueden realizarse durante cualquier nivel de pruebas (unitarias, de integración, del sistema o de aceptación), pero son más relevantes durante las pruebas del sistema. Cualquier prueba puede reutilizarse, por lo que cualquier prueba puede convertirse en una prueba de regresión.

source: Regression testing is obviously especially important in team working, but it is surprisingly easy to break your own code without noticing it, even if you are working on your own. And because regression testing is next to impossible to do satisfactorily by hand (it's simply too tedious), it's an obvious case for automation.
es: Las pruebas de regresión son, obviamente, especialmente importantes en el trabajo en equipo, pero es sorprendentemente fácil romper tu propio código sin darte cuenta, incluso si estás trabajando por tu cuenta. Y dado que las pruebas de regresión son prácticamente imposibles de realizar de forma satisfactoria a mano (es simplemente demasiado tedioso), es un ejemplo obvio para la automatización.

source: Regression tests are written by first running the (or part of the) code for given inputs and recording the outputs. This could be done by writing input files and saving the corresponding output files. These outputs serve as the expected outputs from the program given the corresponding inputs. Regression tests are then written. Each regression test runs the code for the set of inputs. It then compares the output from the code to the expected outputs, and raises an error if these do not match.
es: Las pruebas de regresión se escriben ejecutando primero el código (o parte de él) para unas entradas determinadas y registrando las salidas. Esto puede hacerse escribiendo archivos de entrada y guardando los correspondientes archivos de salida. Estas salidas sirven como salidas esperadas del programa dadas las entradas correspondientes. A continuación, se escriben las pruebas de regresión. Cada prueba de regresión ejecuta el código para el conjunto de entradas. Posteriormente, se compara la salida del código con las salidas esperadas y se produce un error si no coinciden.

source: Regression testing approaches differ in their focus. Common examples include:
es: Los enfoques de las pruebas de regresión difieren en su enfoque. Algunos ejemplos comunes son:

source: - Bug regression: We retest a specific bug that has been allegedly fixed.
es: - Regresión de errores: Volvemos a probar un error específico que supuestamente se ha solucionado.

source: - Old fix regression testing: We retest several old bugs that were fixed, to see if they are back. (This is the classical notion of regression: the program has regressed to a bad state.)
es: - Pruebas de regresión de arreglos antiguos: Volvemos a probar varios errores antiguos que fueron corregidos, para ver si vuelven a aparecer. (Esta es la noción clásica de regresión: el programa ha retrocedido a un mal estado).

source: - General functional regression: We retest the project broadly, including areas that worked before, to see whether more recent changes have destabilized working code.
es: - Regresión funcional general: Volvemos a probar el proyecto en general, incluyendo las áreas que funcionaban antes, para ver si los cambios más recientes han desestabilizado el código de trabajo.

source: - Conversion or port testing: The program is ported to a new platform and a regression test suite is run to determine whether the port was successful.
es: - Pruebas de conversión o portabilidad: El programa se traslada a una nueva plataforma y se ejecuta un conjunto de pruebas de regresión para determinar si el traslado se ha realizado correctamente.
