Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/testing.*.po
Languages: es

source: - [Testing your software](https://software.ac.uk/resources/guides/testing-your-software) **Creative Commons Attribution-NonCommercial 3.0 License.**
es: - [Probando tu software ](https://software.ac.uk/resources/guides/testing-your-software) **Licencia Creative Commons Atribución-NoComercial 3.0.**

source: - [Why bother](http://soundsoftware.ac.uk/unit-testing-why-bother/) **Creative Commons Attribution-NonCommercial 3.0 License.**
es: - [Por qué molestarse ](http://soundsoftware.ac.uk/unit-testing-why-bother/) **Licencia Creative Commons Reconocimiento-No Comercial 3.0.**

source: ### Materials used: glossary
es: ### Materiales utilizados: glosario

source: - [Netherlands eScience centre](https://guide.esciencecenter.nl/best_practices/testing.html) **Creative Commons Attribution 4.0 International License**
es: - [Netherlands eScience centre](https://guide.esciencecenter.nl/best_practices/testing.html) **Licencia internacional Creative Commons Attribution 4.0**
