Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/testing.*.po
Languages: es

source: Make the cases you test as realistic as possible. If for example, you have dummy data to run tests on you should make sure that data is as similar as possible to the actual data. If your actual data is messy with a lot of null values, so should your test dataset be.
es: Haz que los casos que pruebes sean lo más realistas posible. Si, por ejemplo, tienes datos ficticios para realizar las pruebas, debes asegurarte de que los datos sean lo más parecidos posible a los reales. Si los datos reales están desordenados con muchos valores nulos, también debería serlo el conjunto de datos de prueba.

source: ### Use a testing framework
es: ### Usa un framework de pruebas

source: There are tools available to make writing and running tests easier, these are known as testing frameworks. Find one you like, learn about the features it offers, and make use of them. Common testing frameworks (and the languages they apply to) include:
es: Hay herramientas disponibles para facilitar la escritura y ejecución de pruebas, conocidas como marcos de texting (frameworks). Encuentre uno que le guste, conozca las funciones que ofrece y úselas. Los marcos de testing comunes (y los lenguajes a los que se aplican) incluyen:

source: - Language agnostic
es: - Agnóstico de lenguaje

source: - CTest, test runner for executables, bash scripts, and more. Great for legacy code hardening
es: - CTest, programa de pruebas para ejecutables, scripts bash y más. Ideal para el endurecimiento del código heredado

source: - pytest (recommended)
es: - pytest (recomendado)

source: - unittest comes with standard Python library
es: - unittest viene con la biblioteca estándar de Python

source: - svUnit (works with SciViews GUI)
es: - svUnit (funciona con la interfaz gráfica de SciViews)

source: - pfunit (works with MPI)
es: - pfunit (funciona con MPI)

source: ### Aim to have a good code coverage
es: ### Apunta a tener una buena cobertura del código

source: Code coverage is a measure of how much of your code is "covered" by tests. More precisely it a measure of how much of your code is run when tests are conducted. So for example, if you have a `if` statement but only test things where that if statement evaluates to "True" then none of the code that comes under "False" will be run. As a result your code coverage would be < 100% (the exact number would depend on how much code comes under the True and False cases). Code coverage doesn't include documentation like comments, so adding more documentation doesn't affect your percentages.
es: La cobertura del código es una medida de la cantidad de código que está "cubierto" por las pruebas. Más concretamente, es una medida de la cantidad de código que se ejecuta cuando se realizan las pruebas. Así, por ejemplo, si tienes una sentencia `if` pero sólo pruebas las cosas en las que esa sentencia `if` se evalúa como `Verdadero`, entonces no se ejecutará nada del código que esté bajo `Falso`. Como resultado, su cobertura de código sería <100% (el número exacto dependería de la cantidad de código que se encuentre en los casos "True" y "False"). La cobertura del código no incluye la documentación como los comentarios, por lo que añadir más documentación no afecta a sus porcentajes.

source: As [mentioned](#Write_tests_any_tests) any tests are an improvement over no tests. Nevertheless it is good to at least aspire to having your code coverage as high as feasible.
es: Como se ha mencionado]( #Write_tests_any_tests) cualquier prueba es una mejora sobre la ausencia de pruebas. Sin embargo, es bueno al menos aspirar a tener una cobertura de código tan alta como sea posible.

source: Most programming languages have tools either built into them, or that can be imported, or as part of testing frameworks, which automatically measure code coverage. There's also a nice little [bot](https://codecov.io/) for measuring code coverage available too.
es: La mayoría de los lenguajes de programación tienen herramientas incorporadas, o que se pueden importar, o como parte de los entornos de prueba, que miden automáticamente la cobertura del código. También existe un pequeño [bot](https://codecov.io/) para medir la cobertura del código.

source: **Pitfall: The illusion of good coverage.** In some instances, the same code can and probably should be tested in multiple ways. For example, coverage can quickly increase on code that applies "sanity check" tests to its output ([see below](#tests-that-are-difficult-to-quantify)), but this doesn't preclude the risk that the code is producing the broadly right answer for the wrong reasons. In general, the best tests are those that isolate the smaller rather than larger chunks of coherent code, and so pick out individual steps of logic. Try to be guided by thinking about the possible things that might happen to a particular chunk of code in the execution of the whole, and test these individual cases. Often, this will result in the same code being tested multiple times - this is a good thing!
es: **La ilusión de una buena cobertura: La ilusión de una buena cobertura.** En algunos casos, el mismo código puede y probablemente debe ser probado de múltiples maneras. Por ejemplo, la cobertura puede aumentar rápidamente en el código que aplica pruebas de "comprobación de sanidad" a su salida ([ver más abajo](#pruebas-que-son-difíciles-de-cuantificar)), pero esto no excluye el riesgo de que el código esté produciendo la respuesta ampliamente correcta por las razones equivocadas. En general, las mejores pruebas son las que aíslan los trozos más pequeños y no los más grandes de un código coherente, y por lo tanto seleccionan los pasos individuales de la lógica. Intenta guiarte pensando en las posibles cosas que pueden ocurrir a un trozo de código concreto en la ejecución del conjunto, y prueba estos casos individuales. A menudo, esto hará que el mismo código se pruebe varias veces, lo cual es bueno.

source: ### Use test doubles/stubs/mocking where appropriate
es: **### Utilizar "doubles/stubs/mockings" de pruebas cuando sea apropiado

source: If a test fails it should be constructed such that is as easy to trace the source of the failure as possible. This becomes problematic if a piece of code you want to test unavoidably depends on other things. For example if a test for a piece of code that interacts with the web fails that could be because the code has a bug *or* there is a problem with the internet connection. Similarly if a test for a piece of code that uses an object fails it could be because there is a bug in the code being tested, or a problem with the object (which should be tested by its own, separate tests). These dependencies should be eliminated from tests, if possible. This can be done via using test replacements (test doubles) in the place of the real dependencies. Test doubles can be classified as follows:
es: Si una prueba falla, debe construirse de forma que sea tan fácil rastrear el origen del fallo como sea posible. Esto se convierte en un problema si una pieza de código que quieres probar depende inevitablemente de otras cosas. Por ejemplo, si una prueba para una pieza de código que interactúa con la web falla, podría ser porque el código tiene un error *o* hay un problema con la conexión a Internet. Del mismo modo, si una prueba de un fragmento de código que utiliza un objeto falla, podría ser porque hay un error en el código que se está probando, o un problema con el objeto (que debería ser probado por sus propias pruebas, por separado). Estas dependencias deben eliminarse de las pruebas, si es posible. Esto puede hacerse mediante el uso de sustitutos de pruebas (dobles de pruebas) en lugar de las dependencias reales. Los dobles de prueba pueden clasificarse como sigue:

source: - A dummy object is passed around but never used, meaning its methods are never called. Such an object can for example be used to fill the parameter list of a method.
es: - Un objeto ficticio se pasa pero nunca se utiliza, lo que significa que sus métodos nunca se llaman. Este objeto puede utilizarse, por ejemplo, para rellenar la lista de parámetros de un método.

source: - Fake objects have working implementations, but are usually simplified. For example, they use an in memory database and not a real database.
es: - Los objetos falsos tienen implementaciones que funcionan, pero suelen estar simplificadas. Por ejemplo, utilizan una base de datos en memoria y no una base de datos real.

source: - A stub is an partial implementation for an interface or class with the purpose of using an instance of this stub during testing. Stubs usually don’t respond to anything outside what’s programmed in for the test. Stubs may also record information about calls.
es: - Un stub es una implementación parcial de una interfaz o clase con el propósito de utilizar una instancia de este stub durante las pruebas. Los stubs normalmente no responden a nada fuera de lo programado para la prueba. Los stubs también pueden registrar información sobre las llamadas.

source: - A mock object is a dummy implementation for an interface or a class in which you define the output of certain method calls. Mock objects are configured to perform a certain behaviour during a test. They typically record the interaction with the system and tests can validate that.
es: - Un objeto simulado es una implementación ficticia de una interfaz o una clase en la que se define la salida de ciertas llamadas a métodos. Los objetos simulados se configuran para realizar un determinado comportamiento durante una prueba. Suelen registrar la interacción con el sistema y las pruebas pueden validarlo.

source: Test doubles can be passed to other objects which are tested.
es: Los sustitutos de prueba se pueden pasar a otros objetos que se prueban.

source: You can create mock objects manually (via code) or use a mock framework to simulate these classes. Mock frameworks allow you to create mock objects at runtime and define their behaviour. The classical example for a mock object is a data provider. In production an implementation to connect to the real data source is used. But for testing a mock object simulates the data source and ensures that the test conditions are always the same.
es: Puedes crear objetos simulados manualmente (mediante código) o utilizar un marco de trabajo simulado para simular estas clases. Los frameworks simulados permiten crear objetos simulados en tiempo de ejecución y definir su comportamiento. El ejemplo clásico de un objeto simulado es un proveedor de datos. En producción se utiliza una implementación para conectarse a la fuente de datos real. Pero para las pruebas, un objeto simulado simula la fuente de datos y asegura que las condiciones de prueba sean siempre las mismas.

source: ### Testing stochastic code
es: ### Prueba del código estocástico

source: Sometimes code contains an element of randomness, a common example being code that makes use of [Monte Carlo methods](https://en.wikipedia.org/wiki/Monte_Carlo_method). Testing this kind of code can be very difficult because if it is run multiple times it will generate different answers, all of which may be "right", even is it contains no bugs. There are two main ways to tackle testing stochastic code:
es: A veces el código contiene un elemento de aleatoriedad, un ejemplo común es el código que hace uso de [métodos de Monte Carlo](https://en.wikipedia.org/wiki/Monte_Carlo_method). Probar este tipo de código puede ser muy difícil porque si se ejecuta varias veces generará diferentes respuestas, todas las cuales pueden ser "correctas", incluso si no contiene errores. Hay dos formas principales de abordar la comprobación del código estocástico:

source: #### Use random number seeds
es: #### Utilizar semillas de números aleatorios

source: Random number seeds are a little difficult to explain so here's an example. Here's a little Python script that prints three random numbers.
es: Las semillas de números aleatorios son un poco difíciles de explicar, así que aquí hay un ejemplo. Miremos a continuación un pequeño script en Python que imprime tres números aleatorios.

source: This script has no bugs but if you run it repeatedly you will get different answers each time. Now let's set a random number seed.
es: Este script no tiene errores pero si lo ejecutas repetidamente obtendrás respuestas diferentes cada vez. Ahora vamos a establecer una semilla de números aleatorios.

source: Now if you run this script it outputs
es: Ahora bien, si se ejecuta este script se obtiene

source: and every time you run this script you will get the *same* output, it will print the *same* three random numbers. If the random number seed is changed you will get a different three random numbers:
es: y cada vez que ejecute este script obtendrá la *misma* salida, imprimirá los *mismos* tres números aleatorios. Si se cambia la semilla de números aleatorios se obtendrán tres números aleatorios diferentes:

source: but again you will get those same numbers every time the script is run in the future.
es: pero de nuevo obtendrás esos mismos números cada vez que ejecutes el script en el futuro.

source: Random number seeds are a way of making things reliably random. However a risk with tests that depend on random number seeds is they can be brittle. Say you have a function structured something like this:
es: Las semillas de números aleatorios son una forma de hacer que las cosas sean aleatorias de una manera fiable. Sin embargo, un riesgo de las pruebas que dependen de las semillas de números aleatorios es que pueden ser frágiles. Digamos que tienes una función estructurada algo así:

source: If you set the random number seed you will always get the same value of `c`, so it can be tested. But, say the model is changed and the function that calculates `a` uses a different number of random numbers that it did previously. Now not only will `a` be different but `b` will be too, because as shown above the random numbers outputted given a random number seed are in a fixed order. As a result the random numbers produced to calculate `b` will have changed. This can lead to tests failing when there is in fact no bug.
es: Si se fija la semilla de números aleatorios siempre se obtendrá el mismo valor de `c`, por lo que se puede probar. Pero, digamos que se cambia el modelo y la función que calcula `a` utiliza un número diferente de números aleatorios que antes. Ahora no sólo `a` será diferente, sino que `b` también lo será, porque como se muestra arriba los números aleatorios producidos dada una semilla de números aleatorios están en un orden fijo. Como resultado, los números aleatorios producidos para calcular "b" habrán cambiado. Esto puede hacer que las pruebas fallen cuando en realidad no hay ningún error.

source: #### Measure the distribution of results
es: #### Medir la distribución de los resultados

source: Another way to test code with a random output is to run it many times and test the distribution of the results. Perhaps the result may fluctuate a little, but is always expected around 10 within some tolerance. That can be tested. The more times the code is run the more reliable the average and so the result. However the more times you run a piece of code the longer it will take your tests to run, which may make tests prohibitively time-consuming to conduct if a reliable result is to be obtained. Furthermore, there will always be an element of uncertainty and if the random numbers happen to fall in a certain way you may get result outside of the expected tolerance even if the code is correct.
es: Otra forma de probar el código con una salida aleatoria es ejecutarlo muchas veces y probar la distribución de los resultados. Tal vez el resultado puede fluctuar un poco, pero siempre se espera alrededor de 10 dentro de cierta tolerancia. Eso se puede probar. Cuantas más veces se ejecute el código, más fiable será la media y, por tanto, el resultado. Sin embargo, cuantas más veces se ejecute un código, más tiempo tardarán las pruebas en realizarse, lo que puede hacer que las pruebas requieran un tiempo prohibitivo si se quiere obtener un resultado fiable. Además, siempre habrá un elemento de incertidumbre y, si los números aleatorios caen de una manera determinada, es posible que se obtenga un resultado fuera de la tolerancia esperada, incluso si el código es correcto.

source: Both of these approaches to testing stochastic code can still be very useful, but it is important to also be aware of their potential pitfalls.
es: Ambos enfoques para probar el código estocástico pueden ser muy útiles, pero también es importante ser consciente de sus posibles dificultades.

source: ### Tests that are difficult to quantify
es: ### Pruebas que son difíciles de cuantificar

source: Sometimes (particularly in research) the outputs of code are tested according to whether they "look" right. For example say we have a code modelling the water levels in a reservoir over time. The result may look like this:
es: A veces (sobre todo en la investigación) los resultados del código se comprueban en función de si "parecen" correctos. Por ejemplo, digamos que tenemos un código que modela los niveles de agua en un embalse a lo largo del tiempo. El resultado puede verse así:

source: On a day with rain it might look like this:
es: En un día con lluvia podría verse así:

source: and on a dry day it might look like this:
es: y en un día seco podría tener este aspecto:

source: All of these outputs look very different but are valid. However, if a researcher sees a result like this:
es: Todos estos resultados parecen muy diferentes pero son válidos. Sin embargo, si un investigador ve un resultado como este:

source: they could easily conclude there is a bug as a lake is unlikely to triple it's volume and then lose it again in the space of a few hours. "Eyeballing" tests like these are time consuming as they must be done by a human. However the process can be partially or fully automated by creating basic "sanity checks". For example the water level at one time should be within, say, 10% of the water level at the previous time step. Another check could be that there are no negative values, as a lake can't be -30% full. These sort of tests can't cover every way something can be visibly wrong, but they are much easier to automate and will suffice for most cases.
es: podrían llegar fácilmente a la conclusión de que hay un error, ya que es poco probable que un lago triplique su volumen y lo pierda de nuevo en el espacio de unas pocas horas. "Este tipo de pruebas requieren mucho tiempo, ya que deben ser realizadas por un ser humano. Sin embargo, el proceso puede automatizarse parcial o totalmente mediante la creación de "comprobaciones de cordura" básicas. Por ejemplo, el nivel de agua en un momento dado debe estar dentro de, digamos, el 10% del nivel de agua en el paso de tiempo anterior. Otra verificación podría ser que no haya valores negativos, ya que un lago no puede estar lleno al -30%. Este tipo de pruebas no pueden cubrir todas las formas en que algo puede ser visiblemente incorrecto, pero son mucho más fáciles de automatizar y serán suficientes para la mayoría de los casos.

source: ### Testing if non-integer numbers are equal
es: ### Probar si los números no enteros son iguales

source: #### When 0.1 + 0.2 does not equal 0.3
es: #### Cuando 0,1 + 0,2 no es igual a 0,3

source: There is a complication with testing if the answer a piece of code outputs is equal to the expected answer when the numbers are not integers. Let's look at this Python example, but note that this problem is not unique to Python.
es: Existe una complicación a la hora de comprobar si la respuesta que da un fragmento de código es igual a la respuesta esperada cuando los números no son enteros. Veamos el siguiente ejemplo de Python, sin embargo, este problema no es exclusivo de Python.

source: If we assign 0.1 to `a` and 0.2 to `b` and print their sum, we get 0.3, as expected.
es: Si asignamos 0,1 a `a` y 0,2 a `b` e imprimimos su suma, obtenemos 0,3, como se esperaba.

source: If, however, we compare the result of `a` plus `b` to 0.3 we get False.
es: Sin embargo, si comparamos el resultado de `a` más `b` con 0,3 obtenemos Falso.

source: If we show the value of `a` plus `b` directly, we can see there is a subtle margin of error.
es: Si mostramos el valor de `a` más `b` directamente, podemos ver que hay un margen sutil de error.

source: This is because floating point numbers are approximations of real numbers. The result of floating point calculations can depend upon the compiler or interpreter, processor or system architecture and number of CPUs or processes being used. Obviously this can present a major obstacle for writing tests.
es: Esto se debe a que los números en coma flotante son aproximaciones de los números reales. El resultado de los cálculos en coma flotante puede depender del compilador o intérprete, de la arquitectura del procesador o del sistema y del número de CPUs o procesos que se utilicen. Obviamente, esto puede suponer un gran obstáculo a la hora de escribir pruebas.

source: #### Equality in a floating point world
es: #### La igualdad en un mundo de punto flotante

source: When comparing floating point numbers for equality, we have to compare to within a given tolerance, alternatively termed a threshold or delta. For example, we might consider the calculated and expected values of some number to be equal if the absolute value of their difference is within the absolute value of our tolerance.
es: Cuando se comparan números de punto flotante para la igualdad, tenemos que comparar dentro de una tolerancia dada, también llamada umbral o delta. Por ejemplo, podríamos considerar que los valores calculados y esperados de algún número son iguales si el valor absoluto de su diferencia está dentro del valor absoluto de nuestra tolerancia.

source: Many testing frameworks provide functions for comparing equality of floating point numbers to within a given tolerance. For example for the framework pytest:
es: Muchos frameworks de pruebas proporcionan funciones para comparar la igualdad de los números en coma flotante dentro de una tolerancia determinada. Por ejemplo, para el framework pytest:

source: this passes, but if the 0.3 was changed to 0.4 it would fail.
es: esto pasa, pero si se cambiara el 0,3 por el 0,4 fallaría.

source: Unit test frameworks for other languages also often provide similar functions:
es: Los frameworks de pruebas unitarias para otros lenguajes también suelen ofrecer funciones similares:

source: - Cunit for C: CU_ASSERT_DOUBLE_EQUAL(actual, expected, granularity)
es: - Cunit para C: CU_ASSERT_DOUBLE_EQUAL(actual, expected, granularity)

source: - CPPUnit for C++: CPPUNIT_ASSERT_DOUBLES_EQUAL(expected, actual, delta)
es: - CPPUnit para C++: CPPUNIT_ASSERT_DOUBLES_EQUAL(expected, actual, delta)

source: - googletest for C++: ASSERT_NEAR(val1, val2, abs_error)
es: - googletest para C++: ASSERT_NEAR(val1, val2, abs_error)

source: - FRUIT for Fortran: subroutine assert_eq_double_in_range_(var1, var2, delta, message)
es: - FRUIT para Fortran: subroutine assert_eq_double_in_range_(var1, var2, delta, message)

source: - JUnit for Java: org.junit.Assert.assertEquals(double expected, double actual, double delta)
es: - JUnit para Java: org.junit.Assert.assertEquals(double expected, double actual, double delta)

source: - testthat for R:
es: - testthat para R:

source: ## Types of tests
es: ## Tipos de prueba

source: There are a number of different kinds of tests, which will be discussed here.
es: Hay varios tipos de pruebas, de las que hablaremos aquí.
