Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/testing.*.po
Languages: es

source: - Configuration testing: The program is run with a new device or on a new version of the operating system or in conjunction with a new application. This is like port testing except that the underlying code hasn't been changed--only the external components that the software under test must interact with.
es: - Prueba de configuración: El programa se ejecuta con un nuevo dispositivo o en una nueva versión del sistema operativo o junto con una nueva aplicación. Es como una prueba de portabilidad, salvo que el código subyacente no se ha modificado, sino los componentes externos con los que debe interactuar el software que se está probando.

source: ### Limitations
es: Limitaciones

source: Regression tests are not guaranteed to test all parts of the code. Most importantly, regression tests do not test if the result outputted by a piece of code is *correct*, only that is has not changed. This the remit of other kinds of tests, though regression tests can serve as the starting point for introducing tests for correctness, by both the use of analytical solutions, and test functions which read output files and check the data for correctness, as defined by a researcher.
es: Las pruebas de regresión no garantizan la comprobación de todas las partes del código. Y lo que es más importante, las pruebas de regresión no comprueban si el resultado obtenido por un fragmento de código es *correcto*, sino que no ha cambiado. Este es el objetivo de otros tipos de pruebas, aunque las pruebas de regresión pueden servir como punto de partida para introducir pruebas de corrección, tanto mediante el uso de soluciones analíticas como de funciones de prueba que lean los archivos de salida y comprueben la corrección de los datos, según lo definido por la persona que diseña el código.

source: ## Runtime testing
es: ## Pruebas en tiempo de ejecución

source: Runtime tests are tests that run as part of the program itself. They may take the form of checks within the code, as shown below:
es: Las pruebas en tiempo de ejecución (o "runtime tests" en inglés) son pruebas que se ejecutan como parte del propio programa. Pueden adoptar la forma de comprobaciones dentro del código, como se muestra a continuación:

source: ``` population = population + people_born - people_died // test that the population is positive if (population < 0): error( 'The number of people can never be negative' ) ```
es: ``` poblacion = poblacion + personas_nacidas - personas_muertas // comprueba que la población es positiva si (población < 0): error( 'El número de personas nunca puede ser negativo' ) ```

source: Another example of a use of runtime tests is internal checks within functions that verify that their inputs and outputs are valid, as shown below:
es: Otro ejemplo de uso de las pruebas en tiempo de ejecución son las comprobaciones internas dentro de las funciones que verifican que sus entradas y salidas son válidas, como se muestra a continuación:

source: ``` function add_arrays( array1, array2 ): // test that the arrays have the same size if (array1.size() != array2.size()): error( 'The arrays have different sizes!' ) output = array1 + array2 if (output.size() != array1.size()): error( 'The output array has the wrong size!'' ) return output ```
es: ``` function sumar_arreglos( array1, array2 ): // comprueba que las matrices tienen el mismo tamaño if (array1.size() != array2.size()): error( '¡Las matrices tienen tamaños diferentes!' ) salida = array1 + array2 if (salida.size() != array1.size()): error( '¡La matriz de salida tiene un tamaño incorrecto!' ) return output ```

source: Advantages of runtime testing:
es: Ventajas de las pruebas en tiempo de ejecución:

source: - Run within the program, so can catch problems caused by logic errors or edge cases.
es: - Se ejecuta dentro del programa, por lo que puede detectar problemas causados por errores lógicos o casos límite.

source: - Makes it easier to find the cause of the bug by catching problems early.
es: - Facilita la búsqueda de la causa del fallo al detectar los problemas con antelación.

source: - Catching problems early also helps prevent them escalating into catastrophic failures. It minimises the blast radius.
es: - Detectar los problemas a tiempo también ayuda a evitar que se conviertan en fallos catastróficos. Se minimiza el radio de explosión.

source: Disadvantages of runtime testing:
es: Desventajas de las pruebas en tiempo de ejecución:

source: - Tests can slow down the program.
es: - Las pruebas pueden ralentizar el programa.

source: - What is the right thing to do if an error is detected? How should this error be reported? Exceptions are a recommended route to go with this.
es: - ¿Qué hay que hacer si se detecta un error? ¿Cómo se debe informar de este error? Las excepciones son una vía recomendada para ello.

source: ## Test driven development
es: ## Desarrollo basado en pruebas

source: One way of ensuring tests are not neglected in a project is to adopt test-driven development. This is an approach in which unit tests are written before the code. The tests thus describe a "contract" that the code is expected to comply with. This ensures that the code will be correct (as far as can be enforced by the testing contract) as written, and it provides a useful framework for thinking about how the code should be designed, what interfaces it should provide, and how its algorithms might work. This can be a very satisfying mental aid in developing tricky algorithms.
es: Una forma de garantizar que no se descuiden las pruebas en un proyecto es adoptar el desarrollo dirigido por pruebas. Se trata de un enfoque en el que las pruebas unitarias se escriben antes que el código. Así, las pruebas describen un "contrato" que se espera que cumpla el código. Esto garantiza que el código será correcto (en la medida en que pueda ser aplicado por el contrato de pruebas) tal y como está escrito, y proporciona un marco útil para pensar en cómo debería diseñarse el código, qué interfaces debería proporcionar y cómo podrían funcionar sus algoritmos. Puede ser una ayuda mental muy satisfactoria para desarrollar algoritmos complicados.

source: Once the tests are written, the code is developed so that it passes all the associated tests. Testing the code from the outset ensures that your code is always in a releasable state (as long as it passes the tests!). Test driven development forces you to break up your code into small discrete units, to make them easier to test; the code must be modular. The benefits of this were discussed in the section on [unit testing](#Unit_tests).
es: Una vez escritas las pruebas, el código se desarrolla para que pase todas las pruebas asociadas. Probar el código desde el principio garantiza que el código esté siempre disponible (siempre que pase las pruebas). El desarrollo orientado a las pruebas obliga a dividir el código en pequeñas unidades discretas, para que sea más fácil probarlas; el código debe ser modular. Los beneficios de esto fueron discutidos en la sección sobre [pruebas unitarias](#Pruebas_unitarias).

source: An alternative development approach is behaviour driven development. Simply put test driven development tests "has the thing been done correctly?", behaviour driven development tests "has the correct thing been done?". It is more often used in commercial software development to focus development on making the software as simple and effective as possible for users. User experience is very rarely at the heart of code written for the purposes of research, but there are cases where such software is written with a large user-base in mind. In such cases behaviour-driven development is a path worth considering.
es: Un enfoque de desarrollo alternativo es el desarrollo basado en el comportamiento. En pocas palabras, el desarrollo orientado a las pruebas comprueba "si la cosa se ha hecho correctamente", mientras que el desarrollo orientado al comportamiento comprueba "si se ha hecho lo correcto". Se utiliza más a menudo en el desarrollo de software comercial para centrar el desarrollo en hacer que el software sea lo más sencillo y eficaz posible para los usuarios. La experiencia del usuario no suele estar en el centro del código escrito con fines de investigación, pero hay casos en los que este tipo de software se escribe pensando en una gran base de usuarios. En estos casos, el desarrollo basado en el comportamiento es un camino que merece la pena considerar.

source: ## Checklist
es: ## Lista de verificación

source: This checklist contains a lot of items. As [mentioned](#Write_tests_any_tests) it is far better to do some of the items than none of them. Do not be discouraged if this list of tasks seems insurmountable.
es: Esta lista de verificación contiene muchos elementos. Como se ha mencionado (#Escribir_pruebas_cualquier_prueba) es mucho mejor hacer algunos de los elementos que ninguno. No se desanime si esta lista de tareas parece insuperable.

source: ### Writing tests
es: ### Escribir pruebas

source: - [ ] Write a few smoke tests.
es: - [ ] Escribe algunas pruebas de humo.

source: - [ ] Write unit tests for all your code units.
es: - [ ] Escribe pruebas unitarias para todas las unidades de tu código.

source: - [ ] Write integration tests to check the integration between units.
es: - [ ] Escribe pruebas de integración para comprobar la integración entre unidades.

source: - [ ] Write a few system tests. Prioritise common and important paths through the program.
es: - [ ] Escribe unas cuantas pruebas del sistema. Dar prioridad a los caminos comunes e importantes a través del programa.

source: - [ ] Write regression tests. Regression tests can exist at any level of testing.
es: - [ ] Escribe pruebas de regresión. Las pruebas de regresión pueden existir en cualquier nivel de pruebas.

source: - [ ] If appropriate for your project write acceptance tests.
es: - [ ] Si es apropiado para tu proyecto, escribe pruebas de aceptación.

source: - [ ] Add runtime tests into your project.
es: - [ ] Añade pruebas de ejecución en tu proyecto.

source: ### Good practice checks
es: ### Buenas prácticas

source: - [ ] Document the tests and how to run them.
es: - [ ] Documenta las pruebas y cómo ejecutarlas.

source: - [ ] Write scripts to set up and configure any resources that are needed to run the tests.
es: - [ ] Escribe scripts para establecer y configurar cualquier recurso que se necesite para ejecutar las pruebas.

source: - [ ] Pick and make use of a testing framework.
es: - [ ] Escoge y utiliza un marco ("framework" en inglés) de pruebas.

source: - [ ] Run the tests regularly.
es: - [ ] Realiza las pruebas con regularidad.

source: - [ ] Automate the process of running tests. Consider making use of continuous integration (see continuous integration chapter) to do this.
es: - [ ] Automatiza el proceso de ejecución de pruebas. Para ello, considera hacer uso de la integración continua (ver capítulo de integración continua).

source: - [ ] Check the code coverage of your tests and try to improve it.
es: - [ ] Comprueba la cobertura de código de tus pruebas e intenta mejorarla.

source: - [ ] Engage in code review with a partner.
es: - [ ] Participar en la revisión del código con otra persona.

source: ## What to learn next
es: ## ¿Qué aprender a continuación?

source: Try reading the chapter on reproducible computational environments and then the chapter on continuous integration. The chapter on reviewing outlines how you can further strengthen your code base by adding a formal reviewing stage to your development workflow.
es: Intenta leer el capítulo sobre entornos computacionales reproducibles y luego el capítulo sobre integración continua. El capítulo sobre la revisión describe cómo puedes fortalecer aún más tu base de código añadiendo una etapa de revisión formal a tu flujo de trabajo de desarrollo.

source: ## Further reading
es: ## Lecturas complementarias

source: [TutorialsPoint](https://www.tutorialspoint.com/software_testing/) has a number of useful tutorials related to testing, as does the [Turing Institute](https://alan-turing-institute.github.io/rsd-engineeringcourse/ch03tests/01testingbasics.html). It is also worth looking at [softwaretestingfundamentals.com](http://softwaretestingfundamentals.com).
es: [TutorialsPoint](https://www.tutorialspoint.com/software_testing/) tiene una serie de tutoriales útiles relacionados con las pruebas, al igual que el [Instituto Turing](https://alan-turing-institute.github.io/rsd-engineeringcourse/ch03tests/01testingbasics.html). También merece la pena consultar [softwaretestingfundamentals.com](http://softwaretestingfundamentals.com).

source: ## Definitions/glossary
es: ## Definiciones/glosario

source: - **Acceptance test:** A test that the program meets the project's fundamental requirements.
es: - **Prueba de aceptación:** Prueba de que el programa cumple los requisitos fundamentales del proyecto.

source: - **Code coverage:** A measure which describes how much of the source code is exercised by the test suite.
es: - **Cobertura del código:** Una medida que describe qué parte del código fuente es ejercitada por el conjunto de pruebas.

source: - **End to end test:** A test that runs the program from beginning to end and verifies that the output is correct.
es: - **Prueba de extremo a extremo:** Una prueba que ejecuta el programa de principio a fin y verifica que la salida es correcta.

source: - **Integration test:** A test where units of code are combined and run, and the output is verified to check the units have been correctly integrated.
es: - **Prueba de integración:** Prueba en la que se combinan y ejecutan unidades de código y se verifica el resultado para comprobar que las unidades se han integrado correctamente.

source: - **Mocking:** Replace a real object with a pretend one to use when running tests.
es: - **Mocking:** Reemplazar un objeto real por uno de mentira para utilizarlo al ejecutar las pruebas.

source: - **Regression test:** Comparing the result of a test before and after the code has been altered. If the output has changed a problem has been introduced somewhere in the program, and an error is thrown.
es: - **Prueba de regresión:** Comparar el resultado de una prueba antes y después de que el código haya sido alterado. Si el resultado ha cambiado se ha introducido un problema en alguna parte del programa, y se lanza un error.

source: - **Runtime test:** Tests embedded within the program which are run as part of it.
es: - **Prueba en tiempo de ejecución:** Pruebas integradas en el programa que se ejecutan como parte del mismo.

source: - **Smoke test:** Very brief initial checks that ensure the basic requirements needed to run the project hold.
es: - **Prueba de humo:** Comprobaciones iniciales muy breves que garantizan el cumplimiento de los requisitos básicos necesarios para el funcionamiento del proyecto.

source: - **Stochastic code:** Code which, while correct, does not always output the same result. For example a program that outputs ten random numbers will generate a different result each time, despite being correct.
es: - **Código estocástico:** Código que, aunque es correcto, no produce siempre el mismo resultado. Por ejemplo, un programa que produce diez números aleatorios generará un resultado diferente cada vez, a pesar de ser correcto.

source: - **System test:** See "end to end test".
es: - **Prueba del sistema:** Ver "prueba de extremo a extremo".

source: - **Test driven development:** A process of code development where unit tests are written before the units themselves.
es: - **Desarrollo dirigido por pruebas:** Un proceso de desarrollo de código en el que las pruebas unitarias se escriben antes que las propias unidades.

source: - **Test stub:** Fake implementations of parts of code which are used in testing to remove dependences.
es: - **Test stub:** Implementaciones falsas de partes de código que se utilizan en las pruebas para eliminar dependencias.

source: - **Test suite:** The tests that have been written for a project.
es: - **Conjunto de pruebas:** Las pruebas que se han escrito para un proyecto.

source: - **Testing framework:** Tools that make writing and running tests less labour intensive.
es: - **Marco de pruebas:** Herramientas que hacen que escribir y ejecutar pruebas sea menos laborioso.

source: - **Unit:** A small piece of code that does one simple thing. It usually has one or a few inputs and usually a single output.
es: - **Unidad:** Una pequeña pieza de código que hace una cosa simple. Suele tener una o unas pocas entradas y normalmente una única salida.

source: - **Unit test:** A test that checks the behaviour of a unit.
es: - **Prueba de unidad:** Una prueba que comprueba el comportamiento de una unidad.

source: ## Bibliography
es: ## Bibliografía

source: ### Materials used: How this will help you/ why this is useful
es: ### Materiales utilizados: Cómo te ayudará/ por qué es útil

source: - [Talk by Chrys Woods](https://drive.google.com/file/d/1CBTAhCVixccui1DjeUT13qh6ga5SDXjl/view) [**Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License**](https://chryswoods.com/main/copyright.html)
es: - [Charla de Chrys Woods](https://drive.google.com/file/d/1CBTAhCVixccui1DjeUT13qh6ga5SDXjl/view) [**Licencia internacional de atribución no comercial y de uso compartido 4.0 de Creative Commons**](https://chryswoods.com/main/copyright.html)

source: - [Turing testing course basics](https://alan-turing-institute.github.io/rsd-engineeringcourse/ch03tests/01testingbasics.html) **Creative Commons share and remix**
es: - Curso básico de pruebas de Turing](https://alan-turing-institute.github.io/rsd-engineeringcourse/ch03tests/01testingbasics.html) **Compartir y remezclar con Creative Commons**.

source: - [SSI blog](https://www.software.ac.uk/resources/guides/testing-your-software?_ga=2.39233514.830272891.1552653652-1336468516.1531506806) **Creative Commons Attribution Non-Commercial 2.5 License.**
es: - [Blog de SSI](https://www.software.ac.uk/resources/guides/testing-your-software?_ga=2.39233514.830272891.1552653652-1336468516.1531506806) **Licencia Creative Commons Reconocimiento No Comercial 2.5.**

source: ### Materials used: General guidance and good practice for testing
es: ### Materiales utilizados: Orientaciones generales y buenas prácticas para las pruebas

source: - [SSI blog on testing software](https://www.software.ac.uk/resources/guides/testing-your-software?_ga=2.39233514.830272891.1552653652-1336468516.1531506806) **Creative Commons Attribution Non-Commercial 2.5 License.**
es: - [Blog de SSI sobre pruebas de software](https://www.software.ac.uk/resources/guides/testing-your-software?_ga=2.39233514.830272891.1552653652-1336468516.1531506806) **Licencia Creative Commons Reconocimiento No Comercial 2.5.**

source: - [Turing testing course](https://alan-turing-institute.github.io/rsd-engineeringcourse/ch03tests/03pytest.html) **Creative Commons share and remix**
es: - [Curso de pruebas del instituto Turing](https://alan-turing-institute.github.io/rsd-engineeringcourse/ch03tests/03pytest.html) **Compartir y remezclar con Creative Commons**

source: - [Testing with floating points](https://github.com/softwaresaved/automated_testing/blob/master/README.md) **Apache License 2.0**
es: - [Pruebas con puntos flotantes](https://github.com/softwaresaved/automated_testing/blob/master/README.md) **Licencia Apache 2.0**

source: ### Materials used: Types of tests
es: ### Materiales utilizados: Tipos de pruebas

source: - [Software testing fundamentals: levels of tests](http://softwaretestingfundamentals.com/software-testing-levels/) **Copyleft - 2019 STF**
es: - [Fundamentos de las pruebas de software: niveles de pruebas](http://softwaretestingfundamentals.com/software-testing-levels/) **Copyleft - 2019 STF**

source: ### Materials used: Smoke testing
es: ### Materiales utilizados: Pruebas de humo

source: - [Digitalocean](https://www.digitalocean.com/community/tutorials/an-introduction-to-continuous-integration-delivery-and-deployment) **Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.**
es: - [Digitalocean](https://www.digitalocean.com/community/tutorials/an-introduction-to-continuous-integration-delivery-and-deployment) **Licencia Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.**

source: ### Materials used: Unit testing
es: ### Materiales utilizados: Pruebas unitarias

source: - [An introduction to continuous integration](https://www.digitalocean.com/community/tutorials/an-introduction-to-continuous-integration-delivery-and-deployment) **Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.**
es: - [Introducción a la integración continua](https://www.digitalocean.com/community/tutorials/an-introduction-to-continuous-integration-delivery-and-deployment) **Licencia Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.**

source: - [Software testing fundamentals: unit tests](http://softwaretestingfundamentals.com/unit-testing/) **Copyleft - 2019 STF**
es: - [Fundamentos de las pruebas de software: pruebas unitarias](http://softwaretestingfundamentals.com/unit-testing/) **Copyleft - 2019 STF**

source: ### Materials used: Integration testing
es: ### Materiales utilizados: Pruebas de integración

source: - [Software testing fundamentals: integration testing](http://softwaretestingfundamentals.com/integration-testing/) **Copyleft - 2019 STF**
es: - [Fundamentos de las pruebas de software: pruebas de integración](http://softwaretestingfundamentals.com/integration-testing/) **Copyleft - 2019 STF**

source: ### Materials used: System testing
es: ### Materiales utilizados: Pruebas del sistema

source: - [Software testing fundamentals: system testing](http://softwaretestingfundamentals.com/system-testing/) **Copyleft - 2019 STF**
es: - [Fundamentos de pruebas de software: pruebas de sistemas](http://softwaretestingfundamentals.com/system-testing/) **Copyleft - 2019 STF**

source: ### Materials used: Acceptance testing
es: ### Materiales utilizados: Pruebas de aceptación

source: ### Materials used: Regression testing
es: ### Materiales utilizados: Pruebas de regresión

source: - [Sound software](http://soundsoftware.ac.uk/unit-testing-why-bother/) **Creative Commons Attribution-NonCommercial 3.0 License**
es: - [Software de sonido](http://soundsoftware.ac.uk/unit-testing-why-bother/) **Licencia Creative Commons Attribution-NonCommercial 3.0**

source: - [Software testing fundamentalsL regression testing](http://softwaretestingfundamentals.com/regression-testing/) **Copyleft**
es: - [Fundamentos de las pruebas de softwarePruebas de regresión](http://softwaretestingfundamentals.com/regression-testing/) **Copyleft**

source: - [Examples of Regression Testing by Cem Karner](http://www.testingeducation.org/k04/RegressionExamples.htm) **Creative Commons Attribution-ShareAlike License 2.0**
es: - [Ejemplos de pruebas de regresión por Cem Karner](http://www.testingeducation.org/k04/RegressionExamples.htm) **Licencia Creative Commons Attribution-ShareAlike 2.0**

source: - [Adopting automated testing](https://github.com/softwaresaved/automated_testing/blob/master/README.md) **Apache License 2.0**
es: - [Adopción de pruebas automatizadas](https://github.com/softwaresaved/automated_testing/blob/master/README.md) **Licencia Apache 2.0**

source: ### Materials used: Runtime testing
es: ### Materiales utilizados: Pruebas en tiempo real

source: ### Materials used: Test driven development
es: ### Materiales utilizados: Desarrollo impulsado por pruebas
