Repository: TWTranslation/TTW_spanish_transifex
Catalog: book/content/po/testing.*.po
Languages: es

source: # Testing
es: # Pruebas

source: | Prerequisite | Importance |
es: | Prerrequisito | Importancia |

source: | [Experience with the command line](https://programminghistorian.org/en/lessons/intro-to-bash) | Necessary |
es: | [Experiencia con la línea de comandos] (https://programminghistorian.org/en/lessons/intro-to-bash) | Necesario |

source: ## Table of contents
es: ## Tabla de contenidos

source: 1. [Summary](#Summary)
es: 1. [Resumen] (#Summary)

source: 2. [How this will help you/ why this is useful](#How_this_will_help_you_why_this_is_useful)
es: 2. [Cómo te ayudará esto / por qué es útil](#How_this_will_help_you_why_this_is_useful)

source: 1. [The advantages of testing for research](#The_advantages_of_testing_for_research)
es: 1. [Las ventajas de realizar pruebas para la investigación] (#The_advantages_of_testing_for_research)

source: 3. [General guidance and good practice for testing](#General_guidance_and_good_practice_for_testing)
es: 3. [Orientación general y buenas prácticas para las pruebas](#General_guidance_and_good_practice_for_testing)

source: 1. [Write tests. Any tests.](#Write_tests_any_tests)
es: 1. [Escribir pruebas. Cualquier prueba.](#Write_tests_any_tests)

source: 2. [Run the tests](#Run_the_tests)
es: 2. [Ejecutar las pruebas](#Run_the_tests)

source: 3. [Consider how long it takes your tests to run](#Consider_how_long_it_takes_your_tests_to_run)
es: 3. [Considera cuánto tardan sus pruebas en ejecutarse] (#Consider_how_long_it_takes_your_tests_to_run)

source: 4. [Document the tests and how to run them](#Document_the_tests_and_how_to_run_them)
es: 4. [Documenta las pruebas y cómo ejecutarlas](#Document_the_tests_and_how_to_run_them)

source: 5. [Test realistic cases](#Test_realistic_cases)
es: 5. [Prueba casos realistas](#Test_realistic_cases)

source: 6. [Use a testing framework](#Use_a_testing_framework)
es: 6. [Utiliza un "framework" de prueba] (#Use_a_testing_framework)

source: 7. [Aim to have a good code coverage](#Aim_to_have_a_good_code_coverage)
es: 7. [Trata de tener una buena cobertura de código](#Aim_to_have_a_good_code_coverage)

source: 8. [Use test doubles/mocking where appropriate](#Use_test_doubles_stubs_mocking_where_appropriate)
es: [Usar test dobles/objetos simulados (mocking) cuando sea apropiado](#Usar_test_dobles_o_mocking_cuando_sea_apropiado)

source: 9. [Testing stochastic code](#Testing_stochastic_code)
es: [Prueba de código estocástico] (#Prueba_código_estocástico)

source: 1. [Use random number seeds](#Use_random_number_seeds)
es: 1. [Usar semillas de números aleatorios] (# Usar_ semillas_de_números_aleatorios)

source: 2. [Measure the distribution of results](#Measure_the_distribution_of_results)
es: 2. [Medir la distribución de resultados] (# Medir_la_distribución_de_resultados)

source: 10. [Tests that are difficult to quantify](#Tests_that_are_difficult_to_quantify)
es: 10. [Pruebas (tests) que son difíciles de cuantificar] (# Pruebas_que_son_difíciles_de_cuantificar)

source: 11. [Testing if non-integer numbers are equal](#Testing_if_non_integer_numbers_are_equal)
es: 11. [Probar que los números no enteros son iguales] (# Probar_que_los_números_no_enteros_son_iguales)

source: 1. [When 0.1 + 0.2 does not equal 0.3](#When_point_1_plus_point_2_does_not_equal_point_3)
es: 1. [Cuando 0,1 + 0,2 no es igual a 0,3] (#Cuando_punto_uno_más_punto_2_no_es_igual_a_punto_tres)

source: 2. [Equality in a floating point world](#Equality_in_a_floating_point_world)
es: 2. [Igualdad en un mundo de coma flotante](#Equality_in_a_floating_point_world)

source: 4. [Types of tests](#Types_of_tests)
es: 4. [Tipos de pruebas](#Tipos_de_pruebas)

source: 1. [Level summary](#Level_summary)
es: 1. [Resumen de nivel](#Resumen_de_nivel)

source: 5. [Smoke testing](#Smoke_testing)
es: 5. [Prueba de humo](#Prueba_de_humo)

source: 6. [Unit tests](#Unit_tests)
es: 6. [Pruebas unitarias](#Pruebas_unitarias)

source: 1. [Benefits of unit testing](#Benefits_of_unit_testing)
es: 1. [Beneficios de las pruebas unitarias](#Beneficios_de_las_pruebas_unitarias)

source: 2. [Unit testing tips](#Unit_testing_tips)
es: 2. [Consejos para las pruebas unitarias](#Unit_testing_tips)

source: 7. [Integration testing](#Integration_testing)
es: 7. [Pruebas de integración](#Pruebas_de_integración)

source: 1. [Approaches](#Approaches)
es: 1. [Enfoques](#Enfoques)

source: 2. [Integration testing tips](#Integration_testing_tips)
es: 2. [Consejos para las pruebas de integración](#Integration_testing_tips)

source: 8. [System tests](#System_tests)
es: 8. [Testeo de sistemas](#Testeo de sistemas)

source: 1. [System testing tips](#System_testing_tips)
es: 1. [Consejos para las pruebas del sistema](#System_testing_tips)

source: 9. [Acceptance testing](#Acceptance_testing)
es: 9. [Pruebas de aceptación](#Pruebas_de_aceptación)

source: 10. [Regression testing](#Regression_testing)
es: 10. [Pruebas de regresión](#Pruebas_de_regresión)

source: 1. [Limitations](#Limitations)
es: 1. [Limitaciones](#Limitaciones)

source: 11. [Runtime testing](#Runtime_testing)
es: 11. [Pruebas en tiempo de ejecución](#Pruebas en tiempo de ejecución)

source: 12. [Test driven development](#Test_driven_development)
es: 12. [Desarrollo guiado por pruebas](#Desarrollo_guiado_por_pruebas)

source: 1. [Writing tests](#Writing_tests)
es: 1. [Escribiendo tests](#Escribiendo_tests)

source: 2. [Good practice checks](#Good_practice_checks)
es: 2. [Controles de buenas prácticas](#Control_de_buenas_prácticas)

source: 14. [What to learn next](#What_to_learn_next)
es: 14. 14. [Qué aprender a continuación ](#Qué_aprender_a continuación)

source: 15. [Further reading](#Further_reading)
es: - [Lectura adicional](#Further_reading)

source: 16. [Definitions/glossary](#Definitions_glossary)
es: 16. [Definiciones/glosario](#Definiciones_glosario)

source: 17. [Bibliography](#Bibliography)
es: 17. [Bibliografía](#Bibliografía)

source: ## Summary
es: ## Resumen

source: Researcher-written code now forms a part of a huge portion of research, and if there are mistakes in the code the results may be partly or entirely unreliable. Testing code thoroughly and frequently is vital to ensure reliable, reproducible research. This chapter will cover general guidance for writing tests, and describes a number of different kinds of testing, their uses, and how to go about implementing them.
es: El código escrito por la persona que investiga forma parte ahora de una gran parte de su actividad, y si hay errores en el código los resultados pueden ser parcial o totalmente poco fiables. Probar el código a fondo y con frecuencia es vital para garantizar una investigación fiable y reproducible. En este capítulo se ofrecen orientaciones generales para la realización de pruebas y se describen distintos tipos de pruebas, sus usos y cómo llevarlas a cabo.

source: ## How this will help you/ why this is useful
es: ## Cómo te ayudará esto/ por qué esto es útil

source: Here's a couple of examples of why should write tests:
es: Aquí un par de ejemplos sobre por qué deberías escribir pruebas:

source: It is very, very easy to make mistakes when coding. A single misplaced character can cause a program's output to be entirely wrong. One of the examples above was caused by a plus sign which should have been a minus. Another was caused by one piece of code working in meters while a piece of code written by another researcher worked in feet. *Everyone* makes mistakes, and in research the results can be catastrophic. Careers can be damaged/ended, vast sums of research funds can be wasted, and valuable time may be lost to exploring incorrect avenues. This is why tests are vital.
es: Es muy, muy fácil cometer errores al escribir código. Un solo caracter mal colocado puede hacer que el resultado de un programa sea totalmente erróneo. Uno de los ejemplos anteriores fue causado por un signo más que debería haber sido un menos. Otro fue causado porque una parte del código funcionaba en metros mientras que otra, escrita por otra persona, funcionaba en pies. *Todo el mundo* comete errores y en la investigación los resultados pueden ser catastróficos. Las carreras profesionales pueden verse perjudicadas o acabadas, se pueden desperdiciar grandes sumas de fondos de investigación y se puede perder un tiempo valioso por explorar vías incorrectas. Por eso las pruebas son vitales.

source: Even if problems in a program are caught before research is published it can be difficult to figure out what results are contaminated and must be re-done. This represents a huge loss of time and effort. Catching these problems as early as possible minimises the amount of work it takes to fix them, and for most researchers time is by far their most scarce resource. You should not skip writing tests because you are short on time, you should write tests *because* you are short on time. Researchers cannot afford to have months or years of work go down the drain, and they can't afford to repeatedly manually check every little detail of a program that might be hundreds or hundreds of thousands of lines long. Writing tests to do it for you is the time-saving option, and it's the safe option.
es: Incluso si se detectan los problemas de un programa antes de que se publique la investigación, puede ser difícil averiguar qué resultados están contaminados y deben volver a hacerse. Esto supone una enorme pérdida de tiempo y esfuerzo. Detectar estos problemas lo antes posible minimiza la cantidad de trabajo que se necesita para solucionarlos, y para la mayoría de los investigadores el tiempo es, con mucho, su recurso más escaso. No hay que dejar de escribir pruebas porque se tenga poco tiempo, hay que escribir pruebas *porque* se tiene poco tiempo. Los investigadores no pueden permitirse que meses o años de trabajo se vayan por el desagüe, y no pueden permitirse comprobar manualmente y de forma repetida cada pequeño detalle de un programa que puede tener cientos o cientos de miles de líneas. Escribir pruebas que lo hagan por ti es la opción que ahorra tiempo, y es la opción segura.

source: As researchers write code they generally do some tests as they go along, often by adding in print statements and checking the output. However, these tests are often thrown away as soon as they pass and are no longer present to check what they were intended to check. It is comparatively very little work to place these tests in functions and keep them so they can be run at any time in the future. The additional labour is minimal, the time saved and safeguards provided are invaluable. Further, by formalising the testing process into a suite of tests that can be run independently and automatically, you provide a much greater degree of confidence that the software behaves correctly and increase the likelihood that defects will be found.
es: Cuando las personas investigadoras escriben código, suelen hacer algunas pruebas sobre la marcha, a menudo añadiendo sentencias print y comprobando la salida. Sin embargo, estas pruebas suelen descartarse en cuanto se superan y ya no están presentes para comprobar lo que se pretendía comprobar. Es comparativamente muy poco trabajo colocar estas pruebas en funciones y guardarlas para que puedan ser ejecutadas en cualquier momento en el futuro. El trabajo adicional es mínimo, el tiempo que se ahorra y las garantías que se ofrecen son inestimables. Además, al formalizar el proceso de pruebas en un conjunto de pruebas que pueden ejecutarse de forma independiente y automática, se proporciona un grado mucho mayor de confianza en que el software se comporta correctamente y se incrementa la probabilidad de encontrar defectos.

source: Testing also affords researchers much more peace of mind when working on/improving a project. After changing their code a researcher will want to check that their changes or fixes have not broken anything. Providing researchers with a fail-fast environment allows the rapid identification of failures introduced by changes to the code. The alternative, of the researcher writing and running whatever small tests they have time for is far inferior to a good testing suite which can thoroughly check the code.
es: Las pruebas también ofrecen a los investigadores mucha más tranquilidad a la hora de trabajar o mejorar un proyecto. Después de cambiar su código, se querrá comprobar que sus cambios o correcciones no han roto nada. Proporcionar a los investigadores un entorno a prueba de fallos permite identificar rápidamente los fallos introducidos por los cambios en el código. La alternativa de que el investigador escriba y ejecute cualquier pequeña prueba para la que tenga tiempo es muy inferior a un buen conjunto de pruebas que pueda comprobar a fondo el código.

source: Another benefit of writing tests is that it typically forces a researcher to write cleaner, more modular code as such code is far easier to write tests for, leading to an improvement in code quality. Good quality code is far easier (and altogether more pleasant) to work with than tangled rat's nests of code I'm sure we've all come across (and, let's be honest, written). This point is expanded upon in the section on [unit tests](#Unit_tests).
es: Otro beneficio de escribir pruebas es que normalmente obliga a quien investiga a escribir un código más limpio y modular, ya que para dicho código es mucho más fácil escribir pruebas, lo que conduce a una mejora en la calidad del código. El código de buena calidad es mucho más fácil (y más agradable) de trabajar que los nidos de ratas enmarañados con los que seguro que todos nos hemos encontrado (y, seamos sinceros, escrito). Este punto se amplía en la sección sobre [pruebas unitarias](#Unit_tests).

source: ### The advantages of testing for research
es: ### Las ventajas de testear en investigación

source: As well as advantaging individual researchers testing also benefits research as a whole. It makes research more reproducible by answering the question "how do we even know this code works". If tests are never saved, just done and deleted the proof cannot be reproduced easily.
es: Además de favorecer a los investigadores individuales, las pruebas también benefician a la investigación en su conjunto. Hace que la investigación sea más reproducible al responder a la pregunta «¿cómo sabemos que este código funciona?». Si las pruebas nunca se guardan, simplemente se hacen y se borran, la prueba no puede reproducirse fácilmente.

source: Testing also helps prevent valuable grant money being spent on projects that may be partly or wholly flawed due to mistakes in the code. Worse if mistakes are not at found and the work is published any subsequent work that builds upon the project will be similarly flawed.
es: Las pruebas también ayudan a evitar que se gaste un valioso dinero de subvenciones en proyectos que pueden ser parcial o totalmente defectuosos debido a errores en el código. Y lo que es peor, si no se detectan los errores y se publica el trabajo, cualquier trabajo posterior que se base en el proyecto tendrá los mismos defectos.

source: Perhaps the cleanest expression of why testing is important for research as a whole can be found in the [Software Sustainability Institute](https://www.software.ac.uk/) slogan: better software better research.
es: Tal vez la expresión más clara de por qué las pruebas son importantes para la investigación en su conjunto se encuentre en el eslogan del [Instituto de Sostenibilidad del Software](https://www.software.ac.uk/) eslogan: «mejor software, mejor investigación».

source: ## General guidance and good practice for testing
es: ## Orientación general y buenas prácticas para el testeo

source: There are a number of [different kinds](#Types_of_tests) of testing which each have best practice specific to them. Nevertheless there is some general guidance that applies to all of them, which will be outlined here.
es: Existen varios [tipos](#Types_of_tests) de pruebas, cada uno de los cuales cuenta con prácticas recomendadas específicas. No obstante, existen algunas orientaciones generales que se aplican a todas ellas y que se describen a continuación.

source: ### Write tests. Any tests.
es: ### Escribir test. Cualquier test.

source: Starting the process of writing tests can be overwhelming, especially if you have a large code base. Further to that, as mentioned, there are many kinds of tests, and implementing all of them can seem like an impossible mountain to climb. That is why the single most important piece of guidance in this chapter is as follows: **write some tests**. Testing one tiny thing in a code that's thousands of lines long is infinitely better than testing no things in a code that's thousands of lines long. You may not be able to do everything, but doing *something* is valuable.
es: Comenzar el proceso de escribir pruebas puede ser abrumador, especialmente si tienes una gran cantidad de código. Además, como se ha mencionado, hay muchos tipos de pruebas, y la implementación de todas ellas puede parecer una montaña imposible de escalar. Por eso, el consejo más importante de este capítulo es el siguiente: **escribir algunas pruebas**. Probar una pequeña cosa en un código de miles de líneas es infinitamente mejor que no probar nada en un código de miles de líneas. Puede que no seas capaz de hacerlo todo, pero hacer *algo* es valioso.

source: Do not be discouraged. Make improvements where you can, and do your best to include tests with new code you write even if it's not feasible to write tests for all the code that's already written.
es: No te desanimes. Realice mejoras donde pueda y haga todo lo posible para incluir test en el nuevo código que escriba, incluso si no es factible escribir pruebas para todo el código que ya está escrito.

source: ### Run the tests
es: ### Ejecuta los tests

source: The second most important piece of advice in this chapter: run the tests. Having a beautiful, perfect test suite is no use if you rarely run it. Leaving long gaps between test runs makes it more difficult to track down what has gone wrong when a test fails because a great deal in the code will have changed. Also if it's been weeks or months since tests have been run and they fail it is difficult or impossible to know what work/results that have been done in the intervening time are still valid, and which have to be thrown away as they could have been impacted by the bug.
es: El segundo consejo más importante de este capítulo: ejecuta las pruebas. Tener un hermoso y perfecto conjunto de pruebas no sirve de nada si rara vez lo ejecutas. Dejar largos períodos entre las ejecuciones de las pruebas hace que sea más difícil averiguar qué es lo que ha fallado cuando una prueba falla, porque habrá cambiado mucho el código. Además, si han pasado semanas o meses desde que se ejecutan las pruebas y éstas fallan, es difícil o imposible saber qué trabajo o resultados que se han producido en ese tiempo siguen siendo válidos, y cuáles hay que desechar porque podrían haber sido afectados por el fallo.

source: As such it is best to automate your testing as far as possible. If each test needs to be run individually then that boring painstaking process is likely to get neglected. This can be done by making use of a testing framework ([discussed later](#Use_a_testing_framework)). [Jenkins](https://jenkins.io) is another good tool for this. Ideally set your tests up to run at regular intervals, possibly each night.
es: Por ello, lo mejor es automatizar las pruebas en la medida de lo posible. Si cada prueba tiene que ser ejecutada individualmente, es probable que ese aburrido y minucioso proceso se descuide. Esto se puede hacer mediante el uso de un marco de pruebas ([discutido más adelante](#Use_a_testing_framework)). [Jenkins](https://jenkins.io) es otra buena herramienta para esto. Lo ideal es configurar las pruebas para que se ejecuten a intervalos regulares, posiblemente cada noche.

source: Consider setting up continuous integration (discussed in the continuous integration chapter) on your project. This will automatically run your tests each time you make a change to your code and, depending on the continuous integration software you use, will notify you if any of the tests fail.
es: Considera la posibilidad de configurar la integración continua (de la que hablamos en el capítulo de integración continua) en tu proyecto. Esto ejecutará automáticamente tus pruebas cada vez que hagas un cambio en tu código y, dependiendo del software de integración continua que utilices, te notificará si alguna de las pruebas falla.

source: ### Consider how long it takes your tests to run
es: ### Considera cuánto tardan en ejecutarse tus tests

source: Some tests, like [unit tests](#Unit_tests) only test a small piece of code and so typically are very fast. However other kinds of tests, such as [system tests](#System_tests) which test the entire code from end to end, may take a long time to run depending on the code. As such it can be obstructive to run the entire test suite after each little bit of work. In that case it is better to run lighter weight tests such as unit tests frequently, and longer tests only once per day overnight. It is also good to scale the number of each kind of tests you have in relation to how long they take to run. You should have a lot of unit tests (or other types of tests that are fast) but much fewer tests which take a long time to run.
es: Algunas pruebas, como las [pruebas unitarias](#Unit_tests) sólo prueban una pequeña parte del código y por eso suelen ser muy rápidas. Sin embargo, otros tipos de pruebas, como las [pruebas del sistema](#System_tests) que prueban todo el código de punta a punta, pueden tardar mucho tiempo en ejecutarse dependiendo del código. Por lo tanto, puede resultar molesto ejecutar todo el conjunto de pruebas después de cada pequeño trabajo. En ese caso, es mejor ejecutar con frecuencia las pruebas más ligeras, como las pruebas unitarias, y las pruebas más largas sólo una vez al día durante la noche. También es bueno escalar el número de cada tipo de pruebas que tienes en relación con el tiempo que tardan en ejecutarse. Deberías tener muchas pruebas unitarias (u otros tipos de pruebas que sean rápidas) pero muchas menos pruebas que tarden mucho en ejecutarse.

source: ### Document the tests and how to run them
es: ### Documente las pruebas y cómo ejecutarlas

source: It is important to provide documentation that describes how to run the tests, both for yourself in case you come back to a project in the future, and for anyone else that may wish to build upon or reproduce your work. This documentation should also cover subjects such as
es: Otro beneficio de escribir pruebas es que normalmente obliga a un investigador a escribir un código más limpio y modular, ya que para dicho código es mucho más fácil escribir pruebas, lo que conduce a una mejora en la calidad del código. Esta documentación también debe abarcar temas como

source: - Any resources, such as test dataset files that are required
es: - Cualquier recurso, como los archivos de conjuntos de datos de prueba que se requieran

source: - Any configuration/settings adjustments needed to run the tests
es: - Cualquier ajuste de configuración necesaria para realizar las pruebas

source: - What software (such as [testing frameworks](#Use_a_testing_framework)) need to be installed
es: - Qué software (como [frameworks de pruebas](#Use_a_testing_framework)) debe instalarse

source: Ideally, you would provide scripts to set up and configure any resources that are needed.
es: Lo ideal sería proporcionar scripts para instalar y configurar los recursos necesarios.

source: ### Test realistic cases
es: ### Probar casos realistas
